#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x12 (0x12 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.SetupLinkText
struct UAccountLinkingWindow_C_SetupLinkText_Params
{
public:
	class FString                                CallFunc_GetPlatformName_ReturnValue;              // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x11(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.HideLinkOptions
struct UAccountLinkingWindow_C_HideLinkOptions_Params
{
public:
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable2;                               // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable;                                // 0x2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.SetLinkedAccountNeedsPurchase
struct UAccountLinkingWindow_C_SetLinkedAccountNeedsPurchase_Params
{
public:
	bool                                         bInLinkedAccountNeedsPurchase;                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountNotCreated_2B6C467D495BF62E436C79B3550FE868
struct UAccountLinkingWindow_C_OnAccountNotCreated_2B6C467D495BF62E436C79B3550FE868_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountCreatedButNotLinked_2B6C467D495BF62E436C79B3550FE868
struct UAccountLinkingWindow_C_OnAccountCreatedButNotLinked_2B6C467D495BF62E436C79B3550FE868_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountCreatedAndLinked_2B6C467D495BF62E436C79B3550FE868
struct UAccountLinkingWindow_C_OnAccountCreatedAndLinked_2B6C467D495BF62E436C79B3550FE868_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountNotCreated_9EEEC6E44BF7A7C172929DA05184702A
struct UAccountLinkingWindow_C_OnAccountNotCreated_9EEEC6E44BF7A7C172929DA05184702A_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountCreated_9EEEC6E44BF7A7C172929DA05184702A
struct UAccountLinkingWindow_C_OnAccountCreated_9EEEC6E44BF7A7C172929DA05184702A_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnNotPurchased_3B76089F4EB5000544C7BD8B10E707CF
struct UAccountLinkingWindow_C_OnNotPurchased_3B76089F4EB5000544C7BD8B10E707CF_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnPurchased_3B76089F4EB5000544C7BD8B10E707CF
struct UAccountLinkingWindow_C_OnPurchased_3B76089F4EB5000544C7BD8B10E707CF_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnCodeRedeemCanceled_E9B5F30942BE3B295E62309A2EB8DA8D
struct UAccountLinkingWindow_C_OnCodeRedeemCanceled_E9B5F30942BE3B295E62309A2EB8DA8D_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnCodeRedeemComplete_E9B5F30942BE3B295E62309A2EB8DA8D
struct UAccountLinkingWindow_C_OnCodeRedeemComplete_E9B5F30942BE3B295E62309A2EB8DA8D_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnShowHaveEpicAccountScreen_6FD0DEB74DEF4060FC743CB004F3E654
struct UAccountLinkingWindow_C_OnShowHaveEpicAccountScreen_6FD0DEB74DEF4060FC743CB004F3E654_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnShowLinkOrBuyAccessScreen_6FD0DEB74DEF4060FC743CB004F3E654
struct UAccountLinkingWindow_C_OnShowLinkOrBuyAccessScreen_6FD0DEB74DEF4060FC743CB004F3E654_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.ShowBuyAccessScreen
struct UAccountLinkingWindow_C_ShowBuyAccessScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.ShowHaveEpicAccountScreen
struct UAccountLinkingWindow_C_ShowHaveEpicAccountScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.ShowSkipSignInScreen
struct UAccountLinkingWindow_C_ShowSkipSignInScreen_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.ArtificialDelayExpired
struct UAccountLinkingWindow_C_ArtificialDelayExpired_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.StartSignup
struct UAccountLinkingWindow_C_StartSignup_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnActivated
struct UAccountLinkingWindow_C_OnActivated_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.Destruct
struct UAccountLinkingWindow_C_Destruct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.HandleNewPurchaseReceipt
struct UAccountLinkingWindow_C_HandleNewPurchaseReceipt_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.Construct
struct UAccountLinkingWindow_C_Construct_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature
struct UAccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1E0 (0x1E0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.ExecuteUbergraph_AccountLinkingWindow
struct UAccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3FA2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x10(0x10)(ZeroConstructor, NoDestructor)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate2;             // 0x20(0x10)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_WebCreateEpicAccountAndLink* CallFunc_WebCreateEpicAccountAndLink_ReturnValue;  // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate3;             // 0x38(0x10)(ZeroConstructor, NoDestructor)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3FA3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate4;             // 0x50(0x10)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CreateHeadlessAccount* CallFunc_CreateHeadlessAccount_ReturnValue;        // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsValid_ReturnValue2;                     // 0x69(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3FA4[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate5;             // 0x70(0x10)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                          CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x80(0x8)(NoDestructor)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate6;             // 0x88(0x10)(ZeroConstructor, NoDestructor)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate7;             // 0x98(0x10)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_ShowPlatformStoreForPurchase* CallFunc_ShowPlatformStoreForPurchase_ReturnValue; // 0xA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate8;             // 0xB0(0x10)(ZeroConstructor, NoDestructor)
	bool                                         CallFunc_IsValid_ReturnValue3;                     // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3FA5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate9;             // 0xC8(0x10)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_ShowPlatformRedeemCode* CallFunc_ShowPlatformRedeemCode_ReturnValue;       // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate10;            // 0xE0(0x10)(ZeroConstructor, NoDestructor)
	bool                                         CallFunc_IsValid_ReturnValue4;                     // 0xF0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3FA6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate11;            // 0xF8(0x10)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CheckHasRedeemForAccess* CallFunc_CheckHasRedeemForAccess_ReturnValue;      // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable;                                 // 0x110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue5;                     // 0x114(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3FA7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button10;               // 0x118(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button9;                // 0x120(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button8;                // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button7;                // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button6;                // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button5;                // 0x140(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button4;                // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsPurchaseFree_ReturnValue;               // 0x150(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3FA8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0x158(0x18)()
	class UFortUINavigationManager*              CallFunc_GetUINavigationManager_ReturnValue;       // 0x170(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*              CallFunc_GetUINavigationManager_ReturnValue2;      // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*              CallFunc_GetUINavigationManager_ReturnValue3;      // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button3;                // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button2;                // 0x190(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate12;            // 0x198(0x10)(ZeroConstructor, NoDestructor)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate13;            // 0x1A8(0x10)(ZeroConstructor, NoDestructor)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate14;            // 0x1B8(0x10)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*              CallFunc_GetUINavigationManager_ReturnValue4;      // 0x1C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x1D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3FA9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               K2Node_Select2_Default;                            // 0x1D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnViewEula__DelegateSignature
struct UAccountLinkingWindow_C_OnViewEula__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnPopStatus__DelegateSignature
struct UAccountLinkingWindow_C_OnPopStatus__DelegateSignature_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnPushStatus__DelegateSignature
struct UAccountLinkingWindow_C_OnPushStatus__DelegateSignature_Params
{
public:
	class FText                                  StatusText;                                        // 0x0(0x18)(Parm)
};

// 0x18 (0x18 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountLinkingFailed__DelegateSignature
struct UAccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature_Params
{
public:
	class FText                                  FailReason;                                        // 0x0(0x18)(Parm)
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnRequestSignIn__DelegateSignature
struct UAccountLinkingWindow_C_OnRequestSignIn__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountLinkingComplete__DelegateSignature
struct UAccountLinkingWindow_C_OnAccountLinkingComplete__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AccountLinkingWindow.AccountLinkingWindow_C.OnRequestAutoLogin__DelegateSignature
struct UAccountLinkingWindow_C_OnRequestAutoLogin__DelegateSignature_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
