#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_E474A0A1443788298702BBB8575952F3
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_E474A0A1443788298702BBB8575952F3_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_60A93C0847A5CF88A5097DB839DA0904
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_60A93C0847A5CF88A5097DB839DA0904_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_00CD180E4E30AF49AA0BA0BFE7FF2078

struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByBool_842028F9451194FB4F5A959650AF08BF_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByEnum_0F6FD2B44A2E6CD8A5C802B80285281B
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByEnum_0F6FD2B44A2E6CD8A5C802B80285281B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByBool_E292576C487B01AD541F9CA3816C4B11
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByBool_E292576C487B01AD541F9CA3816C4B11_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_9C4FD02D43E207039A2CD9B40541D822
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendSpacePlayer_9C4FD02D43E207039A2CD9B40541D822_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByBool_C7A6B07042E3C3BA70EF50BC14DF129F
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_BlendListByBool_C7A6B07042E3C3BA70EF50BC14DF129F_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_9B9A24B2420550D897F311BB18D49416
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_9B9A24B2420550D897F311BB18D49416_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_RotateRootBone_22E1D22C42568E0972F39BAE1E5E33E5
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_RotateRootBone_22E1D22C42568E0972F39BAE1E5E33E5_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_RotateRootBone_7D8E45344E65A98F79E681B042F9E17D
struct UDefenderAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DefenderAnimBlueprint_AnimGraphNode_RotateRootBone_7D8E45344E65A98F79E681B042F9E17D_Params
{
public:
};

// 0x64 (0x64 - 0x0)
// Function DefenderAnimBlueprint.DefenderAnimBlueprint_C.ExecuteUbergraph_DefenderAnimBlueprint
struct UDefenderAnimBlueprint_C_ExecuteUbergraph_DefenderAnimBlueprint_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue2;                 // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue3;                 // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2ECD[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetCurveValue_ReturnValue;                // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue2;               // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue3;               // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue4;               // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue5;               // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue5;         // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue4;                 // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0x49(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue5;                 // 0x4A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue2;                   // 0x4B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue6;                 // 0x4C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue3;                   // 0x4D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2ECE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetCurveValue_ReturnValue6;               // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetCurveValue_ReturnValue7;               // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue6;         // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue7;         // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
