#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.SetSlotState
struct UAIHotSpotSlot_SetSlotState_Params
{
public:
	enum class EAIHotSpotSlot                    NewState;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpotSlot.SetSlotOwnerAndState
struct UAIHotSpotSlot_SetSlotOwnerAndState_Params
{
public:
	class AAIController*                         NewOwner;                                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    NewState;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4E[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.SetSlotEnabled
struct UAIHotSpotSlot_SetSlotEnabled_Params
{
public:
	bool                                         bNewEnabled;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpotSlot.OnStateChanged
struct UAIHotSpotSlot_OnStateChanged_Params
{
public:
	class AAIController*                         SlotOwner;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    NewState;                                          // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4F[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.IsEnabled
struct UAIHotSpotSlot_IsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpotSlot.IsAIAllowed
struct UAIHotSpotSlot_IsAIAllowed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_50[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.HasUserId
struct UAIHotSpotSlot_HasUserId_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotUserId
struct UAIHotSpotSlot_GetSlotUserId_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotState
struct UAIHotSpotSlot_GetSlotState_Params
{
public:
	enum class EAIHotSpotSlot                    ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotRotation
struct UAIHotSpotSlot_GetSlotRotation_Params
{
public:
	struct FRotator                              ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotRadius
struct UAIHotSpotSlot_GetSlotRadius_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotOwner
struct UAIHotSpotSlot_GetSlotOwner_Params
{
public:
	class AAIController*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotLocation
struct UAIHotSpotSlot_GetSlotLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotIndex
struct UAIHotSpotSlot_GetSlotIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotHeight
struct UAIHotSpotSlot_GetSlotHeight_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetSlotBounds
struct UAIHotSpotSlot_GetSlotBounds_Params
{
public:
	struct FBox                                  ReturnValue;                                       // 0x0(0x1C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpotSlot.GetHotSpot
struct UAIHotSpotSlot_GetHotSpot_Params
{
public:
	class AAIHotSpot*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpotSlot.ClearSlot
struct UAIHotSpotSlot_ClearSlot_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.SetEnabled
struct AAIHotSpot_SetEnabled_Params
{
public:
	bool                                         bEnabled;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.RemoveGroupFromHotspot
struct AAIHotSpot_RemoveGroupFromHotspot_Params
{
public:
	TArray<class AAIController*>                 GroupOfAI;                                         // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_54[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.RemoveFromHotspot
struct AAIHotSpot_RemoveFromHotspot_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAssignFromWaitingList;                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_55[0x6];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotOccupied
struct AAIHotSpot_OnSlotOccupied_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotFreed
struct AAIHotSpot_OnSlotFreed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotEnabled
struct AAIHotSpot_OnSlotEnabled_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotDisabled
struct AAIHotSpot_OnSlotDisabled_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotClaimed
struct AAIHotSpot_OnSlotClaimed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnSlotBlocked
struct AAIHotSpot_OnSlotBlocked_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnRemovedSlotlessBehavior
struct AAIHotSpot_OnRemovedSlotlessBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClamingSlot;                                    // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_56[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnRemovedBehavior
struct AAIHotSpot_OnRemovedBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    PrevState;                                         // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasOnWaitingList;                                 // 0x11(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_57[0x6];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnMoveToSlotFinished
struct AAIHotSpot_OnMoveToSlotFinished_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResult;                                           // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_58[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpot.OnHotSpotEnabled
struct AAIHotSpot_OnHotSpotEnabled_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpot.OnHotSpotDisabled
struct AAIHotSpot_OnHotSpotDisabled_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.OnAssignedSlotlessBehavior
struct AAIHotSpot_OnAssignedSlotlessBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_59[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnAssignedOccupiedBehavior
struct AAIHotSpot_OnAssignedOccupiedBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5A[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.OnAssignedClaimedBehavior
struct AAIHotSpot_OnAssignedClaimedBehavior_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UserId;                                            // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasOnWaitingList;                                 // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x11(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5B[0x6];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.OccupySlotByIndex
struct AAIHotSpot_OccupySlotByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5C[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.IsSlotlessAssignmentAllowed
struct AAIHotSpot_IsSlotlessAssignmentAllowed_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.IsEnabled
struct AAIHotSpot_IsEnabled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.IsAIAllowed
struct AAIHotSpot_IsAIAllowed_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5D[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AIHotSpot.HasEnabledSlots
struct AAIHotSpot_HasEnabledSlots_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.HasAssignedAI
struct AAIHotSpot_HasAssignedAI_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotAssignmentFilter        Filter;                                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5E[0x6];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotUserIdByIndex
struct AAIHotSpot_GetSlotUserIdByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotStateByOwner
struct AAIHotSpot_GetSlotStateByOwner_Params
{
public:
	class AAIController*                         AIOwner;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5F[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotStateByIndex
struct AAIHotSpot_GetSlotStateByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIHotSpotSlot                    ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_60[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotRotationByIndex
struct AAIHotSpot_GetSlotRotationByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              ReturnValue;                                       // 0x4(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotOwnerByIndex
struct AAIHotSpot_GetSlotOwnerByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_61[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AAIController*                         ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotLocationByIndex
struct AAIHotSpot_GetSlotLocationByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ReturnValue;                                       // 0x4(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotIndexByOwner
struct AAIHotSpot_GetSlotIndexByOwner_Params
{
public:
	class AAIController*                         AIOwner;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_62[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotCount
struct AAIHotSpot_GetSlotCount_Params
{
public:
	enum class EAIHotSpotSlotFilter              Filter;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_63[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotByOwner
struct AAIHotSpot_GetSlotByOwner_Params
{
public:
	class AAIController*                         AIOwner;                                           // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIHotSpotSlot*                        ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.GetSlotByIndex
struct AAIHotSpot_GetSlotByIndex_Params
{
public:
	int32                                        Index;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_64[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlot*                        ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpot.GetAssignedAICount
struct AAIHotSpot_GetAssignedAICount_Params
{
public:
	enum class EAIHotSpotAssignmentFilter        Filter;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_65[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.GetAssignedAI
struct AAIHotSpot_GetAssignedAI_Params
{
public:
	enum class EAIHotSpotAssignmentFilter        Filter;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_66[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AAIController*>                 ReturnValue;                                       // 0x8(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.AIHotSpot.FindBestSlotIndices
struct AAIHotSpot_FindBestSlotIndices_Params
{
public:
	TArray<class AAIController*>                 AI;                                                // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                ReturnValue;                                       // 0x10(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.FindBestSlotIndex
struct AAIHotSpot_FindBestSlotIndex_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x8(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_67[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.CanUseSlotByIndex
struct AAIHotSpot_CanUseSlotByIndex_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_68[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.AssignToSlotByIndex
struct AAIHotSpot_AssignToSlotByIndex_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xC(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_69[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AIHotSpot.AssignToHotspot
struct AAIHotSpot_AssignToHotspot_Params
{
public:
	class AAIController*                         AI;                                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6A[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AIHotSpot.AssignGroupToHotspot
struct AAIHotSpot_AssignGroupToHotspot_Params
{
public:
	TArray<class AAIController*>                 GroupOfAI;                                         // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6B[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpot.AssignFromWaitingList
struct AAIHotSpot_AssignFromWaitingList_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortInventorySortFunctionLibrary.GetCriterionDisplayNameOfSortType
struct UFortInventorySortFunctionLibrary_GetCriterionDisplayNameOfSortType_Params
{
public:
	enum class EInventoryContentSortType         SortType;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_71[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.FortBrushSizeFunctionLibrary.ShrinkBrushSize
struct UFortBrushSizeFunctionLibrary_ShrinkBrushSize_Params
{
public:
	enum class EFortBrushSize                    OriginalBrushSize;                                 // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_72[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Steps;                                             // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBrushSize                    ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_73[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// Function FortniteGame.FortBrushSizeFunctionLibrary.GrowBrushSize
struct UFortBrushSizeFunctionLibrary_GrowBrushSize_Params
{
public:
	enum class EFortBrushSize                    OriginalBrushSize;                                 // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_74[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Steps;                                             // 0x4(0x4)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBrushSize                    ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_75[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemCollectedParams.SetParams
struct UFortItemCollectedParams_SetParams_Params
{
public:
	class UFortWorldItemDefinition*              _CollectedItemDefinition;                          // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _CollectedBy;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        _AmountCollected;                                  // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7B[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemCollectedParams*              ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemCollectedParams.BreakParams
struct UFortItemCollectedParams_BreakParams_Params
{
public:
	class UFortWorldItemDefinition*              _CollectedItemDefinition;                          // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _CollectedBy;                                      // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        _AmountCollected;                                  // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7C[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemDroppedParams.SetParams
struct UFortItemDroppedParams_SetParams_Params
{
public:
	class UFortWorldItemDefinition*              _DroppedItemDefinition;                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _DroppedBy;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        _AmountCollected;                                  // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7E[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemDroppedParams*                ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDroppedParams.BreakParams
struct UFortItemDroppedParams_BreakParams_Params
{
public:
	class UFortWorldItemDefinition*              _DroppedItemDefinition;                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _DroppedBy;                                        // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        _AmountCollected;                                  // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7F[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemCraftedParams.SetParams
struct UFortItemCraftedParams_SetParams_Params
{
public:
	class UFortSchematicItemDefinition*          _SchematicDefinition;                              // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _CraftedBy;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        _AmountCrafted;                                    // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         _bItemWasQuickCrafted;                             // 0x14(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_81[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemCraftedParams*                ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemCraftedParams.BreakParams
struct UFortItemCraftedParams_BreakParams_Params
{
public:
	class UFortSchematicItemDefinition*          _SchematicDefinition;                              // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _CraftedBy;                                        // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        _AmountCrafted;                                    // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         _bItemWasQuickCrafted;                             // 0x14(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_82[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortEnemyKilledParams.SetParams
struct UFortEnemyKilledParams_SetParams_Params
{
public:
	class AFortPawn*                             _KilledPawn;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _KilledBy;                                         // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortEnemyKilledParams*                ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortEnemyKilledParams.BreakParams
struct UFortEnemyKilledParams_BreakParams_Params
{
public:
	class AFortPawn*                             _KilledPawn;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _KilledBy;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortEnemyDamagedParams.SetParams
struct UFortEnemyDamagedParams_SetParams_Params
{
public:
	class AFortPawn*                             _DamagedPawn;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _DamagedBy;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        _DamageAmount;                                     // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_84[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortEnemyDamagedParams*               ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortEnemyDamagedParams.BreakParams
struct UFortEnemyDamagedParams_BreakParams_Params
{
public:
	class AFortPawn*                             _DamagedPawn;                                      // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 _DamagedBy;                                        // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        _DamageAmount;                                     // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_85[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortNewPlayerParams.SetParams
struct UFortNewPlayerParams_SetParams_Params
{
public:
	class AFortPlayerController*                 _NewPlayerController;                              // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortNewPlayerParams*                  ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortNewPlayerParams.BreakParams
struct UFortNewPlayerParams_BreakParams_Params
{
public:
	class AFortPlayerController*                 _NewPlayerController;                              // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortPlayerExitParams.SetParams
struct UFortPlayerExitParams_SetParams_Params
{
public:
	class AFortPlayerController*                 _ExitingPlayerController;                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerExitParams*                 ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortPlayerExitParams.BreakParams
struct UFortPlayerExitParams_BreakParams_Params
{
public:
	class AFortPlayerController*                 _ExitingPlayerController;                          // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortPlayerSpawnedParams.SetParams
struct UFortPlayerSpawnedParams_SetParams_Params
{
public:
	class AFortPlayerController*                 _SpawnedPlayerController;                          // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerSpawnedParams*              ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortPlayerSpawnedParams.BreakParams
struct UFortPlayerSpawnedParams_BreakParams_Params
{
public:
	class AFortPlayerController*                 _SpawnedPlayerController;                          // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortPlayerDiedParams.SetParams
struct UFortPlayerDiedParams_SetParams_Params
{
public:
	class AFortPlayerPawn*                       _KilledPlayer;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           _KilledBy;                                         // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerDiedParams*                 ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortPlayerDiedParams.BreakParams
struct UFortPlayerDiedParams_BreakParams_Params
{
public:
	class AFortPlayerPawn*                       _KilledPlayer;                                     // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           _KilledBy;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortPlayerDBNOEnterParams.SetParams
struct UFortPlayerDBNOEnterParams_SetParams_Params
{
public:
	class AFortPlayerPawn*                       _KilledPlayer;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           _KilledBy;                                         // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerDBNOEnterParams*            ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortPlayerDBNOEnterParams.BreakParams
struct UFortPlayerDBNOEnterParams_BreakParams_Params
{
public:
	class AFortPlayerPawn*                       _KilledPlayer;                                     // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           _KilledBy;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortPlayerDBNORevivedParams.SetParams
struct UFortPlayerDBNORevivedParams_SetParams_Params
{
public:
	class AFortPlayerPawn*                       _RevivedPlayer;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           _RevivedBy;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerDBNORevivedParams*          ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortPlayerDBNORevivedParams.BreakParams
struct UFortPlayerDBNORevivedParams_BreakParams_Params
{
public:
	class AFortPlayerPawn*                       _RevivedPlayer;                                    // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           _RevivedBy;                                        // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortDayPhaseChangeParams.SetParams
struct UFortDayPhaseChangeParams_SetParams_Params
{
public:
	class AFortTimeOfDayManager*                 _LightingAndFogManager;                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     _NewDayPhase;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_87[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortDayPhaseChangeParams*             ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortDayPhaseChangeParams.BreakParams
struct UFortDayPhaseChangeParams_BreakParams_Params
{
public:
	class AFortTimeOfDayManager*                 _LightingAndFogManager;                            // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     _NewDayPhase;                                      // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortPlayerBuiltParams.SetParams
struct UFortPlayerBuiltParams_SetParams_Params
{
public:
	class ABuildingActor*                        _Building;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerController*                 _Builder;                                          // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortPlayerBuiltParams*                ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortPlayerBuiltParams.BreakParams
struct UFortPlayerBuiltParams_BreakParams_Params
{
public:
	class ABuildingActor*                        _Building;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8B[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerController*                 _Builder;                                          // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortBuildingDestroyedParams.SetParams
struct UFortBuildingDestroyedParams_SetParams_Params
{
public:
	class ABuildingActor*                        _Building;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8D[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           _Destroyer;                                        // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortBuildingDestroyedParams*          ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortBuildingDestroyedParams.BreakParams
struct UFortBuildingDestroyedParams_BreakParams_Params
{
public:
	class ABuildingActor*                        _Building;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8E[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           _Destroyer;                                        // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortBuildingEditedParams.SetParams
struct UFortBuildingEditedParams_SetParams_Params
{
public:
	class ABuildingActor*                        _OriginalBuilding;                                 // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingActor*                        _NewBuilding;                                      // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_90[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerController*                 _Editor;                                           // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortBuildingEditedParams*             ThisParam;                                         // 0x20(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortBuildingEditedParams.BreakParams
struct UFortBuildingEditedParams_BreakParams_Params
{
public:
	class ABuildingActor*                        _OriginalBuilding;                                 // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingActor*                        _NewBuilding;                                      // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x10(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_91[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerController*                 _Editor;                                           // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortBuildingDamagedParams.SetParams
struct UFortBuildingDamagedParams_SetParams_Params
{
public:
	class ABuildingActor*                        _Building;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_93[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           _DamagedBy;                                        // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        _DamageAmount;                                     // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_94[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortBuildingDamagedParams*            ThisParam;                                         // 0x20(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortBuildingDamagedParams.BreakParams
struct UFortBuildingDamagedParams_BreakParams_Params
{
public:
	class ABuildingActor*                        _Building;                                         // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingType                 _BuildingType;                                     // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_95[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           _DamagedBy;                                        // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        _DamageAmount;                                     // 0x18(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_96[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortMissionSucceededParams.SetParams
struct UFortMissionSucceededParams_SetParams_Params
{
public:
	class AFortMission*                          _SucceededMission;                                 // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortMissionSucceededParams*           ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortMissionSucceededParams.BreakParams
struct UFortMissionSucceededParams_BreakParams_Params
{
public:
	class AFortMission*                          _SucceededMission;                                 // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortMissionFailedParams.SetParams
struct UFortMissionFailedParams_SetParams_Params
{
public:
	class AFortMission*                          _FailedMission;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortMissionFailedParams*              ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortMissionFailedParams.BreakParams
struct UFortMissionFailedParams_BreakParams_Params
{
public:
	class AFortMission*                          _FailedMission;                                    // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortMissionForceSuccessParams.SetParams
struct UFortMissionForceSuccessParams_SetParams_Params
{
public:
	float                                        _FractionCompleted;                                // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_99[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortMissionForceSuccessParams*        ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortMissionForceSuccessParams.BreakParams
struct UFortMissionForceSuccessParams_BreakParams_Params
{
public:
	float                                        _FractionCompleted;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortMissionNeutralCompleteParams.SetParams
struct UFortMissionNeutralCompleteParams_SetParams_Params
{
public:
	class AFortMission*                          _NeutrallyCompletedMission;                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortMissionNeutralCompleteParams*     ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortMissionNeutralCompleteParams.BreakParams
struct UFortMissionNeutralCompleteParams_BreakParams_Params
{
public:
	class AFortMission*                          _NeutrallyCompletedMission;                        // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortObjectiveSucceededParams.SetParams
struct UFortObjectiveSucceededParams_SetParams_Params
{
public:
	class AFortObjectiveBase*                    _SucceededObjective;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortObjectiveSucceededParams*         ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortObjectiveSucceededParams.BreakParams
struct UFortObjectiveSucceededParams_BreakParams_Params
{
public:
	class AFortObjectiveBase*                    _SucceededObjective;                               // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortObjectiveFailedParams.SetParams
struct UFortObjectiveFailedParams_SetParams_Params
{
public:
	class AFortObjectiveBase*                    _FailedObjective;                                  // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortObjectiveFailedParams*            ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortObjectiveFailedParams.BreakParams
struct UFortObjectiveFailedParams_BreakParams_Params
{
public:
	class AFortObjectiveBase*                    _FailedObjective;                                  // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortObjectiveNeutralCompleteParams.SetParams
struct UFortObjectiveNeutralCompleteParams_SetParams_Params
{
public:
	class AFortObjectiveBase*                    _NeutrallyCompletedObjective;                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortObjectiveNeutralCompleteParams*   ThisParam;                                         // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortObjectiveNeutralCompleteParams.BreakParams
struct UFortObjectiveNeutralCompleteParams_BreakParams_Params
{
public:
	class AFortObjectiveBase*                    _NeutrallyCompletedObjective;                      // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortToggledCursorModeParams.SetParams
struct UFortToggledCursorModeParams_SetParams_Params
{
public:
	class AFortPlayerController*                 _PlayerThatToggledCursorMode;                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         InCursorMode;                                      // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9B[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortToggledCursorModeParams*          ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortToggledCursorModeParams.BreakParams
struct UFortToggledCursorModeParams_BreakParams_Params
{
public:
	class AFortPlayerController*                 _PlayerThatToggledCursorMode;                      // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         InCursorMode;                                      // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9C[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortToggledOptionsMenuParams.SetParams
struct UFortToggledOptionsMenuParams_SetParams_Params
{
public:
	class AFortPlayerController*                 _PlayerThatToggledOptionsMenu;                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Opened;                                            // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9E[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortToggledOptionsMenuParams*         ThisParam;                                         // 0x10(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortToggledOptionsMenuParams.BreakParams
struct UFortToggledOptionsMenuParams_BreakParams_Params
{
public:
	class AFortPlayerController*                 _PlayerThatToggledOptionsMenu;                     // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Opened;                                            // 0x8(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9F[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortToggledEditModeParams.SetParams
struct UFortToggledEditModeParams_SetParams_Params
{
public:
	class AFortPlayerController*                 _PlayerThatToggledEditMode;                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingSMActor*                      InEditableActor;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         InEditMode;                                        // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A1[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortToggledEditModeParams*            ThisParam;                                         // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortToggledEditModeParams.BreakParams
struct UFortToggledEditModeParams_BreakParams_Params
{
public:
	class AFortPlayerController*                 _PlayerThatToggledEditMode;                        // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABuildingSMActor*                      EditableActor;                                     // 0x8(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         InEditMode;                                        // 0x10(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A2[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortStartLeavingZoneParams.BreakParams
struct UFortStartLeavingZoneParams_BreakParams_Params
{
public:
	class AFortPlayerPawn*                       _PlayerRequestingLeaving;                          // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2C (0x2C - 0x0)
// Function FortniteGame.FortInteractInterface.ServerOnAttemptInteract
struct UFortInteractInterface_ServerOnAttemptInteract_Params
{
public:
	struct FInteractionType                      InteractType;                                      // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A5[0x3];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortTeamActorInterface.GetTeam
struct UFortTeamActorInterface_GetTeam_Params
{
public:
	enum class EFortTeam                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortInitializationInterface.WorldReady
struct UFortInitializationInterface_WorldReady_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortInitializationInterface.NeedsWorldReady
struct UFortInitializationInterface_NeedsWorldReady_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortInitializationInterface.MatchStarted
struct UFortInitializationInterface_MatchStarted_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortSpawnableByPlacementSystemInterface.GetMissionGuid
struct UFortSpawnableByPlacementSystemInterface_GetMissionGuid_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortSpawnableByPlacementSystemInterface.GetMission
struct UFortSpawnableByPlacementSystemInterface_GetMission_Params
{
public:
	class AFortMission*                          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.UseDefaultHealthBar
struct ABuildingActor_UseDefaultHealthBar_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.SilentDie
struct ABuildingActor_SilentDie_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.ShouldDie
struct ABuildingActor_ShouldDie_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A6[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           EventInstigator;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0x10(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A7[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetNavigationModifier
struct ABuildingActor_SetNavigationModifier_Params
{
public:
	bool                                         bEnableModifier;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.SetCustomState
struct ABuildingActor_SetCustomState_Params
{
public:
	class FString                                NewState;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.SetCanExportNavigationObstacle
struct ABuildingActor_SetCanExportNavigationObstacle_Params
{
public:
	bool                                         InCanExportNavigationObstacle;                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.RemoveEditorOnlyInstanceGameplayTags
struct ABuildingActor_RemoveEditorOnlyInstanceGameplayTags_Params
{
public:
	struct FGameplayTagContainer                 TagsToRemove;                                      // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.PlacedByPlacementTool
struct ABuildingActor_PlacedByPlacementTool_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnWorldReady
struct ABuildingActor_OnWorldReady_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_CustomState
struct ABuildingActor_OnRep_CustomState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_CurrentBuildingLevel
struct ABuildingActor_OnRep_CurrentBuildingLevel_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_BuildingAttributeSet
struct ABuildingActor_OnRep_BuildingAttributeSet_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_bForceReplayRollback
struct ABuildingActor_OnRep_bForceReplayRollback_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnRep_AbilitySystemComponent
struct ABuildingActor_OnRep_AbilitySystemComponent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.OnMatchStarted
struct ABuildingActor_OnMatchStarted_Params
{
public:
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDeathServer
struct ABuildingActor_OnDeathServer_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A8[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A9[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            HitInfo;                                           // 0x38(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AController*                           InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDeathPlayEffects
struct ABuildingActor_OnDeathPlayEffects_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AA[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AB[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            HitInfo;                                           // 0x38(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AFortPawn*                             InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x3 (0x3 - 0x0)
// Function FortniteGame.BuildingActor.OnDayPhaseChanged
struct ABuildingActor_OnDayPhaseChanged_Params
{
public:
	enum class EFortDayPhase                     CurrentDayPhase;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortDayPhase                     PreviousDayPhase;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAtCreation;                                       // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDamageServer
struct ABuildingActor_OnDamageServer_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AC[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AD[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            HitInfo;                                           // 0x38(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AController*                           InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function FortniteGame.BuildingActor.OnDamagePlayEffects
struct ABuildingActor_OnDamagePlayEffects_Params
{
public:
	float                                        Damage;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AE[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 DamageTags;                                        // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                               Momentum;                                          // 0x28(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AF[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            HitInfo;                                           // 0x38(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AFortPawn*                             InstigatedBy;                                      // 0xC0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0xC8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          EffectContext;                                     // 0xD0(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.BuildingActor.OnBuildingActorInitialized
struct ABuildingActor_OnBuildingActorInitialized_Params
{
public:
	enum class EFortBuildingInitializationReason InitializationReason;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortBuildingPersistentState      BuildingPersistentState;                           // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.IsPlayerBuilt
struct ABuildingActor_IsPlayerBuilt_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.IsDamaged
struct ABuildingActor_IsDamaged_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteGame.BuildingActor.IsAcceptablePositionForPlacement
struct ABuildingActor_IsAcceptablePositionForPlacement_Params
{
public:
	struct FVector                               InLocation;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              InRotation;                                        // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AFortDecoTool*                         DecoTool;                                          // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCDO;                                            // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B0[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OutFailureReason;                                  // 0x28(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x40(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B1[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.InitializeKismetSpawnedBuildingActor
struct ABuildingActor_InitializeKismetSpawnedBuildingActor_Params
{
public:
	class ABuildingActor*                        BuildingOwner;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AFortPlayerController*                 SpawningController;                                // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingActor.HasHealthLeft
struct ABuildingActor_HasHealthLeft_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.HandleDestroyed
struct ABuildingActor_HandleDestroyed_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.GetOwningPlayerState
struct ABuildingActor_GetOwningPlayerState_Params
{
public:
	class AFortPlayerState*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.GetOwningController
struct ABuildingActor_GetOwningController_Params
{
public:
	class AController*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetMissingHealth
struct ABuildingActor_GetMissingHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetMaxHealth
struct ABuildingActor_GetMaxHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetHealthPercent
struct ABuildingActor_GetHealthPercent_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetHealth
struct ABuildingActor_GetHealth_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.GetEditorTestTags
struct ABuildingActor_GetEditorTestTags_Params
{
public:
	struct FGameplayTagContainer                 TagContainer;                                      // 0x0(0x20)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.GetCustomState
struct ABuildingActor_GetCustomState_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.GetCurrentBuildingLevel
struct ABuildingActor_GetCurrentBuildingLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.BuildingActor.GetCentroid
struct ABuildingActor_GetCentroid_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingActor.GameplayCue_InstantDeath
struct ABuildingActor_GameplayCue_InstantDeath_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B2[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingActor.GameplayCue_Healing
struct ABuildingActor_GameplayCue_Healing_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B3[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingActor.GameplayCue_Damage
struct ABuildingActor_GameplayCue_Damage_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B4[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingActor.ForceBuildingHealth
struct ABuildingActor_ForceBuildingHealth_Params
{
public:
	float                                        NewHealth;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.CustomStateChanged
struct ABuildingActor_CustomStateChanged_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintOnLocalInteract
struct ABuildingActor_BlueprintOnLocalInteract_Params
{
public:
	class AFortPlayerPawn*                       InteractingPawn;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B5[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintOnInteract
struct ABuildingActor_BlueprintOnInteract_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintOnBeginInteract
struct ABuildingActor_BlueprintOnBeginInteract_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintGetInteractionString
struct ABuildingActor_BlueprintGetInteractionString_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintGetFailedInteractionString
struct ABuildingActor_BlueprintGetFailedInteractionString_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingActor.BlueprintCanInteract
struct ABuildingActor_BlueprintCanInteract_Params
{
public:
	class AFortPawn*                             InteractingPawn;                                   // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B6[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingActor.AddEditorOnlyInstanceGameplayTags
struct ABuildingActor_AddEditorOnlyInstanceGameplayTags_Params
{
public:
	struct FGameplayTagContainer                 NewTags;                                           // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortCrackEffect.OnStartDirectionEffect
struct AFortCrackEffect_OnStartDirectionEffect_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortCrackEffect.OnRep_PhysicalSurfaceType
struct AFortCrackEffect_OnRep_PhysicalSurfaceType_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortCrackEffect.OnRep_HitNormal
struct AFortCrackEffect_OnRep_HitNormal_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortCrackEffect.OnHitCrack
struct AFortCrackEffect_OnHitCrack_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortCrackEffect.OnFadeOut
struct AFortCrackEffect_OnFadeOut_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortCrackEffect.OnBounceAnimationUpdate
struct AFortCrackEffect_OnBounceAnimationUpdate_Params
{
public:
	struct FFortBounceData                       BounceData;                                        // 0x0(0x30)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortCrackEffect.HasStartingPosition
struct AFortCrackEffect_HasStartingPosition_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortAttachToActorInterface.GetActorAttachedTo
struct UFortAttachToActorInterface_GetActorAttachedTo_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.WillRegisterWithStructuralGrid
struct ABuildingSMActor_WillRegisterWithStructuralGrid_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateRepairMaterialAnim
struct ABuildingSMActor_UpdateRepairMaterialAnim_Params
{
public:
	float                                        CurveValue;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateLODOverrideEffect
struct ABuildingSMActor_UpdateLODOverrideEffect_Params
{
public:
	float                                        CurveValue;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.UpdateDynamicShrinkAndDestroyEffect
struct ABuildingSMActor_UpdateDynamicShrinkAndDestroyEffect_Params
{
public:
	float                                        CurveValue;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.SetMirrored
struct ABuildingSMActor_SetMirrored_Params
{
public:
	bool                                         bIsMirrored;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.RepairBuilding
struct ABuildingSMActor_RepairBuilding_Params
{
public:
	class AFortPlayerController*                 RepairingController;                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ResourcesSpent;                                    // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CF[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRepairStarted
struct ABuildingSMActor_OnRepairStarted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_WeakSpotPositions
struct ABuildingSMActor_OnRep_WeakSpotPositions_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ResourceType
struct ABuildingSMActor_OnRep_ResourceType_Params
{
public:
	enum class EFortResourceType                 OldType;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ReplicatedMIC
struct ABuildingSMActor_OnRep_ReplicatedMIC_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_ReplicatedDrawScale3D
struct ABuildingSMActor_OnRep_ReplicatedDrawScale3D_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_RelevantBASE
struct ABuildingSMActor_OnRep_RelevantBASE_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_MetaData
struct ABuildingSMActor_OnRep_MetaData_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_EditingPlayer
struct ABuildingSMActor_OnRep_EditingPlayer_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_bUnderRepair
struct ABuildingSMActor_OnRep_bUnderRepair_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_bUnderConstruction
struct ABuildingSMActor_OnRep_bUnderConstruction_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_BuildingReplacementType
struct ABuildingSMActor_OnRep_BuildingReplacementType_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnRep_bCollisionBlockedByPawns
struct ABuildingSMActor_OnRep_bCollisionBlockedByPawns_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnLODOverrideEffectFinished
struct ABuildingSMActor_OnLODOverrideEffectFinished_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.OnDynamicShrinkAndDestroyEffectFinished
struct ABuildingSMActor_OnDynamicShrinkAndDestroyEffectFinished_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.OnDetachFromBuilding
struct ABuildingSMActor_OnDetachFromBuilding_Params
{
public:
	class ABuildingSMActor*                      AttachedToBuilding;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBeingDestroyed;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D0[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.BuildingSMActor.OnBounceAnimationUpdate
struct ABuildingSMActor_OnBounceAnimationUpdate_Params
{
public:
	struct FFortBounceData                       Data;                                              // 0x0(0x30)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.OnAttachToBuilding
struct ABuildingSMActor_OnAttachToBuilding_Params
{
public:
	class ABuildingSMActor*                      AttachedToBuilding;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.MulticastRequestBuildingAnimation
struct ABuildingSMActor_MulticastRequestBuildingAnimation_Params
{
public:
	enum class EBuildingAnim                     RequestedAnimation;                                // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.MulticastPlayFullHealthEffects
struct ABuildingSMActor_MulticastPlayFullHealthEffects_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.MarkConnectedBuildingsForStructuralIntegrityCheck
struct ABuildingSMActor_MarkConnectedBuildingsForStructuralIntegrityCheck_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.IsSupportedByWorld
struct ABuildingSMActor_IsSupportedByWorld_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.IsStructurallySupported
struct ABuildingSMActor_IsStructurallySupported_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.HasDestructionLoot
struct ABuildingSMActor_HasDestructionLoot_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.GetWindSpeedCurveForPreview
struct ABuildingSMActor_GetWindSpeedCurveForPreview_Params
{
public:
	class UCurveLinearColor*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.GetWindPannerSpeedCurveForPreview
struct ABuildingSMActor_GetWindPannerSpeedCurveForPreview_Params
{
public:
	class UCurveLinearColor*                     ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingSMActor.GetReplacementDestructionReason
struct ABuildingSMActor_GetReplacementDestructionReason_Params
{
public:
	enum class EBuildingReplacementType          ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingSMActor.GetLogicalBuildingIndex
struct ABuildingSMActor_GetLogicalBuildingIndex_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingSMActor.GetIntenseWindMaterialsForPreview
struct ABuildingSMActor_GetIntenseWindMaterialsForPreview_Params
{
public:
	TArray<class UMaterialInterface*>            Materials;                                         // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D1[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.GetBuildingMeshComponent
struct ABuildingSMActor_GetBuildingMeshComponent_Params
{
public:
	class UStaticMeshComponent*                  ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.GetAttachedBuildingActors
struct ABuildingSMActor_GetAttachedBuildingActors_Params
{
public:
	TArray<class ABuildingSMActor*>              ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.GetAnimatingMID
struct ABuildingSMActor_GetAnimatingMID_Params
{
public:
	int32                                        ElementIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D2[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingSMActor.GameplayCue_Abilities_Activation_Generic_BannerWallBuff2
struct ABuildingSMActor_GameplayCue_Abilities_Activation_Generic_BannerWallBuff2_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D3[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingSMActor.GameplayCue_Abilities_Activation_Generic_BannerWallBuff1
struct ABuildingSMActor_GameplayCue_Abilities_Activation_Generic_BannerWallBuff1_Params
{
public:
	enum class EGameplayCueEvent                 EventType;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D4[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayCueParameters                Parameters;                                        // 0x8(0xB8)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.ForceIntoStructuralGridDuringRuntime
struct ABuildingSMActor_ForceIntoStructuralGridDuringRuntime_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlySetInstanceMaterialVectorParameter
struct ABuildingSMActor_EditorOnlySetInstanceMaterialVectorParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          Value;                                             // 0x8(0x10)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlySetInstanceMaterialTextureParameter
struct ABuildingSMActor_EditorOnlySetInstanceMaterialTextureParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              Value;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlySetInstanceMaterialScalarParameter
struct ABuildingSMActor_EditorOnlySetInstanceMaterialScalarParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D5[0x4];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlyRemoveInstanceMaterialVectorParameter
struct ABuildingSMActor_EditorOnlyRemoveInstanceMaterialVectorParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlyRemoveInstanceMaterialTextureParameter
struct ABuildingSMActor_EditorOnlyRemoveInstanceMaterialTextureParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingSMActor.EditorOnlyRemoveInstanceMaterialScalarParameter
struct ABuildingSMActor_EditorOnlyRemoveInstanceMaterialScalarParameter_Params
{
public:
	class FName                                  ParamName;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.DetachBuildingActorFromMe
struct ABuildingSMActor_DetachBuildingActorFromMe_Params
{
public:
	class ABuildingSMActor*                      ActorToAttach;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBeingDestroyed;                                   // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D6[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.BlueprintOnStructurallyUnstable
struct ABuildingSMActor_BlueprintOnStructurallyUnstable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingSMActor.BlueprintOnStructurallyStable
struct ABuildingSMActor_BlueprintOnStructurallyStable_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingSMActor.AttachBuildingActorToMe
struct ABuildingSMActor_AttachBuildingActorToMe_Params
{
public:
	class ABuildingSMActor*                      ActorToAttach;                                     // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceAttachment;                                  // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D7[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingEditModeSupport.OnSuccessfulMatchInteractParamUpdate
struct UBuildingEditModeSupport_OnSuccessfulMatchInteractParamUpdate_Params
{
public:
	float                                        NewInteractParamVal;                               // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingEditModeSupport.OnSuccessfulMatchInteractComplete
struct UBuildingEditModeSupport_OnSuccessfulMatchInteractComplete_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingStructuralSupportSystem.K2_GetLogicalBuildingActors
struct UBuildingStructuralSupportSystem_K2_GetLogicalBuildingActors_Params
{
public:
	int32                                        LogicalIdx;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABuildingSMActor*>              LogicalBuildingActors;                             // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingStructuralSupportSystem.IsBuildingActorStructurallySupported
struct UBuildingStructuralSupportSystem_IsBuildingActorStructurallySupported_Params
{
public:
	class ABuildingSMActor*                      ActorToCheck;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F3[0x7];                                       // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingStructuralSupportSystem.GetLogicalBuildingGroundSupportedActors
struct UBuildingStructuralSupportSystem_GetLogicalBuildingGroundSupportedActors_Params
{
public:
	int32                                        LogicalIndex;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F4[0x4];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABuildingSMActor*>              LogicalBuildingGroundSupportedActors;              // 0x8(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AIHotSpotSlotGenerator.GetHotSpot
struct UAIHotSpotSlotGenerator_GetHotSpot_Params
{
public:
	class AAIHotSpot*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AIHotSpotSlotGenerator.GenerateSlots
struct UAIHotSpotSlotGenerator_GenerateSlots_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.AIHotSpotSlotGenerator.AddSlot
struct UAIHotSpotSlotGenerator_AddSlot_Params
{
public:
	struct FVector                               RelativeLocation;                                  // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RelativeRotation;                                  // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UAIHotSpotSlot>            CustomSlotClass;                                   // 0x18(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnabled;                                          // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FC[0x7];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	class UAIHotSpotSlot*                        ReturnValue;                                       // 0x28(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.StopRecordingFTestPerf
struct UAutomationPerfMonitorManager_StopRecordingFTestPerf_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.StartRecordingFTestPerf
struct UAutomationPerfMonitorManager_StartRecordingFTestPerf_Params
{
public:
	TArray<class FString>                        StatsToRecord;                                     // 0x0(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.IsRecordingFTestPerf
struct UAutomationPerfMonitorManager_IsRecordingFTestPerf_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.GetStatAverage
struct UAutomationPerfMonitorManager_GetStatAverage_Params
{
public:
	class FString                                StatName;                                          // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x10(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_101[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.AutomationPerfMonitorManager.GetPerfMonitorInstance
struct UAutomationPerfMonitorManager_GetPerfMonitorInstance_Params
{
public:
	class UAutomationPerfMonitorManager*         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.FortTargetSelectionInterface.GetTargetingTransform
struct UFortTargetSelectionInterface_GetTargetingTransform_Params
{
public:
	enum class EFortAbilityTargetingSource       Source;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_106[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortGameplayAbility*                  SourceAbility;                                     // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            ReturnValue;                                       // 0x10(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetTouchComponentForAbilityDeliveryInfo
struct ABuildingGameplayActor_SetTouchComponentForAbilityDeliveryInfo_Params
{
public:
	class UPrimitiveComponent*                   PrimitiveComponent;                                // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetInitialVelocity
struct ABuildingGameplayActor_SetInitialVelocity_Params
{
public:
	struct FVector                               InitialVelocity;                                   // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetIgnoreInstigatorCollision
struct ABuildingGameplayActor_SetIgnoreInstigatorCollision_Params
{
public:
	bool                                         bShouldIgnore;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingGameplayActor.SetAbilitySourceLevel
struct ABuildingGameplayActor_SetAbilitySourceLevel_Params
{
public:
	int32                                        NewAbilitySourceLevel;                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingGameplayActor.OnRegisteredTouchComponentEndOverlap
struct ABuildingGameplayActor_OnRegisteredTouchComponentEndOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Other;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_107[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.OnRegisteredTouchComponentBeginOverlap
struct ABuildingGameplayActor_OnRegisteredTouchComponentBeginOverlap_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Other;                                             // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_108[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_RemoveGameplayCue
struct ABuildingGameplayActor_K2_RemoveGameplayCue_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_ExecuteGameplayCueWithParams
struct ABuildingGameplayActor_K2_ExecuteGameplayCueWithParams_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayCueParameters                GameplayCueParameters;                             // 0x8(0xB8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_ExecuteGameplayCue
struct ABuildingGameplayActor_K2_ExecuteGameplayCue_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          Context;                                           // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingGameplayActor.K2_AddGameplayCue
struct ABuildingGameplayActor_K2_AddGameplayCue_Params
{
public:
	struct FGameplayTag                          GameplayCueTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle          Context;                                           // 0x8(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.BuildingGameplayActor.GetTargetingSourceTransform
struct ABuildingGameplayActor_GetTargetingSourceTransform_Params
{
public:
	enum class EFortAbilityTargetingSource       Source;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_109[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            ReturnValue;                                       // 0x10(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.EnableAbilityDeliveryInfo
struct ABuildingGameplayActor_EnableAbilityDeliveryInfo_Params
{
public:
	struct FGameplayTag                          BucketTag;                                         // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingGameplayActor.DisableAbilityDeliveryInfo
struct ABuildingGameplayActor_DisableAbilityDeliveryInfo_Params
{
public:
	struct FGameplayTag                          BucketTag;                                         // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.SetActivatedState
struct ABuildingCapturePointActor_SetActivatedState_Params
{
public:
	bool                                         bInActivated;                                      // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_ReplicatedCapturePercentage
struct ABuildingCapturePointActor_OnRep_ReplicatedCapturePercentage_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_CaptureState
struct ABuildingCapturePointActor_OnRep_CaptureState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_bLocked
struct ABuildingCapturePointActor_OnRep_bLocked_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnRep_bActivated
struct ABuildingCapturePointActor_OnRep_bActivated_Params
{
public:
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnLeaveCapturePoint
struct ABuildingCapturePointActor_OnLeaveCapturePoint_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_110[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnEnterCapturePoint
struct ABuildingCapturePointActor_OnEnterCapturePoint_Params
{
public:
	class UPrimitiveComponent*                   OverlappedComp;                                    // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OtherActor;                                        // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   OtherComp;                                         // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        OtherBodyIndex;                                    // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFromSweep;                                        // 0x1C(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_111[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            SweepResult;                                       // 0x20(0x88)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnCapturePointStateChange
struct ABuildingCapturePointActor_OnCapturePointStateChange_Params
{
public:
	enum class ECaptureState                     InState;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortTeam                         InTeam;                                            // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnCapturePointLockStateChange
struct ABuildingCapturePointActor_OnCapturePointLockStateChange_Params
{
public:
	bool                                         bInLocked;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.OnCapturePointActiveStateChange
struct ABuildingCapturePointActor_OnCapturePointActiveStateChange_Params
{
public:
	bool                                         bInActive;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingCapturePointActor.GetCaptureState
struct ABuildingCapturePointActor_GetCaptureState_Params
{
public:
	enum class ECaptureState                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortCarriedObjectHolderInterface.OnCarriedObjectDetach
struct UFortCarriedObjectHolderInterface_OnCarriedObjectDetach_Params
{
public:
	class AActor*                                DetachedObject;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortCarriedObjectHolderInterface.OnCarriedObjectAttach
struct UFortCarriedObjectHolderInterface_OnCarriedObjectAttach_Params
{
public:
	class AActor*                                AttachedObject;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortCarriedObjectHolderInterface.GetCarriedObjectAttachmentInfo
struct UFortCarriedObjectHolderInterface_GetCarriedObjectAttachmentInfo_Params
{
public:
	struct FCarriedObjectAttachmentInfo          OutAttachInfo;                                     // 0x0(0x28)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortCarriedObjectHolderInterface.GetAttachmentComponent
struct UFortCarriedObjectHolderInterface_GetAttachmentComponent_Params
{
public:
	class FName                                  SocketName;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       ReturnValue;                                       // 0x8(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortCarriedObjectHolderInterface.CanHoldObject
struct UFortCarriedObjectHolderInterface_CanHoldObject_Params
{
public:
	class AActor*                                CarriableObject;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_119[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.SpawnCarriedObject
struct ABuildingFlagSpawn_SpawnCarriedObject_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.OnCarriedObjectDetachedEvent
struct ABuildingFlagSpawn_OnCarriedObjectDetachedEvent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.OnCarriedObjectAttachedEvent
struct ABuildingFlagSpawn_OnCarriedObjectAttachedEvent_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFlagSpawn.IsSpawnedObjectAwayFromBase
struct ABuildingFlagSpawn_IsSpawnedObjectAwayFromBase_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemTypeFunctionLibrary.ToText
struct UFortItemTypeFunctionLibrary_ToText_Params
{
public:
	enum class EFortItemType                     ItemType;                                          // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UsePlural;                                         // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortTooltipInterface.GetTooltip
struct UFortTooltipInterface_GetTooltip_Params
{
public:
	TSubclassOf<class UFortTooltip>              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortTooltipInterface.GetDisplayStats
struct UFortTooltipInterface_GetDisplayStats_Params
{
public:
	class UFortTooltipDisplayStatsList*          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortTooltipContext.SpawnTooltipContextWithSource
struct UFortTooltipContext_SpawnTooltipContextWithSource_Params
{
public:
	class APlayerController*                     SourcePlayerController;                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltipContext.SpawnTooltipContextWithNetID
struct UFortTooltipContext_SpawnTooltipContextWithNetID_Params
{
public:
	class UObject*                               WorldContextObject;                                // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                      UniqueId;                                          // 0x8(0x18)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   ReturnValue;                                       // 0x20(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortTooltipContext.SpawnTooltipContext
struct UFortTooltipContext_SpawnTooltipContext_Params
{
public:
	class UFortTooltipContext*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltip.SetLocalizationText
struct UFortTooltip_SetLocalizationText_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Value;                                             // 0x10(0x18)(Parm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortTooltip.SetLocalizationInt
struct UFortTooltip_SetLocalizationInt_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_122[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortTooltip.SetLocalizationFloat
struct UFortTooltip_SetLocalizationFloat_Params
{
public:
	class FString                                Name;                                              // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Value;                                             // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_123[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortTooltip.GetValueData
struct UFortTooltip_GetValueData_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x10(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTooltipValueData                 OutData;                                           // 0x18(0x70)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x88(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_124[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortTooltip.GetTokenizedDescriptionText
struct UFortTooltip_GetTokenizedDescriptionText_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                          OutDescription;                                    // 0x18(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_125[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.FortTooltip.GetTextForToken
struct UFortTooltip_GetTextForToken_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  OutText;                                           // 0x20(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x38(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_126[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltip.GetNumericValue
struct UFortTooltip_GetNumericValue_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutVal;                                            // 0x20(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x24(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_127[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetValueData
struct UFortTooltip_BP_GetValueData_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x10(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTooltipValueData                 OutData;                                           // 0x18(0x70)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x88(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetTokenizedDescriptionText
struct UFortTooltip_BP_GetTokenizedDescriptionText_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                          OutDescription;                                    // 0x18(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_129[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetTextForToken
struct UFortTooltip_BP_GetTextForToken_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  OutText;                                           // 0x20(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x38(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortTooltip.BP_GetNumericValue
struct UFortTooltip_BP_GetNumericValue_Params
{
public:
	class UObject*                               ObjectToDescribe;                                  // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x8(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                   Context;                                           // 0x10(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Token;                                             // 0x18(0x8)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OutVal;                                            // 0x20(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x24(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12B[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.ShouldShowPreviewOnCurrentHero
struct UFortItemDefinition_ShouldShowPreviewOnCurrentHero_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.IsInventorySizeLimited
struct UFortItemDefinition_IsInventorySizeLimited_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.GetTooltip
struct UFortItemDefinition_GetTooltip_Params
{
public:
	TSubclassOf<class UFortTooltip>              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortItemDefinition.GetSmallPreviewImageBrush
struct UFortItemDefinition_GetSmallPreviewImageBrush_Params
{
public:
	struct FSlateBrush                           ReturnValue;                                       // 0x0(0x90)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemDefinition.GetSmallPreviewImage
struct UFortItemDefinition_GetSmallPreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x20)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.GetSingleLineDescription
struct UFortItemDefinition_GetSingleLineDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.GetShortDescription
struct UFortItemDefinition_GetShortDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItemDefinition.GetRarity
struct UFortItemDefinition_GetRarity_Params
{
public:
	enum class EFortRarity                       ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewStaticMeshAsset
struct UFortItemDefinition_GetPreviewStaticMeshAsset_Params
{
public:
	TSoftObjectPtr<class UStaticMesh>            Asset;                                             // 0x0(0x20)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12E[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewSkeletalMeshAsset
struct UFortItemDefinition_GetPreviewSkeletalMeshAsset_Params
{
public:
	TSoftObjectPtr<class USkeletalMesh>          Asset;                                             // 0x0(0x20)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12F[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewPrefabAsset
struct UFortItemDefinition_GetPreviewPrefabAsset_Params
{
public:
	TSoftClassPtr<class AActor>                  Asset;                                             // 0x0(0x20)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x20(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_130[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewMeshOffset
struct UFortItemDefinition_GetPreviewMeshOffset_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPreviewAssets
struct UFortItemDefinition_GetPreviewAssets_Params
{
public:
	TArray<TSoftObjectPtr<class UObject>>        Assets;                                            // 0x0(0x10)(Parm, OutParm, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetPersistentName
struct UFortItemDefinition_GetPersistentName_Params
{
public:
	class FString                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemDefinition.GetLargePreviewImage
struct UFortItemDefinition_GetLargePreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x20)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDisplayStats
struct UFortItemDefinition_GetDisplayStats_Params
{
public:
	class UFortTooltipDisplayStatsList*          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDisplayName
struct UFortItemDefinition_GetDisplayName_Params
{
public:
	bool                                         bBaseName;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_131[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.GetDescription
struct UFortItemDefinition_GetDescription_Params
{
public:
	TArray<class FText>                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.CustomizePreviewPrefab
struct UFortItemDefinition_CustomizePreviewPrefab_Params
{
public:
	class AActor*                                PrefabInstance;                                    // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItemDefinition.CustomizePreviewMesh
struct UFortItemDefinition_CustomizePreviewMesh_Params
{
public:
	class UMeshComponent*                        Mesh;                                              // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItemDefinition.CreateTemporaryItemInstanceBP
struct UFortItemDefinition_CreateTemporaryItemInstanceBP_Params
{
public:
	int32                                        Count;                                             // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x8(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItemDefinition.CreateTemporaryInstanceFromExistingItemBP
struct UFortItemDefinition_CreateTemporaryInstanceFromExistingItemBP_Params
{
public:
	class UFortItem*                             ExistingItem;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItem*                             ReturnValue;                                       // 0x10(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x390 (0x390 - 0x0)
// Function FortniteGame.FortItem.TryGetCategory
struct UFortItem_TryGetCategory_Params
{
public:
	enum class EFortItemCategoryOrdinal          Ordinal;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OutCategoryDisplayName;                            // 0x8(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         OutHasIcon;                                        // 0x20(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortMultiSizeBrush                   OutCategoryIconBrush;                              // 0x28(0x360)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x388(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.SetOwningControllerForTemporaryItem
struct UFortItem_SetOwningControllerForTemporaryItem_Params
{
public:
	class AFortPlayerController*                 InController;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsTemporaryItem
struct UFortItem_IsTemporaryItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsSlotted
struct UFortItem_IsSlotted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsSchematicOrCraftedWeapon
struct UFortItem_IsSchematicOrCraftedWeapon_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsSchematic
struct UFortItem_IsSchematic_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsInventoryOverflowItem
struct UFortItem_IsInventoryOverflowItem_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsInStorageVault
struct UFortItem_IsInStorageVault_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.IsEquipped
struct UFortItem_IsEquipped_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.IsEquipable
struct UFortItem_IsEquipable_Params
{
public:
	class AFortPlayerController*                 EquippingPC;                                       // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13D[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.IsAlterationSlotActive
struct UFortItem_IsAlterationSlotActive_Params
{
public:
	int32                                        SlotIndex;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x4(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13E[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortItem.IsActivatable
struct UFortItem_IsActivatable_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 FailureReason;                                     // 0x8(0x20)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13F[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.HasEvolutions
struct UFortItem_HasEvolutions_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.HasDurability
struct UFortItem_HasDurability_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetUpgradeRestrictionReasonText
struct UFortItem_GetUpgradeRestrictionReasonText_Params
{
public:
	enum class EItemUpgradeRestrictionReason     Reason;                                            // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_140[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetUpgradeResourceItemDefinition
struct UFortItem_GetUpgradeResourceItemDefinition_Params
{
public:
	class UFortPersistentResourceItemDefinition* ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetUpgradeCost
struct UFortItem_GetUpgradeCost_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetType
struct UFortItem_GetType_Params
{
public:
	enum class EFortItemType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetTier
struct UFortItem_GetTier_Params
{
public:
	enum class EFortItemTier                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// Function FortniteGame.FortItem.GetTertiaryCategory
struct UFortItem_GetTertiaryCategory_Params
{
public:
	class FText                                  ItemCategoryText;                                  // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                           ItemCategoryBrush;                                 // 0x18(0x90)(Parm, OutParm, NativeAccessSpecifierPublic)
	enum class EFortBrushSize                    BrushSize;                                         // 0xA8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xA9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_141[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetSmallPreviewImage
struct UFortItem_GetSmallPreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x20)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// Function FortniteGame.FortItem.GetSecondaryCategory
struct UFortItem_GetSecondaryCategory_Params
{
public:
	class FText                                  ItemCategoryText;                                  // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FSlateBrush                           ItemCategoryBrush;                                 // 0x18(0x90)(Parm, OutParm, NativeAccessSpecifierPublic)
	enum class EFortBrushSize                    BrushSize;                                         // 0xA8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xA9(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_142[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetSearchTags
struct UFortItem_GetSearchTags_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetSchematicResultType
struct UFortItem_GetSchematicResultType_Params
{
public:
	enum class EFortItemType                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetSchematicCraftingResultOrCraftedWeaponBP
struct UFortItem_GetSchematicCraftingResultOrCraftedWeaponBP_Params
{
public:
	class UFortWeaponItemDefinition*             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetSchematicCraftingResultBP
struct UFortItem_GetSchematicCraftingResultBP_Params
{
public:
	class UFortItemDefinition*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetRemainingAmmo
struct UFortItem_GetRemainingAmmo_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetRecycleValue
struct UFortItem_GetRecycleValue_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetRating
struct UFortItem_GetRating_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetRaritySecondaryColor
struct UFortItem_GetRaritySecondaryColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetRarityColor
struct UFortItem_GetRarityColor_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetRarity
struct UFortItem_GetRarity_Params
{
public:
	enum class EFortRarity                       ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetPrimaryCategory
struct UFortItem_GetPrimaryCategory_Params
{
public:
	class FText                                  ItemCategoryText;                                  // 0x0(0x18)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_143[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetPreviewAssets
struct UFortItem_GetPreviewAssets_Params
{
public:
	TArray<TSoftObjectPtr<class UObject>>        ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetOwningController
struct UFortItem_GetOwningController_Params
{
public:
	class AFortPlayerController*                 ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetNumInStack
struct UFortItem_GetNumInStack_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetNormalizedDurability
struct UFortItem_GetNormalizedDurability_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetMaxTier
struct UFortItem_GetMaxTier_Params
{
public:
	enum class EFortItemTier                     ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetMaxLevel
struct UFortItem_GetMaxLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetLoadedAmmo
struct UFortItem_GetLoadedAmmo_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetLevel
struct UFortItem_GetLevel_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetLargePreviewImage
struct UFortItem_GetLargePreviewImage_Params
{
public:
	TSoftObjectPtr<class UTexture2D>             ReturnValue;                                       // 0x0(0x20)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetItemGuid
struct UFortItem_GetItemGuid_Params
{
public:
	struct FGuid                                 ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortItem.GetItemDefinitionBP
struct UFortItem_GetItemDefinitionBP_Params
{
public:
	class UFortItemDefinition*                   ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.GetFilterCategory
struct UFortItem_GetFilterCategory_Params
{
public:
	enum class EFortInventoryFilter              ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetEvolveRestrictionReasonText
struct UFortItem_GetEvolveRestrictionReasonText_Params
{
public:
	enum class EItemEvolutionRestrictionReason   Reason;                                            // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_144[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortItem.GetDurability
struct UFortItem_GetDurability_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetDisplayName
struct UFortItem_GetDisplayName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.GetDescription
struct UFortItem_GetDescription_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetCoolDownTimeRemaining
struct UFortItem_GetCoolDownTimeRemaining_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownDuration;                                  // 0x8(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0xC(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortItem.GetAlterationSlotActivationRequirement
struct UFortItem_GetAlterationSlotActivationRequirement_Params
{
public:
	int32                                        SlotIndex;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_145[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortItem.GetAlterations
struct UFortItem_GetAlterations_Params
{
public:
	TArray<class UFortAlterationItemDefinition*> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.DoesMatchSearchString
struct UFortItem_DoesMatchSearchString_Params
{
public:
	class FString                                SearchString;                                      // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_146[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.CanEvolve
struct UFortItem_CanEvolve_Params
{
public:
	TArray<enum class EItemEvolutionRestrictionReason> OutRestrictionReasons;                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_147[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortItem.CanBeUpgraded
struct UFortItem_CanBeUpgraded_Params
{
public:
	TArray<enum class EItemUpgradeRestrictionReason> OutRestrictionReasons;                             // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x10(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_148[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.CanBeUnslotted
struct UFortItem_CanBeUnslotted_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortItem.CanBeDropped
struct UFortItem_CanBeDropped_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortPickupEffect.OnTossed
struct AFortPickupEffect_OnTossed_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortPickupEffect.OnPickedUp
struct AFortPickupEffect_OnPickedUp_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortPickupEffect.OnAttached
struct AFortPickupEffect_OnAttached_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortPickupEffect.OnAboutToEnterBackpack
struct AFortPickupEffect_OnAboutToEnterBackpack_Params
{
public:
	class AFortPawn*                             PickupTarget;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetMaxDurability
struct UFortWorldItemDefinition_GetMaxDurability_Params
{
public:
	int32                                        ItemLevel;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetFabricationValue
struct UFortWorldItemDefinition_GetFabricationValue_Params
{
public:
	bool                                         bUseDisintegrationOverride;                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetDPSAtLevel
struct UFortWorldItemDefinition_GetDPSAtLevel_Params
{
public:
	int32                                        ItemLevel;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.GetAmmoWorldItemDefinition_BP
struct UFortWorldItemDefinition_GetAmmoWorldItemDefinition_BP_Params
{
public:
	class UFortWorldItemDefinition*              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortWorldItemDefinition.CanBeDisassembled
struct UFortWorldItemDefinition_CanBeDisassembled_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuickBars.ServerSwapItemsInternal
struct AFortQuickBars_ServerSwapItemsInternal_Params
{
public:
	enum class EFortQuickBars                    QuickBarA;                                         // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_158[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndexA;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    QuickBarB;                                         // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_159[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndexB;                                        // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function FortniteGame.FortQuickBars.ServerRemoveItemInternal
struct AFortQuickBars_ServerRemoveItemInternal_Params
{
public:
	struct FGuid                                 Item;                                              // 0x0(0x10)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFindReplacement;                                  // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForce;                                            // 0x11(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15A[0x2];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortQuickBars.ServerAddItemInternal
struct AFortQuickBars_ServerAddItemInternal_Params
{
public:
	struct FGuid                                 Item;                                              // 0x0(0x10)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFortQuickBars                    InQuickBar;                                        // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Slot;                                              // 0x14(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortQuickBars.ServerActivateSlotInternal
struct AFortQuickBars_ServerActivateSlotInternal_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Slot;                                              // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivateDelay;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUpdatePreviousFocusedSlot;                        // 0xC(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15D[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortQuickBars.OnRep_SecondaryQuickBar
struct AFortQuickBars_OnRep_SecondaryQuickBar_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortQuickBars.OnRep_PrimaryQuickBar
struct AFortQuickBars_OnRep_PrimaryQuickBar_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuickBars.EnableSlot
struct AFortQuickBars_EnableSlot_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndex;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuickBars.EmptySlot
struct AFortQuickBars_EmptySlot_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_15F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndex;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortQuickBars.Empty
struct AFortQuickBars_Empty_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortQuickBars.DisableSlot
struct AFortQuickBars_DisableSlot_Params
{
public:
	enum class EFortQuickBars                    InQuickBar;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_160[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SlotIndex;                                         // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.BuildingFOBCoreSpawnPad.GetCoreSpawnTransform
struct ABuildingFOBCoreSpawnPad_GetCoreSpawnTransform_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.ReloadFOB
struct ABuildingFOBConfigActor_ReloadFOB_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnRep_FOBMode
struct ABuildingFOBConfigActor_OnRep_FOBMode_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnRep_bFinalized
struct ABuildingFOBConfigActor_OnRep_bFinalized_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnIOOperationCompleteMulticast
struct ABuildingFOBConfigActor_OnIOOperationCompleteMulticast_Params
{
public:
	enum class EFOBIOStatus                      IOOperation;                                       // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuccess;                                          // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_169[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortFOBCoreDecoItemDefinition*        SelectedCoreDef;                                   // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFOBModeSet
struct ABuildingFOBConfigActor_OnFOBModeSet_Params
{
public:
	enum class EFOBMode                          ModeThatWasSet;                                    // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFinalized
struct ABuildingFOBConfigActor_OnFinalized_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFinalizationPlayFX
struct ABuildingFOBConfigActor_OnFinalizationPlayFX_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnFinalizationFXMulticast
struct ABuildingFOBConfigActor_OnFinalizationFXMulticast_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.OnCoreInitialized
struct ABuildingFOBConfigActor_OnCoreInitialized_Params
{
public:
	class ABuildingFOBCoreActor*                 InitializedCore;                                   // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsPlayerControllerFOBOwner
struct ABuildingFOBConfigActor_IsPlayerControllerFOBOwner_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16A[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsInitialized
struct ABuildingFOBConfigActor_IsInitialized_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsFinalized
struct ABuildingFOBConfigActor_IsFinalized_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.IsBuildingActorWithinFOB
struct ABuildingFOBConfigActor_IsBuildingActorWithinFOB_Params
{
public:
	class ABuildingActor*                        ActorToCheck;                                      // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16B[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.GetSelectedFOBCoreItemDefinition
struct ABuildingFOBConfigActor_GetSelectedFOBCoreItemDefinition_Params
{
public:
	class UFortFOBCoreDecoItemDefinition*        ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.GetFOBMode
struct ABuildingFOBConfigActor_GetFOBMode_Params
{
public:
	enum class EFOBMode                          ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.GetAllCoreChoices
struct ABuildingFOBConfigActor_GetAllCoreChoices_Params
{
public:
	TArray<struct FFOBCoreChoice>                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.CanSaveFOB
struct ABuildingFOBConfigActor_CanSaveFOB_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.CanReloadFOB
struct ABuildingFOBConfigActor_CanReloadFOB_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.CanPerformIOOperation
struct ABuildingFOBConfigActor_CanPerformIOOperation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBConfigActor.AttemptSelectFOBCore
struct ABuildingFOBConfigActor_AttemptSelectFOBCore_Params
{
public:
	class UFortFOBCoreDecoItemDefinition*        DefToSelect;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_16C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnVulnerableStatusChanged
struct ABuildingFOBCoreActor_OnVulnerableStatusChanged_Params
{
public:
	bool                                         bNewTargetableStatus;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnTargetableStatusChanged
struct ABuildingFOBCoreActor_OnTargetableStatusChanged_Params
{
public:
	bool                                         bNewTargetableStatus;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnRep_bVulnerable
struct ABuildingFOBCoreActor_OnRep_bVulnerable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnRep_bTargetable
struct ABuildingFOBCoreActor_OnRep_bTargetable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnRep_bActive
struct ABuildingFOBCoreActor_OnRep_bActive_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.OnActiveStatusChanged
struct ABuildingFOBCoreActor_OnActiveStatusChanged_Params
{
public:
	bool                                         bNewActiveStatus;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.MarkVulnerable
struct ABuildingFOBCoreActor_MarkVulnerable_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.MarkTargetable
struct ABuildingFOBCoreActor_MarkTargetable_Params
{
public:
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.IsActorWithinFOBBounds
struct ABuildingFOBCoreActor_IsActorWithinFOBBounds_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_171[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.IsActive
struct ABuildingFOBCoreActor_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.GetSimpleDeathFXTransform
struct ABuildingFOBCoreActor_GetSimpleDeathFXTransform_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x1C (0x1C - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.GetFOBBoundsCenterAndExtents
struct ABuildingFOBCoreActor_GetFOBBoundsCenterAndExtents_Params
{
public:
	struct FVector                               OutCenter;                                         // 0x0(0xC)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               OutExtents;                                        // 0xC(0xC)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_172[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingFOBCoreActor.GetFOBBoundsBoxOverlappedActors
struct ABuildingFOBCoreActor_GetFOBBoundsBoxOverlappedActors_Params
{
public:
	TArray<class ABuildingSMActor*>              OverlappedActors;                                  // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bSortByDistanceFromCore;                           // 0x10(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.UpdateTeamDepositValues
struct ABuildingItemCollectorActor_UpdateTeamDepositValues_Params
{
public:
	TArray<int32>                                DepositAmounts;                                    // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<int32>                                DepositGoals;                                      // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.SetItemCollectorState
struct ABuildingItemCollectorActor_SetItemCollectorState_Params
{
public:
	enum class EFortItemCollectorState           InItemCollectorState;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.OnTeamReachedDepositGoal
struct ABuildingItemCollectorActor_OnTeamReachedDepositGoal_Params
{
public:
	enum class EFortTeam                         InControllingTeam;                                 // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.OnRep_TeamDepositGoals
struct ABuildingItemCollectorActor_OnRep_TeamDepositGoals_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.OnRep_TeamDepositAmounts
struct ABuildingItemCollectorActor_OnRep_TeamDepositAmounts_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.OnRep_ItemCollectorState
struct ABuildingItemCollectorActor_OnRep_ItemCollectorState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.OnRep_ControllingTeam
struct ABuildingItemCollectorActor_OnRep_ControllingTeam_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.OnItemCollectorStateChanged
struct ABuildingItemCollectorActor_OnItemCollectorStateChanged_Params
{
public:
	enum class EFortItemCollectorState           InItemCollectorState;                              // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.GetTeamReachedGoalCount
struct ABuildingItemCollectorActor_GetTeamReachedGoalCount_Params
{
public:
	enum class EFortTeam                         InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_176[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.GetTeamDepositGoal
struct ABuildingItemCollectorActor_GetTeamDepositGoal_Params
{
public:
	enum class EFortTeam                         InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.GetTeamDepositAmount
struct ABuildingItemCollectorActor_GetTeamDepositAmount_Params
{
public:
	enum class EFortTeam                         InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_178[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingItemCollectorActor.GetNumberOfTeamCaptures
struct ABuildingItemCollectorActor_GetNumberOfTeamCaptures_Params
{
public:
	enum class EFortTeam                         InTeam;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_179[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.DeployableBaseCore.GetSimpleDeathFXTransform
struct ADeployableBaseCore_GetSimpleDeathFXTransform_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortInventory.HandleInventoryLocalUpdate
struct AFortInventory_HandleInventoryLocalUpdate_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.DeployableBasePlot.OnRep_OccupantNetID
struct ADeployableBasePlot_OnRep_OccupantNetID_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.DeployableBasePlot.OnRep_CurrentBuildingState
struct ADeployableBasePlot_OnRep_CurrentBuildingState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.DeployableBasePlot.OnRep_BuildableSpaceExpansionVector
struct ADeployableBasePlot_OnRep_BuildableSpaceExpansionVector_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.DeployableBasePlot.OnCurrentBuildingStateSet
struct ADeployableBasePlot_OnCurrentBuildingStateSet_Params
{
public:
	enum class EDeployableBaseBuildingState      InCurrentBuildingState;                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.DeployableBasePlot.OnBuildingStateTransition
struct ADeployableBasePlot_OnBuildingStateTransition_Params
{
public:
	enum class EDeployableBaseBuildingState      InPreviousState;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDeployableBaseBuildingState      InCurrentState;                                    // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.DeployableBasePlot.IsOccupied
struct ADeployableBasePlot_IsOccupied_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.DeployableBasePlot.IsOccupant
struct ADeployableBasePlot_IsOccupant_Params
{
public:
	struct FUniqueNetIdRepl                      UserId;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x18(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_182[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.DeployableBasePlot.IsBuildingActorWithinBuildableSpace
struct ADeployableBasePlot_IsBuildingActorWithinBuildableSpace_Params
{
public:
	class ABuildingActor*                        ActorToCheck;                                      // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               GridLocation;                                      // 0x8(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x14(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_183[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2 (0x2 - 0x0)
// Function FortniteGame.DeployableBasePlot.HandleBuildingStateTransition
struct ADeployableBasePlot_HandleBuildingStateTransition_Params
{
public:
	enum class EDeployableBaseBuildingState      InPreviousState;                                   // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDeployableBaseBuildingState      InCurrentState;                                    // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.DeployableBasePlot.GetPlayerStart
struct ADeployableBasePlot_GetPlayerStart_Params
{
public:
	class AFortPlayerStart*                      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.DeployableBasePlot.GetOccupantNetID
struct ADeployableBasePlot_GetOccupantNetID_Params
{
public:
	struct FUniqueNetIdRepl                      ReturnValue;                                       // 0x0(0x18)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.DeployableBasePlot.GetNumOfItemsInPlot
struct ADeployableBasePlot_GetNumOfItemsInPlot_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// Function FortniteGame.FortAthenaSupplyDrop.GroundTrace
struct AFortAthenaSupplyDrop_GroundTrace_Params
{
public:
	struct FVector                               TraceStart;                                        // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TraceEnd;                                          // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            OutHit;                                            // 0x18(0x88)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0xA0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.SBAGrantedBuildingGameplayActor.GetOwnerStrategicBuildingActor
struct ASBAGrantedBuildingGameplayActor_GetOwnerStrategicBuildingActor_Params
{
public:
	class AStrategicBuildingActor*               ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortIndicator.OnParentActorEndPlay
struct UFortIndicator_OnParentActorEndPlay_Params
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EEndPlayReason                    EndPlayReason;                                     // 0x8(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18F[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortGameplayAbility.SetupPreviewImageOverride
struct UFortGameplayAbility_SetupPreviewImageOverride_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortGameplayAbility.SetAIFocalPoint
struct UFortGameplayAbility_SetAIFocalPoint_Params
{
public:
	class AActor*                                FocusTarget;                                       // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               FocalPoint;                                        // 0x8(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseAttackingPriority;                             // 0x14(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// Function FortniteGame.FortGameplayAbility.QueryGameplayEffectContainerTargetExecutionModifiers
struct UFortGameplayAbility_QueryGameplayEffectContainerTargetExecutionModifiers_Params
{
public:
	struct FGameplayAbilityTargetDataHandle      TargetData;                                        // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	class UFortAbilitySystemComponent*           SrcAbilitySystem;                                  // 0x20(0x8)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ApplicationTag;                                    // 0x28(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GameplayEffectLevel;                               // 0x30(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_194[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               SourceObject;                                      // 0x38(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayEffectExecutionScopedModifierInfo> InScopedMods;                                      // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FActiveGameplayEffectHandle>   InIgnoreHandles;                                   // 0x50(0x10)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayModifierEvaluatedData> OutOutputModifiers;                                // 0x60(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortGameplayAbility.OnAbilityInputReleased
struct UFortGameplayAbility_OnAbilityInputReleased_Params
{
public:
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortGameplayAbility.MakeGameplayEffectContainerSpec
struct UFortGameplayAbility_MakeGameplayEffectContainerSpec_Params
{
public:
	struct FGameplayTag                          ApplicationTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GameplayEffectLevel;                               // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_195[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortGameplayEffectContainerSpec      ReturnValue;                                       // 0x10(0x80)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.K2_TriggerFromAnimation
struct UFortGameplayAbility_K2_TriggerFromAnimation_Params
{
public:
	struct FGameplayTag                          ApplicationTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// Function FortniteGame.FortGameplayAbility.K2_ShouldUseDecoTool
struct UFortGameplayAbility_K2_ShouldUseDecoTool_Params
{
public:
	struct FGameplayAbilityActorInfo             ActorInfo;                                         // 0x0(0x40)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x40(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_196[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortGameplayAbility.K2_AbilityCompleted
struct UFortGameplayAbility_K2_AbilityCompleted_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortGameplayAbility.IsTargetOutsideOfMaxYawRotation
struct UFortGameplayAbility_IsTargetOutsideOfMaxYawRotation_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetTooltip
struct UFortGameplayAbility_GetTooltip_Params
{
public:
	TSubclassOf<class UFortTooltip>              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetProjectileInitialValues
struct UFortGameplayAbility_GetProjectileInitialValues_Params
{
public:
	float                                        OutProjectileSpeed;                                // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              OutSpawnDirection;                                 // 0x4(0xC)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        OutProjectileGravity;                              // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_197[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                HomingTarget;                                      // 0x18(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyInaccuracy;                                  // 0x20(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyClampedMaxYawAngleToFire;                    // 0x21(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyLeading;                                     // 0x22(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_198[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetFireRotation
struct UFortGameplayAbility_GetFireRotation_Params
{
public:
	bool                                         bApplyLeading;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyInaccuracy;                                  // 0x1(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyClampedMaxYawAngleToFire;                    // 0x2(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_199[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              ReturnValue;                                       // 0x4(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.FortGameplayAbility.GetFireLocation
struct UFortGameplayAbility_GetFireLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetDisplayStats
struct UFortGameplayAbility_GetDisplayStats_Params
{
public:
	class UFortTooltipDisplayStatsList*          ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetCustomAbilitySourceTransform
struct UFortGameplayAbility_GetCustomAbilitySourceTransform_Params
{
public:
	struct FTransform                            ReturnValue;                                       // 0x0(0x30)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetCurrentSourceWeapon
struct UFortGameplayAbility_GetCurrentSourceWeapon_Params
{
public:
	class AFortWeapon*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetCurrentSourceItemDefinition
struct UFortGameplayAbility_GetCurrentSourceItemDefinition_Params
{
public:
	class UFortWorldItemDefinition*              ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetCurrentAbilitySourceLevel
struct UFortGameplayAbility_GetCurrentAbilitySourceLevel_Params
{
public:
	float                                        OutSourceLevel;                                    // 0x0(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetAimLocationNearestPawn
struct UFortGameplayAbility_GetAimLocationNearestPawn_Params
{
public:
	class AFortPawn*                             Instigator;                                        // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ReturnValue;                                       // 0x8(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19A[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetAIAbilityTarget
struct UFortGameplayAbility_GetAIAbilityTarget_Params
{
public:
	class AActor*                                ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetActivatingPawn
struct UFortGameplayAbility_GetActivatingPawn_Params
{
public:
	class AFortPawn*                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortGameplayAbility.GetActivatingAbilityComponent
struct UFortGameplayAbility_GetActivatingAbilityComponent_Params
{
public:
	class UFortAbilitySystemComponent*           ReturnValue;                                       // 0x0(0x8)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortGameplayAbility.EquipAbilityWeapon
struct UFortGameplayAbility_EquipAbilityWeapon_Params
{
public:
	class UFortWeaponItemDefinition*             WeaponDefinition;                                  // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemLevel;                                         // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19B[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.FortGameplayAbility.DoesTargetHaveTags
struct UFortGameplayAbility_DoesTargetHaveTags_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 Tags;                                              // 0x8(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x28(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortGameplayAbility.DoesTargetHaveProhibitedTagsForAI
struct UFortGameplayAbility_DoesTargetHaveProhibitedTagsForAI_Params
{
public:
	class AActor*                                Target;                                            // 0x0(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19D[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortGameplayAbility.ClearAIFocalPoint
struct UFortGameplayAbility_ClearAIFocalPoint_Params
{
public:
	bool                                         bUseAttackingPriority;                             // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// Function FortniteGame.FortGameplayAbility.CalculateProjectileTrajectorySpline
struct UFortGameplayAbility_CalculateProjectileTrajectorySpline_Params
{
public:
	TArray<struct FVector>                       OutSplinePoints;                                   // 0x0(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                       OutSplineTangents;                                 // 0x10(0x10)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                Instigator;                                        // 0x20(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               InitialLocation;                                   // 0x28(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               InitialVelocity;                                   // 0x34(0xC)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Gravity;                                           // 0x40(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Friction;                                          // 0x44(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Bounciness;                                        // 0x48(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeStep;                                          // 0x4C(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TraceExtent;                                       // 0x50(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19E[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x90 (0x90 - 0x0)
// Function FortniteGame.FortGameplayAbility.BP_GetGameplayEffectContainer
struct UFortGameplayAbility_BP_GetGameplayEffectContainer_Params
{
public:
	struct FGameplayTag                          ApplicationTag;                                    // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortGameplayEffectContainer          ReturnValue;                                       // 0x8(0x88)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// Function FortniteGame.FortGameplayAbility.ApplyGameplayEffectContainer
struct UFortGameplayAbility_ApplyGameplayEffectContainer_Params
{
public:
	struct FGameplayAbilityTargetDataHandle      TargetData;                                        // 0x0(0x20)(Parm, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ApplicationTag;                                    // 0x20(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GameplayEffectLevel;                               // 0x28(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FActiveGameplayEffectHandle>   ReturnValue;                                       // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// Function FortniteGame.FortGameplayAbility.ApplyAccuracyToTargetLocation
struct UFortGameplayAbility_ApplyAccuracyToTargetLocation_Params
{
public:
	struct FVector                               SourceLocation;                                    // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation;                                    // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InDesiredThrowAngle;                               // 0x18(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ReturnValue;                                       // 0x1C(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.StrategicBuildingActor.SetupVisibilityComponent
struct AStrategicBuildingActor_SetupVisibilityComponent_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.StrategicBuildingActor.SetupIndicators
struct AStrategicBuildingActor_SetupIndicators_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.StrategicBuildingActor.ProcessDeferredTouchActors
struct AStrategicBuildingActor_ProcessDeferredTouchActors_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.StrategicBuildingActor.OnRep_ConstructionProgress
struct AStrategicBuildingActor_OnRep_ConstructionProgress_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.StrategicBuildingActor.OnRep_bIsActive
struct AStrategicBuildingActor_OnRep_bIsActive_Params
{
public:
};

// 0xC (0xC - 0x0)
// Function FortniteGame.StrategicBuildingActor.OnConstructionTickPlayEffects
struct AStrategicBuildingActor_OnConstructionTickPlayEffects_Params
{
public:
	float                                        DeltaTime;                                         // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ElapsedPct;                                        // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConstructionLvl;                                   // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// Function FortniteGame.StrategicBuildingActor.OnConstructionStartedPlayEffects
struct AStrategicBuildingActor_OnConstructionStartedPlayEffects_Params
{
public:
	float                                        ServerStartTime;                                   // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ServerEndTime;                                     // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentServerTime;                                 // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ElapsedPct;                                        // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConstructionLvl;                                   // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.StrategicBuildingActor.OnConstructionEndedPlayEffects
struct AStrategicBuildingActor_OnConstructionEndedPlayEffects_Params
{
public:
	int32                                        ConstructionLevel;                                 // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.StrategicBuildingActor.OnActiveStatusChanged
struct AStrategicBuildingActor_OnActiveStatusChanged_Params
{
public:
	bool                                         bNewActiveStatus;                                  // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.StrategicBuildingActor.IsActive
struct AStrategicBuildingActor_IsActive_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.StrategicBuildingActor.GiveItemFromStrategicBuildingToPlayer
struct AStrategicBuildingActor_GiveItemFromStrategicBuildingToPlayer_Params
{
public:
	class AFortPlayerController*                 PlayerController;                                  // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortWorldItemDefinition*              ItemDefinition;                                    // 0x8(0x8)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberToGive;                                      // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B0[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.StrategicBuildingActor.GetMaxLevelUnlockProgress
struct AStrategicBuildingActor_GetMaxLevelUnlockProgress_Params
{
public:
	int32                                        InLevel;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.StrategicBuildingActor.GetDeathEffectsScale
struct AStrategicBuildingActor_GetDeathEffectsScale_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.StrategicBuildingActor.GetDeathEffectsRotation
struct AStrategicBuildingActor_GetDeathEffectsRotation_Params
{
public:
	struct FRotator                              ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.StrategicBuildingActor.GetDeathEffectsLocation
struct AStrategicBuildingActor_GetDeathEffectsLocation_Params
{
public:
	struct FVector                               ReturnValue;                                       // 0x0(0xC)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.StrategicBuildingActor.GetCurrentLevelUnlockProgress
struct AStrategicBuildingActor_GetCurrentLevelUnlockProgress_Params
{
public:
	int32                                        InLevel;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReturnValue;                                       // 0x4(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// Function FortniteGame.StrategicBuildingActor.AttemptIncrementLevelUnlockProgress
struct AStrategicBuildingActor_AttemptIncrementLevelUnlockProgress_Params
{
public:
	int32                                        InLevel;                                           // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InProgressDelta;                                   // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ReturnValue;                                       // 0x8(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B1[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.StrategicBuildingActor.ApplyProximityPulseEffects
struct AStrategicBuildingActor_ApplyProximityPulseEffects_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortPvPBaseCornerstone.SetInvincibility
struct AFortPvPBaseCornerstone_SetInvincibility_Params
{
public:
	bool                                         bInInvincible;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.FortPvPBaseCornerstone.OnRep_bInvincible
struct AFortPvPBaseCornerstone_OnRep_bInvincible_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortPvPBaseCornerstone.OnInvincibilityChanged
struct AFortPvPBaseCornerstone_OnInvincibilityChanged_Params
{
public:
	bool                                         bIsInvincible;                                     // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingRift.OnStartedEncounterSpawn
struct ABuildingRift_OnStartedEncounterSpawn_Params
{
public:
	class AFortAIPawn*                           SpawnedAI;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnSpawnAI
struct ABuildingRift_OnSpawnAI_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRep_RiftIsVisible
struct ABuildingRift_OnRep_RiftIsVisible_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRep_RiftIsActive
struct ABuildingRift_OnRep_RiftIsActive_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnRemoved
struct ABuildingRift_OnRemoved_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnPlaced
struct ABuildingRift_OnPlaced_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingRift.OnFinishedEncounterSpawn
struct ABuildingRift_OnFinishedEncounterSpawn_Params
{
public:
	class AFortAIPawn*                           SpawnedAI;                                         // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnDeactivated
struct ABuildingRift_OnDeactivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.OnActivated
struct ABuildingRift_OnActivated_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingRift.BroadcastRiftSpawningAI
struct ABuildingRift_BroadcastRiftSpawningAI_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.RaiseTreasure
struct ABuildingContainer_RaiseTreasure_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnSetSearched
struct ABuildingContainer_OnSetSearched_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnSearchInterrupted
struct ABuildingContainer_OnSearchInterrupted_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnRep_bAlreadySearched
struct ABuildingContainer_OnRep_bAlreadySearched_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnRaiseTreasure
struct ABuildingContainer_OnRaiseTreasure_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnLootReset
struct ABuildingContainer_OnLootReset_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnLootRepeat
struct ABuildingContainer_OnLootRepeat_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnLoot
struct ABuildingContainer_OnLoot_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.OnBeginSearch
struct ABuildingContainer_OnBeginSearch_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingContainer.GetLootTier
struct ABuildingContainer_GetLootTier_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingContainer.BounceContainer
struct ABuildingContainer_BounceContainer_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.KeepItemContainer.RestoreLoot
struct AKeepItemContainer_RestoreLoot_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.KeepItemContainer.ResetContainer
struct AKeepItemContainer_ResetContainer_Params
{
public:
	class AFortPlayerController*                 FortPC;                                            // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.KeepItemContainer.OnRep_SearchedBy
struct AKeepItemContainer_OnRep_SearchedBy_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.KeepItemContainer.OnRep_HostUpgradeLevel
struct AKeepItemContainer_OnRep_HostUpgradeLevel_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.KeepItemContainer.InitializeContainer
struct AKeepItemContainer_InitializeContainer_Params
{
public:
	int32                                        InitUpgradeLevel;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.KeepItemContainer.GetLootTierOverride
struct AKeepItemContainer_GetLootTierOverride_Params
{
public:
	int32                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.KeepItemContainer.GetContainerNameAndLevelKey
struct AKeepItemContainer_GetContainerNameAndLevelKey_Params
{
public:
	class FName                                  ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingPropAtlas.StopRingSpinning
struct ABuildingPropAtlas_StopRingSpinning_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingPropAtlas.SetupAnimationTransition
struct ABuildingPropAtlas_SetupAnimationTransition_Params
{
public:
	class UMaterialInstanceDynamic*              Mid;                                               // 0x0(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ParamName;                                         // 0x8(0x8)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InTransitionTime;                                  // 0x10(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CF[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingPropAtlas.SetupAnimationSpeed
struct ABuildingPropAtlas_SetupAnimationSpeed_Params
{
public:
	float                                        InActivationTime;                                  // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InTotalDefenseTime;                                // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InAnimSpeedStart;                                  // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InAnimSpeedEnd;                                    // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingPropAtlas.RestoreRingsHierarchy
struct ABuildingPropAtlas_RestoreRingsHierarchy_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingPropAtlas.PlayRingsReset
struct ABuildingPropAtlas_PlayRingsReset_Params
{
public:
	float                                        AnimDuration;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// Function FortniteGame.BuildingPropAtlas.PlayRingSpinning
struct ABuildingPropAtlas_PlayRingSpinning_Params
{
public:
	struct FRotator                              Ring1RateMin;                                      // 0x0(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                              Ring1RateMax;                                      // 0xC(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                              Ring2Rate;                                         // 0x18(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                              Ring3Rate;                                         // 0x24(0xC)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingPropAtlas.PlayRingsIdleLoop
struct ABuildingPropAtlas_PlayRingsIdleLoop_Params
{
public:
	float                                        AnimDuration;                                      // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Ring1ZOffset;                                      // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.BuildingPropAtlas.PlayRingDamage
struct ABuildingPropAtlas_PlayRingDamage_Params
{
public:
	float                                        DurationMin;                                       // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DurationMax;                                       // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MagnitudeMin;                                      // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MagnitudeMax;                                      // 0xC(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x0 - 0x0)
// Function FortniteGame.BuildingPropAtlas.OnRingSpinningLoop
struct ABuildingPropAtlas_OnRingSpinningLoop_Params
{
public:
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.BuildingPropAtlas.InitializeRings
struct ABuildingPropAtlas_InitializeRings_Params
{
public:
	class UPrimitiveComponent*                   InRing1Comp;                                       // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   InRing2Comp;                                       // 0x8(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                   InRing3Comp;                                       // 0x10(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.BuildingPropAtlas.InitializeAudio
struct ABuildingPropAtlas_InitializeAudio_Params
{
public:
	class UAudioComponent*                       InPortalLoopingComp;                               // 0x0(0x8)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingPropAtlas.GetDefenseProgress
struct ABuildingPropAtlas_GetDefenseProgress_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.BuildingPropAtlas.GetDefenseAnimSpeed
struct ABuildingPropAtlas_GetDefenseAnimSpeed_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortAccountItemDefinition.GetRecyclingRefunds
struct UFortAccountItemDefinition_GetRecyclingRefunds_Params
{
public:
	TArray<struct FFortItemQuantityPair>         ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x908 (0x908 - 0x0)
// Function FortniteGame.FortAlterationFunctionLibrary.GetAlterationImpactPhysicalSurfaceEffects
struct UFortAlterationFunctionLibrary_GetAlterationImpactPhysicalSurfaceEffects_Params
{
public:
	enum class EPhysicalSurface                  HitSurface;                                        // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFortCosmeticModification             CosmeticMod;                                       // 0x8(0x8F8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UParticleSystem*                       ReturnValue;                                       // 0x900(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.ShouldAllowTargetingDuringReload
struct UFortWeaponItemDefinition_ShouldAllowTargetingDuringReload_Params
{
public:
	bool                                         ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetWeaponStatHandle
struct UFortWeaponItemDefinition_GetWeaponStatHandle_Params
{
public:
	struct FDataTableRowHandle                   ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetWeaponMeshOverride
struct UFortWeaponItemDefinition_GetWeaponMeshOverride_Params
{
public:
	class USkeletalMesh*                         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetWeaponActorClass
struct UFortWeaponItemDefinition_GetWeaponActorClass_Params
{
public:
	TSubclassOf<class AFortWeapon>               ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetTriggerType
struct UFortWeaponItemDefinition_GetTriggerType_Params
{
public:
	enum class EFortWeaponTriggerType            ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetShortDisplayName
struct UFortWeaponItemDefinition_GetShortDisplayName_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetSecondaryFireAbility
struct UFortWeaponItemDefinition_GetSecondaryFireAbility_Params
{
public:
	TSubclassOf<class UFortGameplayAbility>      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetReticleImage
struct UFortWeaponItemDefinition_GetReticleImage_Params
{
public:
	class UTexture2D*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetReticleCornerAngles
struct UFortWeaponItemDefinition_GetReticleCornerAngles_Params
{
public:
	TArray<float>                                ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetReticleCenterImageOffset
struct UFortWeaponItemDefinition_GetReticleCenterImageOffset_Params
{
public:
	struct FVector2D                             ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetReticleCenterImage
struct UFortWeaponItemDefinition_GetReticleCenterImage_Params
{
public:
	class UTexture2D*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetReloadAbility
struct UFortWeaponItemDefinition_GetReloadAbility_Params
{
public:
	TSubclassOf<class UFortGameplayAbility>      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetPrimaryFireAbility
struct UFortWeaponItemDefinition_GetPrimaryFireAbility_Params
{
public:
	TSubclassOf<class UFortGameplayAbility>      ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetMuzzleBlockedImage
struct UFortWeaponItemDefinition_GetMuzzleBlockedImage_Params
{
public:
	class UTexture2D*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetLowAmmoPercentage
struct UFortWeaponItemDefinition_GetLowAmmoPercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetHitNotifyOpacityCurve
struct UFortWeaponItemDefinition_GetHitNotifyOpacityCurve_Params
{
public:
	class UCurveFloat*                           ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetHitNotifyImage
struct UFortWeaponItemDefinition_GetHitNotifyImage_Params
{
public:
	class UTexture2D*                            ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetHitNotifyDuration
struct UFortWeaponItemDefinition_GetHitNotifyDuration_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetEquippedAbilities
struct UFortWeaponItemDefinition_GetEquippedAbilities_Params
{
public:
	TArray<TSubclassOf<class UFortGameplayAbility>> ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetDisplayTierAsText
struct UFortWeaponItemDefinition_GetDisplayTierAsText_Params
{
public:
	enum class EFortDisplayTier                  DisplayTier;                                       // 0x0(0x1)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D6[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ReturnValue;                                       // 0x8(0x18)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetDisplayTier
struct UFortWeaponItemDefinition_GetDisplayTier_Params
{
public:
	enum class EFortDisplayTier                  ReturnValue;                                       // 0x0(0x1)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetDegradedPercentage
struct UFortWeaponItemDefinition_GetDegradedPercentage_Params
{
public:
	float                                        ReturnValue;                                       // 0x0(0x4)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetBaseCosmeticAlteration
struct UFortWeaponItemDefinition_GetBaseCosmeticAlteration_Params
{
public:
	class UFortAlterationItemDefinition*         ReturnValue;                                       // 0x0(0x8)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// Function FortniteGame.FortWeaponItemDefinition.GetBaseAlteration
struct UFortWeaponItemDefinition_GetBaseAlteration_Params
{
public:
