#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.UserConstructionScript
struct AFort_Entry_Music_Controller_BP_C_UserConstructionScript_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Login_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Login_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Store_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Store_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Lobby_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Lobby_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_WorldOverview_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_WorldOverview_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_HomeBase_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_HomeBase_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Hexmap_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Hexmap_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Heroes_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Heroes_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Vault_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Vault_FadeIn_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Store_CardIntro_Fadein
struct AFort_Entry_Music_Controller_BP_C_Music_Store_CardIntro_Fadein_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Store_Transition_To_Purchase
struct AFort_Entry_Music_Controller_BP_C_Store_Transition_To_Purchase_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Store_Llama_HangingOut
struct AFort_Entry_Music_Controller_BP_C_Store_Llama_HangingOut_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Store_CardpackSummaryOpenAndLoop
struct AFort_Entry_Music_Controller_BP_C_Store_CardpackSummaryOpenAndLoop_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Store_HitLlamaAndLoop
struct AFort_Entry_Music_Controller_BP_C_Store_HitLlamaAndLoop_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Store_Intro_Loop
struct AFort_Entry_Music_Controller_BP_C_Store_Intro_Loop_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.VBucks_Menu_Enter
struct AFort_Entry_Music_Controller_BP_C_VBucks_Menu_Enter_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.ReceiveBeginPlay
struct AFort_Entry_Music_Controller_BP_C_ReceiveBeginPlay_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.On Sub Game Changed
struct AFort_Entry_Music_Controller_BP_C_On_Sub_Game_Changed_Params
{
public:
	enum class ESubGame                          SubGame;                                           // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.Music_Lobby_Athena_FadeIn
struct AFort_Entry_Music_Controller_BP_C_Music_Lobby_Athena_FadeIn_Params
{
public:
};

// 0x24 (0x24 - 0x0)
// Function Fort_Entry_Music_Controller_BP.Fort_Entry_Music_Controller_BP_C.ExecuteUbergraph_Fort_Entry_Music_Controller_BP
struct AFort_Entry_Music_Controller_BP_C_ExecuteUbergraph_Fort_Entry_Music_Controller_BP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3907[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x8(0x10)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x21(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESubGame                          K2Node_CustomEvent_SubGame;                        // 0x22(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x23(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
