#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x14980 (0x14E20 - 0x4A0)
// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C
class UFortnite_M_Avg_Player_AnimBlueprint_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4A0(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_90346CA949B10612E2517A98EABCA3F2; // 0x4A8(0x48)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6AE6BE5E4245D9BDD885E88DC11CFDE2; // 0x4F0(0x60)()
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_167235F84D5A17FC342E738C239E417E; // 0x550(0xC0)()
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_80EBD977446C9F5DE2B4EF911D08E2DB; // 0x610(0xC0)()
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_43F5C77D4E5801A4749197924FC84777; // 0x6D0(0xC0)()
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_610F7B56472AA73B1B2D9281CAFE23DF; // 0x790(0xC0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_0835E37E4BE8CE8DD6C449A998E91383; // 0x850(0xE0)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_C2FBA628431D909430E0B383682A0D68; // 0x930(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_8B17DAC94A8C00B10BE1CCB9FAFE89F2; // 0x990(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_DF9058564507FBE1DAB7BAADDC8AC490; // 0x9F0(0x60)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_CCBF1E684B4742313BC6CD97062B3F3D; // 0xA50(0x60)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_9F47DEB24F88BB6E2748CF9F93B4F77F; // 0xAB0(0xA8)()
	struct FAnimNode_HandIKRetargeting           AnimGraphNode_HandIKRetargeting_569D26DB417B57D435C3B3A6D2DB399A; // 0xB58(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12C3BF32467A81C8EC71A29C6F508F88; // 0xC20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B1FE184A40057CC21384CEB44493F668; // 0xCA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_077E878746D9F61ED14F7AA45FC6663E; // 0xD20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_900DB5DF437D2AE536350A9378A3671E; // 0xDA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9830582144A5DD9D92B1779D2932155E; // 0xE20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57A38BEC424DF00BEF6EDE9F03CB04D2; // 0xEA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95F04B3444FE6F3F3BC83884E7AB16D7; // 0xF20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18D3D40F44F68CD268E439B042110CF5; // 0xFA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_800FF477404E357C674CC9B1642363DB; // 0x1020(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5C79832744A7DE54AC5B11ABFC751167; // 0x10A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8710578D463AC2BF4F3C07AE03589C71; // 0x1120(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5888D3134AB39EF4BD6090A4D05A70CF; // 0x11A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95E036394DE666520B2AACBE0C718C03; // 0x1220(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3060AB66495C8EAFA16F58AA91F51F19; // 0x12A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1165D6C4A871CC96410B290F01FBD2B; // 0x1320(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_681E0A16460C257859E5AB895D56228D; // 0x13A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5FA3E534495CA9B86BD99A9071F22DB9; // 0x1420(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_256C97FA4C27CB607C92FBB69B5FEDF2; // 0x14A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5E2C9C0E4ADF54A3ED1F919DE34BB9AC; // 0x1520(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5DDCD265434507DF1AA5A8BD53C8AE7E; // 0x15A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8D5CDBFF40220910A90212A20DD7BEE2; // 0x1620(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_449BCB1B4A64AD9E220303B23CC74303; // 0x16A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46D842DB49348C10D0F4F38355AA0466; // 0x1720(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4B58B830439EDF0B10D1819AA45CF2D7; // 0x17A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C4101CA2462FB9BFCA501D96A6DC0BDE; // 0x1820(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3ECF0DA04507F3C5C57D2D9155D8C227; // 0x18A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D55263A2479588C54F6A00B89A5ECC43; // 0x1920(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3C79F6C242177C80AEAF8ABF61202931; // 0x19A0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E192D7AE435680834D42C2AA75C45085; // 0x1A20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_03A99EBE40BEF26D9F77C8B679A9DA44; // 0x1AA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F518F3A94919DD74AE359F9223CAE232; // 0x1B20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CF6808CB43DA4D499C3A5DBF1A56C72A; // 0x1BA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9DD1082C47DCB632833861A44B3C3CB9; // 0x1C20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A9A8FAB6471BE9BB2065CCAD68BFD3A1; // 0x1CA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A40D21D8475ECE64D5F38387455EB398; // 0x1D20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9B3B6C454F1FF025AC1F9B977B45E307; // 0x1DA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6E92FCC3432E76BDF5831D8B53E076DF; // 0x1E20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_88376B1A43DE50367A9423853E95FF43; // 0x1EA0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6F232AE44B753ADBFC61EAA81A7D7C8F; // 0x1F20(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7B9D981343EA9D6D2C2280B5AB2D2DAA; // 0x1FA0(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0693D8C74CED40863506ED8986C47580; // 0x2020(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9E269661458C8EAF1BA79D849C4F3A9D; // 0x2090(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7BE8D9914A1B88A11A7A6FBEFA9A88F3; // 0x2170(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D493015E47B19E207BA5F2B8627FFED0; // 0x21E0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_A7069F0D438E98C8562355A973E11929; // 0x2250(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6E6CD3B24F69F5393570F2A83F4182B3; // 0x2298(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3AFA915F4D4B6E204130CDA75A248C3A; // 0x2378(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6771C032497D74D8DDABCA82D4EF0499; // 0x2498(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5C58397047387CE813BCDDA88F7C47D5; // 0x25B8(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_84DD84A942C32F8872CAD6BC31964EFB; // 0x26D8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B5AFC2BC4E61CB62F9D9EE8121DB445E; // 0x2720(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_C9B0DADB4803505DDFBBF8BC5B7EE43B; // 0x2790(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_289A669448277EB995EB298D000414C6; // 0x2870(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_59D06F064FB911D3B0DFDF8255A4C0AC; // 0x28E0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_2864A38F40B572B724E85D8BDD6C79F9; // 0x2950(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A96404DD4595F93776716891BF27A200; // 0x2998(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_EADCF76B4D232554DB3D5F9B71BAC602; // 0x2A08(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_637D5442401F7FD915B2788C8AB07089; // 0x2A50(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_1F1181E448AF72430D786EBA9BC8F5DD; // 0x2B70(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_148FC92F47404EAD21AE11A2FECFF0AA; // 0x2BB8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_90C6C18A4F88FE9424AA608E78516DD4; // 0x2C28(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_30F71A9B457333D3356180987B6F7D83; // 0x2C70(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3DDB56EC47487B8992B996901178EA50; // 0x2D90(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_42A5AD444EF3EC70246A54A06875631A; // 0x2E60(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_F901E09D4572A7C5A5BE198C4CCF527B; // 0x2F80(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_745166924DBB00CF723A04A9D23D933F; // 0x2FC8(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E014B51F49E9E63DAD04A1ABAF088292; // 0x3098(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E967E7D741CB880BA2620792FBD8392B; // 0x3108(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_05828D4E485BE4670A14948BCC157652; // 0x3178(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B40D4CE2490AD1F818936BBAEAC9CA0D; // 0x31E8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A443E43D4A29CB106A42DE8A8773992E; // 0x3258(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_D2164CF24023D4FD70E14FA8D1739C57; // 0x32C8(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_BF94105E405A504CB0B0CCB0BC71EDFD; // 0x33E8(0xD0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2AA23433414FA0D117EE8EB89A89CDC7; // 0x34B8(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B77D20AA4ED95BE56FA5DAAADD63AC57; // 0x3598(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8AFB5C4546797B6FE515AE905D7AF117; // 0x35E0(0xD8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_0FC0CA244C7C9C623B8D96A6264B12BA; // 0x36B8(0x78)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_A2474522405FE241EF3324BE8C11AF63; // 0x3730(0x120)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7F1914AD4DF51C3D988E7691BBB82374; // 0x3850(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4BCF1C554952F96DBD83AAB32730DD40; // 0x38C0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CF5B83E04E9632A5B57514A8178C8705; // 0x3930(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F6255ABD4C398FD996980EB73282A8E6; // 0x39A0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E443848A40E6F114200667BD3722E2CB; // 0x3A10(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6FF6E46D4062C39B5245ABB75972B06E; // 0x3A80(0xE0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6DB04CA24A6562C94F4F56B5072E27EB; // 0x3B60(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E5BEC68A40F7EACF95E7A1A7F24C01D0; // 0x3C40(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_AB14150141F1A71D05864A80ADF61F70; // 0x3CB0(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DF9F2500494F22DE18C7FF8BCF3C1B59; // 0x3D90(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_717D9A5D4FBDC97DDD17818DFC9C4D4F; // 0x3E00(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F8E2FB874D5087726757B685CB4F8A5F; // 0x3E70(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_07643FFA4673AC5376030BB7A4108590; // 0x3EE0(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E92FEAA340174177D8D9929649657B62; // 0x3F50(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_D747E13544D5A741284710AAFCDC84EA; // 0x4020(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_5583B38549A46244A7027DA303869FFE; // 0x4140(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_90DB6B59470599ED03831BBAFAD9211F; // 0x4220(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_A90571E64646C14279F09D84118087C8; // 0x4340(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_03AE536A48B2CA2303B7F68E2A1B6FBA; // 0x4388(0xD8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_407374F144F79E0427B86E97B578AE08; // 0x4460(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_616CB49F4A1E8D1C65D7C79CE28549EC; // 0x4580(0xE0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11C0E9844B2BBB05D46047B7B3F787B8; // 0x4660(0x78)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_E7B7FE924C9B9CC3279F11B1A0ADF540; // 0x46D8(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_D164345F4E8D34624EF9FCBF9A699559; // 0x47F8(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_056271AE4144640EEE96D1B2EAC09443; // 0x4840(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3CF345E842E756B4BA88D19626569360; // 0x4960(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4DA5ADB2424FAC8867FB4FAC19C7C1AD; // 0x4A30(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_BA8DD7CE42B55C8F384D209A4BB110DC; // 0x4B50(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_EE46F62645F23F9282A973A588B34AC0; // 0x4B98(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C00BFF444C5D6CCC595A9EB0052AF74C; // 0x4CB8(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4C8DAF3A474D389236A074AA828E108C; // 0x4D88(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_09AB34B34F9A782A9CB484ACFFFA5B2D; // 0x4EA8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A1FB4F074BB4541FC781B685940BFB6D; // 0x4EF0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_91EE493C4141FC70DBD98AA5C99881E9; // 0x4F60(0x48)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_D3A7DBAC4DADAF0FE4831F8ADACCF68E; // 0x4FA8(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2F2AFD9C45DBA8AB3431459E59177056; // 0x5078(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7261F0AA4B2BF566CFE78CA790DDCD0D; // 0x50E8(0x70)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_8DE9A0DC4FBEF5490219FAA4EACD925B; // 0x5158(0x60)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_0EFBB5D041262FB97BB376B5FE628FA3; // 0x51B8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45CDB0844A1C154B04A60596900577A6; // 0x5200(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CD8EA8F34B11E4C0D4585D8D21CD4791; // 0x5280(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F5AB533C4B2102203A22048CEFFCDD94; // 0x5300(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_682CAB9F446087098485AB97B65065A6; // 0x5380(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0C616F9A461ED59C501E2BBE002C2C1B; // 0x5400(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_504D7E3E477DEEE78E94ACB05F2F0E42; // 0x5480(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F6D3BED04D7641E786238592A285E6FA; // 0x5500(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1E739EA94A3EB6D263CF4F9D8A63BCCB; // 0x5580(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61747DAD4C63F902909E4889E05CC1A7; // 0x5600(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74F669814C9BE2D4B179779FF0DEA1C2; // 0x5680(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BAD1F657444483494234F0B9A5890EBF; // 0x5700(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9F9D13DA473BB190969A46B10EA3C83F; // 0x5780(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56AEB2CE49605B5F061E9784765259C3; // 0x5800(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C468F912436B0623C90DF386696E3A71; // 0x5880(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1E86D230478D65DAEB8445818B7B8CFF; // 0x5900(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B9061B2D45D91987D923BC810446D60F; // 0x5980(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C123981043E5D6DF76E6CFB301351418; // 0x5A00(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1793503F4ED56AA2EC8268808AC3A8B3; // 0x5A80(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B970985B47A107603746EFA2C0EE72F5; // 0x5B00(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_556770954245EDA5505E6AA8EF753F46; // 0x5B80(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FC2CFB334ED944264EDFED80C142F56D; // 0x5C00(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_97E4CFD547CE169D041A3D857E452304; // 0x5C80(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3597D57041383D20A9ED2DA65FA1B76B; // 0x5D00(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_74E28FA24FAB177275BC3DB513C06596; // 0x5D70(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_059CFFA342BB002B1620FC94039220D6; // 0x5DE0(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8B32BEAC4E62C216A8B778BD2C837F48; // 0x5EC0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_702E173842C90F7DE7A1AD877B7ABD8C; // 0x5F30(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_86551A19466526607996BE9808EC39FF; // 0x5F78(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5FBCA6834270F9A45479D483D2BC3085; // 0x6098(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_64292996433A4F04DF938289022C0BD2; // 0x6168(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1845F51F4429252B914802ACFD08C59D; // 0x6288(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_779CCC4F465A0BE751770EB69DF9240A; // 0x6358(0x120)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_FEA20B8F4088BF3CCAA1B4B32B0E791F; // 0x6478(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D2A2225D44DEF157E378A690AD4A27FC2; // 0x6528(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_55FE11D24D167EAB3769838ED3494C882; // 0x6598(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9B9F37B741F8BB0FE22C15875D1D7FA82; // 0x6608(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6F29508E4CF3732ACCC2CA8721894DF32; // 0x66E8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E8F37B5A47929EE2B08C09B9DCC67FB82; // 0x6758(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8CCBF24643CE8364B60B48B76A60E2B02; // 0x67C8(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_0A29B81C43A9620827CCD39BD7041F5E; // 0x6810(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_368E904E4617A2E915197DAE30EA45A2; // 0x6930(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_559B97304D50DA1E18B740B293C00CC5; // 0x6A00(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2718D27A4A9ECA4DB2F754AED329A6AE; // 0x6B20(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_FAEA9F7E4ECD8008ABBBD880B705F4ED; // 0x6BF0(0x120)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_0249E7AC486A15CCCDED5AA7E9E42DF5; // 0x6D10(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D2A2225D44DEF157E378A690AD4A27FC; // 0x6DC0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_55FE11D24D167EAB3769838ED3494C88; // 0x6E30(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9B9F37B741F8BB0FE22C15875D1D7FA8; // 0x6EA0(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6F29508E4CF3732ACCC2CA8721894DF3; // 0x6F80(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E8F37B5A47929EE2B08C09B9DCC67FB8; // 0x6FF0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8CCBF24643CE8364B60B48B76A60E2B0; // 0x7060(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2E2E5B934FC49212A5236CA1C36D7263; // 0x70A8(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2A2D30C44A127E327786D091FCC3E680; // 0x7118(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6D59C9E74B6910331480D0BB3E1781D6; // 0x71E8(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4D1FAC224C8E05BB77108A89897E1308; // 0x7308(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_C06C27A6423F5E7E014800A3A651DA60; // 0x73D8(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3CE03F3547386C9076B3D091034BBCA8; // 0x74F8(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_FB6CF0684C691E3122CFBBA6B6E8B838; // 0x75C8(0x120)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_06311F4B48BA9AB06FB37FA88F71959E; // 0x76E8(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D428E06642D440985A3446B84EB42C72; // 0x7798(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2BA3671B46548E57FE983BA309EBF25E; // 0x7808(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F707B6404EE7817189F0568DE09909E2; // 0x78E8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FA20D39B4DB1CD65515C22BF2E8AB7F1; // 0x7958(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49DD19ED4612A880B0D81CB3236E1E59; // 0x79C8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_01C7B8FA438CFB33F754088C56E43782; // 0x7A38(0x48)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_0799820040CAE1823A0A88BEEB44EAA3; // 0x7A80(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A84664224A98F59F45DC5687B8475A38; // 0x7AF8(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_A560FC37408509037F800E947678439D; // 0x7B68(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_23D94ADE445785BAE12DDBBA4BE59A14; // 0x7C88(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7025CB114CA2C86AD62338BA910C925D; // 0x7D58(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_D12EBFA3419BD943D726ADA26CD07AB3; // 0x7E78(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7E0901D54AF85221EE6FC386572B12DD; // 0x7F48(0x120)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_E8D5D2134884DC5C77B7E6A56A22477F; // 0x8068(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8AC92ADD4B83B31A934F0E81D4ED8BB2; // 0x8118(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3BFF68F74E880ABD33D943B82CC3E09F; // 0x8188(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_77CA7D56494300C4F9BD0FB5857529BB; // 0x8268(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A4CF5ED3487DFAD1EA3992ACD92F1990; // 0x82D8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DB76758845C67B57880F83B3F4AA34EC; // 0x8348(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_0C880FAD42C9FE90620F29B0812B1E78; // 0x83B8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6CB772BE4A9A67CF7F405EAF16A32C8B; // 0x8400(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BF31ED834067DCB09EB52398D06F1E99; // 0x8470(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_A3B76DA84DAA22FDE52DDC97EF29C928; // 0x84E0(0xD0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_FA04DD0544E75B1EADBE65ACB75C95B12; // 0x85B0(0x48)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_FCB0FC034C831397E928A1924AA08F0B; // 0x85F8(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_90E4248345418A4981667697C1388B30; // 0x8718(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5A2A58D046F2444F3368ECAFC5A0FBC9; // 0x8838(0xD0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_F5A6116243D08C3CFE43D3A0EC66F0DC; // 0x8908(0xE0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5B8707F049AE64E555C86FB91BCA44BE; // 0x89E8(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_570BEA9E44F7058C9E960D87BA7F702E; // 0x8AB8(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_966A5D6D43389C4C09765CAB065F30EB; // 0x8BD8(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7FB14B194B1FC25D73D68EBEDADB5D7C; // 0x8CA8(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E073E2FA462CB46652FE06B879403AF0; // 0x8DC8(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_952AB388445540CA531661A9EA345420; // 0x8E98(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_122673C544CC5AA3F7FC83B52CD40606; // 0x8FB8(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3BB6D8C54459B573F50CC1B3995ACD60; // 0x9088(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_480160114160CC7731B7E5A25CD36C4F; // 0x91A8(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_31FA993E4BA1E6398E2A7B998E3072F4; // 0x9288(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_9CD275AE4A6CDC9F8CADE9BB8678AB9A; // 0x93A8(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_88D27E23408F59EA5089568525BBA1B7; // 0x94C8(0xD0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_5B2D35834AE62DDE159132B8FDBD20FF; // 0x9598(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_819A2C2B4A360C414FF1C9AFBB0D8FB3; // 0x95E0(0xD8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7120D0184152A59B08B41EB326E16C50; // 0x96B8(0x50)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_BA72E5A0455FDBCDB43EB8BED5582C13; // 0x9708(0x78)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_88BCD8124A58678127FF55B84FAFA8D1; // 0x9780(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5916E57B4B64B5ADAED53F9461C33322; // 0x97C8(0xD8)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3DEB50D3453475EA2AA16593DD6A1849; // 0x98A0(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_67717579495D7A9FA6CFC483DD706300; // 0x9950(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_998621D74CA72EE3EACA10A088A74B79; // 0x99C0(0x70)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_8CA11A0148AD3599C8C5A68936D186B1; // 0x9A30(0x60)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_610F274F4E3B9C4346C6949A50567B71; // 0x9A90(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0A2BBF3A4A1B2DC539D5A991C68D6E19; // 0x9B10(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_091B00F54E8BAF3A05D93C9034FD3B0B; // 0x9B90(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4F7814814B371A3DF4B359BD88AF3E70; // 0x9C10(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FCC890AA4710698C891A5485E1E3ABCC; // 0x9C90(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8DD3B2C84A372E66CD0782938E22672D; // 0x9D10(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_200BE71F42E88EFFBAE17EAF152CEA7D; // 0x9D90(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8B511E5D43329E71F4917D95F739CA65; // 0x9E10(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DE669499467CAB05E2D063B29186F080; // 0x9E90(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E7D0369A4868B78590F8C68F5E969F08; // 0x9F00(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_822494194418AD53A23B1DBE715585FC; // 0x9F70(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_578D122946339289878AD4A8A2B43BCB; // 0x9FE0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CBCFA1BB47A142BFF48B3CAC12C0EE6A; // 0xA050(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6CDD28364B0E3116E4D7908D4EC016BF; // 0xA0C0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8082DF774C89A7C94E6CD19EE53D59AC; // 0xA130(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C7902F52454C36875AB6DAABC658BE78; // 0xA1A0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1AA3764B4FAF3E770099C9852E960413; // 0xA210(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42884F5D45FA768E5BF7B1A785DBCA67; // 0xA280(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_86B7D2BA41F87F5298B50B865AA088DC; // 0xA2F0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_05E7AF574385243804BD59BF2B03FEB7; // 0xA360(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DE181588417A66480D26E6BE0701BFB3; // 0xA3D0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5B087E52449318CCFFC2C89E32C063C5; // 0xA440(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B8E8C1FB4E04C25FB47922894C5CE952; // 0xA4B0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6A968A57409465BF85ADE59F91D6A130; // 0xA520(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DD7A88AA4BABA4EAF38318BC82D1DC12; // 0xA590(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_70C9530247102A4977B21AB4B4DDADBA; // 0xA600(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_24A054EB46DB5260D4EA3E8FC49608E8; // 0xA6D0(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_A4B393E046FE77F92355E1B816A2CEDB; // 0xA7A0(0xD0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_F99F0C464DE1B9A3BD1F7D8C3588FB47; // 0xA870(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_59944AB44BA8923A2A0CAB8CBE821C49; // 0xA950(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5D3430244F050AF65BFC6D950316EA0B; // 0xA998(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A2F8FDBF4CC267A9346FC19BFF7C1C4E; // 0xAA08(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F34CE333440705E32D8C45B2D9386C75; // 0xAA78(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8E18AA404541DCF3688C9FAE1EEB1204; // 0xAAE8(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_0D77052643739299B8A450A3DC3E285A; // 0xABB8(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_943C23F748EF24F97228D3AA7CDB328C; // 0xAC88(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F933FDF74D79487D99E9DCA450A92B0A; // 0xAD58(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_896E37F549646720464EA0B642BC8C9B; // 0xADC8(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8650DF484DB2D5AA76AA648D37855358; // 0xAE38(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4F807FA740BEC23846144BA841F2CD0D; // 0xAF08(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3115092B40128302DAEDACBEFA28B166; // 0xAF78(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_EC8C197540ACD58885B4A392DCB8E56A; // 0xAFE8(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_998EDF66471FBDF25FD17680EB56F1D7; // 0xB0B8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0DFCB6EC462CC0B84E0DD48D6BBFC2AB; // 0xB128(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_88D65BBB4B18A1FE5F9183B783AFF625; // 0xB198(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_606BB4B84158C1A83549BBBD6CC8DA23; // 0xB208(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_56DE663948F4C7E07084E6B9733D6902; // 0xB2D8(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1225E7E34A0F518B19EC98BC60AE83E9; // 0xB348(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_63B0F63A4E7141A1CE0C57A8EB77835E; // 0xB418(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CC69445044AA2BAB151723A0CB919DD5; // 0xB488(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E55DF49345B91B496691A5B7A0C603B8; // 0xB4F8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A462A5B34FB6FB67AF85128F78E5831C; // 0xB568(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F42F92FA4E176CE6E6907B82A1743F46; // 0xB5D8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DF41388F475BEB69EA0F18AC2289379F; // 0xB648(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_906DC893452525E4D62798969C725E5C; // 0xB6B8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3AB2BDC04099D0AC8583CB9689127E28; // 0xB728(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2BB84DA547700081F00076AC40B2A50A; // 0xB798(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1EB28666480B8810A09857B9A6ECD194; // 0xB808(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C3D18BFE46CF2E68B15EF6ABEAA78D33; // 0xB878(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13FA17194F4FDA53FA66DF8E0118FFF8; // 0xB8E8(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9260056C450C16683950238F6F112106; // 0xB958(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9E2AE9D043D1238E26B331BCA16B3A80; // 0xBA28(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_DBBEF3A54E0FFEE025876BA51E25CBA3; // 0xBAF8(0xD0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_BEB051744B8E56AAD197DB901A5E9CE9; // 0xBBC8(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_545420C64B78A4F59A83A69C96107A9C; // 0xBCA8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_32D322B345CDD0FCBF52988CA10E290E; // 0xBD18(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6D511F6F4A36FEFDB59D8C97549A240F; // 0xBD60(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_534B037C4CFD1A42D7826DA824A07C91; // 0xBDD0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_948BB2344072FADC66F4988E41F4953C; // 0xBE40(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_EDD349B84985171824816B80276A5375; // 0xBEB0(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1D6CF13A4C36355E51BAA3A2453D96F8; // 0xBF80(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4E6F91A846BD0347B4620383B23D25DB; // 0xC050(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_718ED8EF4B9DDF4F62659C8887E03FEF; // 0xC120(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_541BB3104FD5C87063CF41B44A3F5B65; // 0xC190(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1DEEB05243A30A042B5BFDB6B13C216D; // 0xC200(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_52EA24A24387E9693715FDB06F309D4A; // 0xC270(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BA3759614405492BC7F5C6AACF0E3B9F; // 0xC2E0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BE3AAE7742A23435FE4D94A98F9CC0D2; // 0xC350(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5B063CC04F8CD9E5EC1E6AA602E603D9; // 0xC3C0(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_08A2876A4C736F42BB6469B9261F733B; // 0xC490(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1996719445E8CBD1ED976D99548E059E; // 0xC560(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15AD3D64405AF45B02771F951EFB0E3D; // 0xC630(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2936E66E4545E3C0CC629FA0FE48820A; // 0xC6A0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1DC41EFF4BB14A144E5252A8625E2186; // 0xC710(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14A4E32B483883B9C68325814171A1FD; // 0xC780(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4D7122C449A05522EDBE81953684CF6F; // 0xC7F0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_971C5831407707FD2F61699274E87DE0; // 0xC860(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_345A31934E9935C2AF371D96753FC0C2; // 0xC8D0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5364166A4E44CCEC187F7492D50D1C69; // 0xC940(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41F30FD8456B9EFC82DA9AA9670A5C87; // 0xC9B0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_599224754C31D2BA7720B1B360EDDF72; // 0xCA20(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_065E238848228EF2F85E059A12620179; // 0xCA90(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C4A67D774C6CB4EBDBDF6E8192CBC50A; // 0xCB70(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_99A1E4B54248F04F4687D69B954A5EC3; // 0xCBE0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5EE7C5D443C82E957E3845A2050ADCA3; // 0xCC28(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2C2374A44E6BCF455E869FB7DF6D080D; // 0xCC98(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9F90F99643D036FA875EF9BEF34FBFCD; // 0xCD08(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15F6827B446469B515D405B6290814E0; // 0xCD78(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7487039343D1FB20D29A3D90744448C6; // 0xCDE8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_07F4996947F1FD6D09A0F9ABF9BB16D0; // 0xCE58(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5A720FC749111212DCDC4E82149BE586; // 0xCEC8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A251DFB346A714BAD01845B2650E7793; // 0xCF38(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9BC6F1E948DB9A6026D61E87EAB8AF90; // 0xCFA8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9A156F324634C3B582E9CD87100F5D58; // 0xD018(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EDCE0C9D40C4D4B20226E4AA5AE8B87C; // 0xD088(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28CF0E154ECFA84D79D805851CE38C57; // 0xD0F8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B3566F544A7AB53037B4A3B3B5681D12; // 0xD168(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DACFE59A43FD63FCF55DB9B77524F560; // 0xD1D8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F857374B4ADA1E0641A1419AF29E1092; // 0xD248(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DFCA53464B8920BA55D6A18BD2AD6AC1; // 0xD2B8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FA8A504A4472B4469FE58B9A1B67A3C4; // 0xD328(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_24BB55A94C5B8C1CEBF92C97A8606D46; // 0xD398(0xE0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_80EBD9A44703F9DAB65AC79AB6810B2C; // 0xD478(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_63B740B64A9CB6B739AF24A5CB458E89; // 0xD548(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_682E912642030BD28E001AA1EF14C725; // 0xD618(0xD0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8F9F075C4C918632AFEEBD8662D1901A; // 0xD6E8(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_30BBA76747B35A4791A1DAB2B66D8A07; // 0xD730(0x38)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_FA04DD0544E75B1EADBE65ACB75C95B1; // 0xD768(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3E22F765444994C1A890CAAAED910991; // 0xD7B0(0xD8)()
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_8C4B3BC145DB6F2FD7780FACF676D0CF; // 0xD888(0x78)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_84157BE948059A843EA0A6B1C3EF095E; // 0xD900(0x120)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_DD77219B432B97B3584255862E88741C; // 0xDA20(0x78)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_79D30C9B4BB82811599BFDAE6F9574FB; // 0xDA98(0x48)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C44FD2E84741D72277EAC8B90F118A2B; // 0xDAE0(0x48)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36A8801645C3D4DDEC3BA6847D55A02D; // 0xDB28(0x48)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6DDE2EF0443E2F6833096EAB865A5B05; // 0xDB70(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F6C1356A4252A11C25B3D78A2609D7AB; // 0xDC50(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_F6CEE6BD4CCC81C772B08787423C90FE; // 0xDCC0(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F51E07A74B6174B2EAE582B9C51A61F2; // 0xDDA0(0x70)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_D3FC06A0416D64B8EE21DE8063094A7E; // 0xDE10(0xB0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_8770A69043C6F02B17B30A8E567320B9; // 0xDEC0(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_7E8097F3472419F179598699F44C722C; // 0xDF20(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_F5E4F84E4588ECBECEEADCB315713C85; // 0xDF80(0x60)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_C0F5C8504ED4DEC7786883B85F5E4E06; // 0xDFE0(0xB0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_9AAF4A5444BD39BEC6CFB7829B225375; // 0xE090(0x60)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DCE9351E41C3F1B2C18B05ADBD7D822A; // 0xE0F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EF459624432831737FCC5ABC6CC537CB; // 0xE170(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AAB1064A4012DDD1DB02638D17480F17; // 0xE1F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0098AEE84093317877969B82FE7A8F7D; // 0xE270(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7F36C4454163BC69E8401BBF7C749021; // 0xE2F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E5E68C404494A9AA6322E68A75257C8B; // 0xE370(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DB0D6FFA49133177E655FFBE1007E002; // 0xE3F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B07AF5854EB241D1A5B69AA3117D0A44; // 0xE470(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9E67949D454D1BEF1C3979BF8DAE4CDF; // 0xE4F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D02CFF194396DEFF34F3D8B8CA4478FC; // 0xE570(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_550CFD424F7E9E17E2D876B415EB0304; // 0xE5F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3FF5D3D545BC14EA0F9E109C43CBC147; // 0xE670(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6BB17E2D4AC30C19D4ADFBA90BA87110; // 0xE6F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AC8FC8C74E7E4C9E9E2A69BE0A4CB4BB; // 0xE770(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31408C3646A26E17719FBF86BF92B752; // 0xE7F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_068AA4FA459FAF7D6BF38AA9CB6A959B; // 0xE870(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_333099CE4BE34A4D1F7918AE95252194; // 0xE8F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6F509D6444539FCF09B3AB80F09641C0; // 0xE970(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C2CF6BE54AA2F5873D5CC89B6A6A902E; // 0xE9F0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CCE4909D469B6481C5C6328FE6F312EB; // 0xEA70(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6C0190EA44C201A27ECBAC99B592A0E5; // 0xEAF0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A012CE9449496A0726C95CAF639727AC; // 0xEB70(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FC37C1F94F9B9D3B4B27FEA2D912E5FC; // 0xEBF0(0x80)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B708732A4E8A2DB09017BBB0E14ED3DD; // 0xEC70(0x80)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_60C823BD4EB3787519721F95BE184D04; // 0xECF0(0x60)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7166822B48D424B9D357D584B93389B12; // 0xED50(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_96C7A2AF4057360463CEBB8DE86FCC4B2; // 0xEE30(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_798F0527474B8B20129F0D87506CDB652; // 0xEEA0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_93770B5C46A6033F6CAA90AC6FD4C98D2; // 0xEF10(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_901014864C8FB85EFD75EC877EADF6C02; // 0xEF80(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_64F55C834C9ED5C956065EAD19E7AB7C2; // 0xEFF0(0x48)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C4B9987545F781E613103182395867B1; // 0xF038(0x48)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_FA5F08B146B648F065DCA180625072D4; // 0xF080(0x48)()
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_17867ED445F64E71BBCCE493BE20E7EF; // 0xF0C8(0x130)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_770AF9CA4B9C561757208DB7F72B472A; // 0xF1F8(0x70)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_FDD2909B4AA9B4C98A896E92B31C2153; // 0xF268(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_AB6EAAC54CA8E767351CABBD82856149; // 0xF2C8(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_0687EFB84F903175D14CDC88C6640505; // 0xF328(0x60)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_FD6B9F34455F2319DBA16391C4599694; // 0xF388(0x60)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_79535B8C42A10EBACB358AA364D3AE01; // 0xF3E8(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E998584340097926122A0C933CE5C5D3; // 0xF4C8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5A809D06460F0779469A08B3CBBC520C; // 0xF538(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1EB47DCE4636E98E69C4C88D2E4BE48E; // 0xF5A8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_A425079843096A92210B80B16DA678FE; // 0xF618(0x48)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_D5D8CD1C41FA9C8306845B9B67E4F042; // 0xF660(0x60)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7166822B48D424B9D357D584B93389B1; // 0xF6C0(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_96C7A2AF4057360463CEBB8DE86FCC4B; // 0xF7A0(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_798F0527474B8B20129F0D87506CDB65; // 0xF810(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_93770B5C46A6033F6CAA90AC6FD4C98D; // 0xF880(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_901014864C8FB85EFD75EC877EADF6C0; // 0xF8F0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_64F55C834C9ED5C956065EAD19E7AB7C; // 0xF960(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_77B831D0400D1E57AF522380786969C6; // 0xF9A8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_91492B0B4DFE2AE2FC09CEBF5B8FDB5A; // 0xFA18(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6508E8004C7282EF0045D5B0E6E235EF; // 0xFA88(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9121E8464A3979CAEE017A96BD7C6FAD; // 0xFB68(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F65625C94811A2B90289B38A0AC2EADB; // 0xFBD8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31C121084AC6A1493CA9EAB9B1E69E3A; // 0xFC48(0x70)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_315FB0684D342C4730C9F3BB8B65AB4F; // 0xFCB8(0xB0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_EE0053544F1FA7DC1425BAB2EB422C4F; // 0xFD68(0x60)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_E523C1824AC072B7B7C707BE53BFDE24; // 0xFDC8(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E9B3A2F24D8303588F07C691EFDB1FF6; // 0xFEA8(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_457D12F24D35E03C7F344E892439F4D7; // 0xFF18(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11CC4906440C5EC8E75BF9BFF2B00994; // 0xFF88(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_FD6AF19249CEFB40932B7F86606180E6; // 0xFFF8(0x48)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_04FA089E497F5366ED8C88A958BA998E; // 0x10040(0x48)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_60713724494C91FEB0C2D49BF5E0D1DD; // 0x10088(0x48)()
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_04AA4DBD4130B682F6C9D1A0289FED19; // 0x100D0(0x130)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_772062964AD1FE4F8F2076AF00C7F6E8; // 0x10200(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1B8B56724E8B28F125DCD7BA23C4C9D7; // 0x10270(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DF3164554F89167D700C789F17DF0D5D; // 0x10340(0x70)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_E5D5240648535919A8A270A95618212F; // 0x103B0(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1FA0792944D84F5BC17475AD1FC817FE; // 0x10428(0x70)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_3D22484240C67B97F89B0A887416082B; // 0x10498(0x60)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_15921D4B4DB6C3AAE3F7E7B363D891B0; // 0x104F8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E18CE2A54DDA839D4AE3709D3405B6FC; // 0x10540(0x70)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_5AF6D57A4E4278F7405F67AA55A8E8CA; // 0x105B0(0xE0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7BB6C6C04FD5A592737248831A8F2941; // 0x10690(0xE0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_406D72D84A85A3442586DE95056174D0; // 0x10770(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C84CCCBB4E1B0C0925E19992F3FEA29A; // 0x107E0(0x70)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_56A9D1804A08306168C6F29FAE0DB24F; // 0x10850(0x50)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_23DD570440FEC680B74F8C90F1DF1051; // 0x108A0(0xD0)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_B3122B584EE89539EBC84CA073A943D6; // 0x10970(0x50)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_B11E52234F06C933AFE3D297B1F09A37; // 0x109C0(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EA7261AD42468E51A7B135ACFD1062F5; // 0x10A90(0x70)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DF3B1CFD49F934C5E1066D8A1418839B; // 0x10B00(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4617B14141892EF3495D8696BFFE50FE; // 0x10B70(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_CD94E10142B7098F7730079A150179B7; // 0x10C40(0xD0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AAC138E14B0DC2538143F2B4805C67BA; // 0x10D10(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E75C54C84C7F2FE54D5814B3903AE6CF; // 0x10D80(0xD0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9513D62F4773BD1C9DAF36822B1C06DB; // 0x10E50(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B4DBEBAE4783A56AA66D339599E5C940; // 0x10E98(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5CA1A80E48A014AFB5A65DB125FB66DD; // 0x10F08(0xD0)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0FA5086C4AA98DCDCBDAF1BF8CE99CB4; // 0x10FD8(0x50)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_960969B64351C51FE9728D8DE415D59E; // 0x11028(0x48)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_63B2F9CF4EBE4838635DAA813D87C60C; // 0x11070(0x48)()
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_7096E4DF47EEC636DCC34B975591CD9D; // 0x110B8(0x130)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6CF9C3D34EDF0CA6C6A3AFBB547AE879; // 0x111E8(0x48)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_1EECC16641DE5D21D86F36ACC561CEEC; // 0x11230(0x60)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2FC97465474821C4ED319EA1742F1011; // 0x11290(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7BBAAA5C4D2C51780732B9ACA30C23EF; // 0x113B0(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_817CE58D4D1E211B7DAA73894F36D813; // 0x114D0(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_B5056B224C395198530873A988C90A0B; // 0x115B0(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1B4969C748EB76C886E418BCA093EE89; // 0x116D0(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_CE317D204808F853C27E578B7E35174F; // 0x117A0(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_BD778AEA4FCDFD1B8A697091EBC517BB; // 0x11870(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3C81EB15418ACB6C79672AA8245B7E61; // 0x11990(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_FF28E128467C0150114ADABBD35DDE7C; // 0x11A70(0x120)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_39CB22814C04A7F231B90FBA05816767; // 0x11B90(0xD0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8B224B7F42C4529755A287B0D30D7950; // 0x11C60(0x48)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_660DBEAE4577974367AFF1B864D279EB; // 0x11CA8(0x48)()
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_8BB4AA26462F17FAAFB8F0951F848F90; // 0x11CF0(0x130)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_42B0DEAF4861DAFAEA9F93826E824875; // 0x11E20(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5448F23E497F1F675DE42BA36CFBA1AB; // 0x11EF0(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_0D1E666445401DDCB750FE98AB3ECED1; // 0x12010(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8EE9E62E457D38D52B08FF827112C054; // 0x12130(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9A89DAC449CE576970C08EA2E4C15700; // 0x12250(0xE0)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_FE4CC17D469195444F394791AF087800; // 0x12330(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5E2FD5044C5985CAB40E91B7F9A4D2D7; // 0x12410(0x120)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_64B6A1CA4B728650D57868A399A59270; // 0x12530(0xE0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_13571E064835EC784E7D009410A9955C; // 0x12610(0x60)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6D9CEF1545C28FFCB8313E85B2EB0794; // 0x12670(0xD0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_75276A384C4C3DE35880118DF8DCC06C; // 0x12740(0x120)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_04A100C04D68E5E6190E39A9EC99110A; // 0x12860(0x120)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_5DA815AC40CC356D32A9188DC16931DF; // 0x12980(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_53A0C0794E6172F8F478D1BFD7B9CB93; // 0x129C8(0xD8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2386C69C48917AFEDE5F8ABE37BC5844; // 0x12AA0(0x50)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_D9846C8F4BA9D98D058C22BCBF6F4047; // 0x12AF0(0xA8)()
	struct FAnimNode_Root                        AnimGraphNode_Root_3FC5D63748E5DFF6573A82BF5641E6BB; // 0x12B98(0x48)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_55F66DF94CA7DA6F7BF9B3BE10956EFB; // 0x12BE0(0xB0)()
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_CC1EC7974F8F64F71EC415AA4C16D53F; // 0x12C90(0x98)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_7A5C30D5473C0BD5C7415791493D210C; // 0x12D28(0x60)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_53DD69EF479BE436A705EB81EA3B9595; // 0x12D88(0x60)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8813E1B44A1F166E26E4AC921E6C67D2; // 0x12DE8(0xD0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_A1C928D0481F949D91BE5CBF8BC8D209; // 0x12EB8(0xA8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A7336AF44CA0D2A8636CB98F5DFC779B; // 0x12F60(0x50)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_37A1A14846762B266EA6BABE875ECB59; // 0x12FB0(0x50)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_67F4302F4C9FB0E95518DFAD11D2EC4E; // 0x13000(0x150)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_E212450C4C5A92A10FE7E284D3C2884F; // 0x13150(0xB0)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_FCC9D2DE4428B20FC1B00FAE7EB58D51; // 0x13200(0x38)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_A4B62761481E4F62D6468691836E7438; // 0x13238(0x78)()
	struct FFortAnimNode_SlopeWarping            FortAnimGraphNode_SlopeWarping_EB9AB4EC44DED49AA3F34392774788F5; // 0x132B0(0x1C8)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4FFE9DC74564420236C07E8FD24F2671; // 0x13478(0xB0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_9562E2F342B43FE2DF64C09301446187; // 0x13528(0x150)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_D62C4A9A485618C6FB58348C4DF4C04A; // 0x13678(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C1DFAAE34B6D9E5AAD95E78C8C139A3E; // 0x13748(0xD0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_C006E361403F6A89F7F01085DCD740A9; // 0x13818(0x150)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5296896745A8131FBA324CB04E39F4A6; // 0x13968(0xD0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_07ED87E14179D6D43EFD37AEB7C17F49; // 0x13A38(0x150)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_1503B85348B2964986341797805E279E; // 0x13B88(0x70)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_0B8D6FD54E0806E23C3DEE95C8D57F38; // 0x13BF8(0x70)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_661D685B40130CCABE4827BE5B7FFFBD; // 0x13C68(0x70)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_6ECBF05049D29D93396C0788EF290DE8; // 0x13CD8(0x70)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_96E4C19E4D8DFDAA6664EAB3311D5ADC; // 0x13D48(0xA8)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_B2DAF23A4199DA2469EC7091A4ACE4CA; // 0x13DF0(0xB0)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_773905C94F6BD3D4CCC97FA38EABD598; // 0x13EA0(0x50)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_BDFE2741423019A1B72E398597502FB0; // 0x13EF0(0x50)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_C82F14924B7030FF07FC0981E26C2EF0; // 0x13F40(0xB0)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0159658D433E8183422104A221D42740; // 0x13FF0(0x50)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7F30868D4011EE24834D65B370797907; // 0x14040(0xD0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C7557B8346B5AC5E2E88FD9F10339CBB; // 0x14110(0xD0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_B2DD22BE492155984EEF1CA57E3AA720; // 0x141E0(0x150)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_C554BA5A4BC4656A175A3193B879D95B; // 0x14330(0x70)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_DB95F1FF41AEA06273F498A062431E3F; // 0x143A0(0xD0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_297F617C497B1D6BE569AE86528D2DAA; // 0x14470(0x150)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_CCC1B438484445756896EA81C410D0C3; // 0x145C0(0x150)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_FF577ED34B5F2E50A4A5F5A4964DC1F6; // 0x14710(0x70)()
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_705DE7CA48B2CD4C169170B3A75FA6B7; // 0x14780(0x70)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_AF447B21452A575CFAFF26A158D5B714; // 0x147F0(0x120)()
	class AFortPlayerPawn*                       Fortnite_Player;                                   // 0x14910(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortCustomBodyType               BodyType;                                          // 0x14918(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortCustomGender                 Gender;                                            // 0x14919(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortBuildingState                BuildingState;                                     // 0x1491A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortWeaponCoreAnimation          WeaponCoreAnim;                                    // 0x1491B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2654[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EFortWeaponCoreAnimation, struct FPlayerAnimAssets_Struct> CoreAnims_Male;                                    // 0x14920(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<enum class EFortWeaponCoreAnimation, struct FPlayerAnimAssets_Struct> CoreAnims_Female;                                  // 0x14970(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                        DeltaSeconds;                                      // 0x149C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsOnGround;                                        // 0x149C4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsMoving2D;                                        // 0x149C5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsAccelerating2D;                                  // 0x149C6(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2655[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               WorldVelocity;                                     // 0x149C8(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               LocalVelocity;                                     // 0x149D4(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               WorldAcceleration;                                 // 0x149E0(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               LocalAcceleration;                                 // 0x149EC(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Speed2D;                                           // 0x149F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        VelocityZ;                                         // 0x149FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MovementDirectionYawAngle;                         // 0x14A00(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxSpeed;                                          // 0x14A04(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SpeedAdjustedPlayRate;                             // 0x14A08(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bPlayingRootMotion;                                // 0x14A0C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsTargeting;                                      // 0x14A0D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2656[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinimumLocomotionSpeed;                            // 0x14A10(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalAccelYawAngle;                                // 0x14A14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalAccelYawAngleLastTick;                        // 0x14A18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalAccelDeltaYawAngle;                           // 0x14A1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalVelocityYawAngle;                             // 0x14A20(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalAccelVelocityYawDelta;                        // 0x14A24(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SprintYawAngle;                                    // 0x14A28(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SprintSpeedThreshold;                              // 0x14A2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsSprinting;                                      // 0x14A30(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsAboveMinimumLocomotionSpeed;                     // 0x14A31(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2657[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetingWeight;                                   // 0x14A34(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bEnableHandIK;                                     // 0x14A38(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bMoveIKGunToHandFK;                                // 0x14A39(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2658[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Hand_IK_to_FK_LR_Weight;                           // 0x14A3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsStunned;                                        // 0x14A40(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bEnableAdditiveLayer;                              // 0x14A41(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bDisableLowerBody;                                 // 0x14A42(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bLockBodyType;                                     // 0x14A43(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bTestNewJump;                                      // 0x14A44(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2659[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FallPlayRate;                                      // 0x14A48(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FallAnimPlayTime;                                  // 0x14A4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PelvisOffset;                                      // 0x14A50(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Is_in_Idle;                                        // 0x14A54(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Actor_Yaw_Offset;                                  // 0x14A58(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsTurning;                                         // 0x14A5C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurnRate;                                          // 0x14A60(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        YawDeltaLastTick;                                  // 0x14A64(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        YawDeltaCurrentTick;                               // 0x14A68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        YawDeltaSmoothed;                                  // 0x14A6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Root_Yaw_Adjustment_;                              // 0x14A70(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Turn_Threshold90;                                  // 0x14A74(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              Actor_Rotation_Last_Tick;                          // 0x14A78(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        MeleeTwistCurveValue;                              // 0x14A84(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasPlayedFirstAnimationTick;                       // 0x14A88(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PreviousCurveAmount;                               // 0x14A8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CurveAmountPerTick;                                // 0x14A90(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TurnThreshold180;                                  // 0x14A94(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsTurning180;                                      // 0x14A98(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AmountTimeBeforeTurn;                              // 0x14A9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AmountTimeBeforeSecondTurn;                        // 0x14AA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TurnLeft;                                          // 0x14AA4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         TurnAnimationEnded;                                // 0x14AA5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsTurning90;                                       // 0x14AA6(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         RootHasBeenBackedOut;                              // 0x14AA7(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         PlayTurnAnimation;                                 // 0x14AA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurnAmount90;                                      // 0x14AAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         JumpLandStarted;                                   // 0x14AB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  MenuScreenDispatcher;                              // 0x14AB8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        SlopeWarpingAlpha;                                 // 0x14AC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MeleeJumpWeight;                                   // 0x14ACC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Adjusted_Aim_Yaw;                                  // 0x14AD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AdjustedAimPitch;                                  // 0x14AD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ShuffleThreshold;                                  // 0x14AD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsPlayingMeleeAnim;                                // 0x14ADC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2660[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LeanAngle;                                         // 0x14AE0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsMontagePlaying;                                  // 0x14AE4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2661[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LeanAdditiveAlpha;                                 // 0x14AE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LeanAngleMultiplier;                               // 0x14AEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsBackpedaling;                                    // 0x14AF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2662[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BackpedalSpeedThresholdAngle;                      // 0x14AF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogStartPosition;                                  // 0x14AF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        WalkAnimStartPosition;                             // 0x14AFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldWalkRightFootFwd;                            // 0x14B00(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2663[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AuthoredWalkSpeed;                                 // 0x14B04(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsGoingCommando;                                   // 0x14B08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldDisableMappedBS;                             // 0x14B09(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2664[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AuthoredJogFwdSpeed;                               // 0x14B0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AuthoredJogBwdSpeed;                               // 0x14B10(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AuthoredSprintSpeed;                               // 0x14B14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AuthoredGoingCommandoSpeed;                        // 0x14B18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldPlayJogStartTransition;                      // 0x14B1C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldPlayJogStopTransition;                       // 0x14B1D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldPlayJogPivotTransition;                      // 0x14B1E(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2665[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistanceToStop;                                    // 0x14B20(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               PivotTriggerPosition;                              // 0x14B24(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               StopCompletePosition;                              // 0x14B30(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsPivoting;                                        // 0x14B3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2666[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToFullSpeed;                                   // 0x14B40(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldEarlyOutStopState;                           // 0x14B44(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldEarlyOutStartState;                          // 0x14B45(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldDisableJogTransitions;                       // 0x14B46(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldEarlyOutPivotState;                          // 0x14B47(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        LocomotionAdditiveAlpha;                           // 0x14B48(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocomotionTransitionAdditiveAlpha;                 // 0x14B4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ECardinalDirection                LocomotionCardinalDirection;                       // 0x14B50(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2667[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LocomotionDeadZoneAngle;                           // 0x14B54(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartAnimBlendTime;                                // 0x14B58(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        NormalizedAngle;                                   // 0x14B5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RelativeAngle;                                     // 0x14B60(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         StartTransitionActive;                             // 0x14B64(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2668[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StartAnimDeltaAngle_North;                         // 0x14B68(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartAnimDeltaAngle_East;                          // 0x14B6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartAnimDeltaAngle_West;                          // 0x14B70(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartAnimDeltaAngle_South;                         // 0x14B74(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartStateWeight;                                  // 0x14B78(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartStateRotationMultiplier;                      // 0x14B7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         StopTransitionActive;                              // 0x14B80(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2669[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StopStateWeight;                                   // 0x14B84(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StopAnimDeltaAngle;                                // 0x14B88(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StopStateRotationMultiplier;                       // 0x14B8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DistanceFromPivot;                                 // 0x14B90(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JumpUpperBodyBlendWeight;                          // 0x14B94(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ECardinalDirection                OutCardinalDirection;                              // 0x14B98(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_266A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InAngle;                                           // 0x14B9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        InDeadZoneAngle;                                   // 0x14BA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogPivotTimeToPivot;                               // 0x14BA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PivotStateWeight;                                  // 0x14BA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         PivotTransitionActive;                             // 0x14BAC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class ECardinalDirection                PrePivotCardinalDirection;                         // 0x14BAD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_266B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PivotAnimBlendTime;                                // 0x14BB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxAllowedPivotRotation;                           // 0x14BB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldPlayPostPivotTransition;                     // 0x14BB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class ECardinalDirection                PostPivotCardinalDirection;                        // 0x14BB9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_266C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PostPivotAnimDeltaAngle;                           // 0x14BBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PrePivotAnimDeltaAngle;                            // 0x14BC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TransitionPlayRate;                                // 0x14BC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ECardinalDirection                StopCardinalDirection;                             // 0x14BC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_266D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               ActorSpaceVelocityDirPreTurn;                      // 0x14BCC(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogPlayRate;                                       // 0x14BD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogSpeedWarpingAmount;                             // 0x14BDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             SpeedWarpingLimits;                                // 0x14BE0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             SpeedWarpingAddlRateScale;                         // 0x14BE8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        InSpeedScale;                                      // 0x14BF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OutPlayRate;                                       // 0x14BF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OutSpeedWarpingAmount;                             // 0x14BF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LimitWithAddlPlayRate;                             // 0x14BFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AlphaToLimit;                                      // 0x14C00(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ReductionDueToAddlPlayRate;                        // 0x14C04(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldDisableSpeedWarping;                         // 0x14C08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_266E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        JogSpeedWarpingAlpha;                              // 0x14C0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ECardinalDirection                StartTransitionInitialDirection;                   // 0x14C10(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_266F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        JogStartPlayRate;                                  // 0x14C14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogStartSpeedWarpingAlpha;                         // 0x14C18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogStartSpeedWarpingAmount;                        // 0x14C1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              DBNOSlopeAngle;                                    // 0x14C20(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        DBNOSlopeWarpAlpha;                                // 0x14C2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortWeaponCoreAnimation          CurrentWeaponAnims;                                // 0x14C30(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortCustomGender                 CurrentGenderAnims;                                // 0x14C31(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2670[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UpperBodyAimOffsetAlpha;                           // 0x14C34(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultUpperBodyPose_Male;                         // 0x14C38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultUpperBodyPose_Female;                       // 0x14C40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         UpperBodyPose_Targeted;                            // 0x14C48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         UpperBodyPose_NonTargeted;                         // 0x14C50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         UpperBodyPose_Relaxed;                             // 0x14C58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         UpperBodyPose_Relaxed_Lvl2;                        // 0x14C60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAimOffsetBlendSpace*                  DefaultAimOffset;                                  // 0x14C68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       AO_Targeted;                                       // 0x14C70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       AO_NonTargeted;                                    // 0x14C78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       AO_Relaxed;                                        // 0x14C80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                           DefaultJogAdditive_Male;                           // 0x14C88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                           DefaultJogAdditive_Female;                         // 0x14C90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       JogAdditiveBS;                                     // 0x14C98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       JogAdditiveRelaxedBS;                              // 0x14CA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       JogAdditiveRelaxedLvl2BS;                          // 0x14CA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultSprint_Male;                                // 0x14CB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultSprint_Female;                              // 0x14CB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         SprintAnim;                                        // 0x14CC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldApplyAimOffsetToFullBody;                    // 0x14CC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2671[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FullBodyAimOffsetAlpha;                            // 0x14CCC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogPrePivotTimer;                                  // 0x14CD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TargetingToNonTargBlendTime;                       // 0x14CD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldBypassFullbodyInPlace;                       // 0x14CD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2672[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RightArmMaskWeight;                                // 0x14CDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TempIsRelaxedLevel1;                               // 0x14CE0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2673[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SprintAccelDotVelocity;                            // 0x14CE4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SprintAccelDotVelocityLastFrame;                   // 0x14CE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RightHandIKAlpha;                                  // 0x14CEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LeftHandIKAlpha;                                   // 0x14CF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LeftArmMaskBlendWeight;                            // 0x14CF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                 Fortnite_Player_Athena;                            // 0x14CF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsSkydiveStrafing;                                 // 0x14D00(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsGliding;                                         // 0x14D01(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsDiving;                                          // 0x14D02(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsParachuteOpen;                                   // 0x14D03(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsSkydiving;                                       // 0x14D04(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2674[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ForwardBack;                                       // 0x14D08(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Parachute_LeftRight;                               // 0x14D0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsSkydiveLeaning;                                  // 0x14D10(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2675[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FootIKAlpha;                                       // 0x14D14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsCrouching;                                       // 0x14D18(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsCrouchSprinting;                                 // 0x14D19(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2676[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CrouchingLowerBodyMaskWeight;                      // 0x14D1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HACKAimYawOffset;                                  // 0x14D20(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AuthoredCrouchJogSpeed;                            // 0x14D24(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AuthoredCrouchSprintSpeed;                         // 0x14D28(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CrouchSpeedWarpingAlpha;                           // 0x14D2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CrouchPlayRate;                                    // 0x14D30(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CrouchSpeedWarpingAmount;                          // 0x14D34(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultCrouchUpperBodyPose_Male;                   // 0x14D38(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultCrouchUpperBodyPose_Female;                 // 0x14D40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                           DefaultCrouchJogAdditive_Male;                     // 0x14D48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                           DefaultCrouchJogAdditive_Female;                   // 0x14D50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultCrouchSprint_Male;                          // 0x14D58(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         DefaultCrouchSprint_Female;                        // 0x14D60(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         CrouchUpperBodyPose_Targeted;                      // 0x14D68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         CrouchUpperBodyPose_NonTargeted;                   // 0x14D70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         CrouchUpperBodyPose_Relaxed;                       // 0x14D78(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       CrouchJogAdditiveBS;                               // 0x14D80(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       CrouchJogAdditiveRelaxedBS;                        // 0x14D88(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         CrouchSprintAnim;                                  // 0x14D90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             JogSpeedWarpingLimits;                             // 0x14D98(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             JogSpeedWarpingAddlRateScale;                      // 0x14DA0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             CrouchSpeedWarpingAddlRateScale;                   // 0x14DA8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AthenaAim;                                         // 0x14DB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2677[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HACKAimPitchOffset;                                // 0x14DB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                       CrouchWalkAdditiveBS;                              // 0x14DB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                           DefaultCrouchWalkAdditive;                         // 0x14DC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AuthoredCrouchWalkSpeed;                           // 0x14DC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CrouchBlendWeight;                                 // 0x14DCC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ParachuteLeanTransition;                           // 0x14DD0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class EDirection                        Direction;                                         // 0x14DD1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsParachuteLeaning;                                // 0x14DD2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2678[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SkyDive_LeftRight;                                 // 0x14DD4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Parachute_ForwardBack;                             // 0x14DD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2679[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DirectionCurrent;                                  // 0x14DE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                        LeftRight;                                         // 0x14DF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsUsingUmbrella;                                   // 0x14DF4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_267A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBlendSpace1D*                         LeanAdditive;                                      // 0x14DF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDBNO;                                            // 0x14E00(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_267B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DBNO_Shuffle_Threshold;                            // 0x14E04(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsSkydivingLaunchPad;                              // 0x14E08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         CanEnterLaunchPadSkydive;                          // 0x14E09(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_267C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UpDown;                                            // 0x14E0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ELaunchPad_Transition             LaunchPad_Anim;                                    // 0x14E10(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_267D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LaunchPad_Random_Int;                              // 0x14E14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalVelocityZ;                                    // 0x14E18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DeployChuteAnimRate;                               // 0x14E1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Fortnite_M_Avg_Player_AnimBlueprint_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_TwoBoneIK_167235F84D5A17FC342E738C239E417E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_TwoBoneIK_80EBD977446C9F5DE2B4EF911D08E2DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_TwoBoneIK_43F5C77D4E5801A4749197924FC84777();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_AnimBlueprint_AnimGraphNode_TwoBoneIK_610F7B56472AA73B1B2D9281CAFE23DF();
