#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x179C (0x1C3C - 0x4A0)
// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C
class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4A0(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD; // 0x4A8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE8; // 0x4F0(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16; // 0x570(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C38; // 0x5E0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_05C01B274E6CFFEB43237F82185270F4; // 0x628(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B28; // 0x698(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_16C670594F63485CBAD87ABDF4800661; // 0x6E0(0xD8)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_646F5CD042D0A5ED4317CA9FB189AF7D; // 0x7B8(0xD0)()
	uint8                                        Pad_2689[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE7; // 0x890(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9767634C4FD80B5DCE5D27A2D3ECF55A; // 0x910(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C37; // 0x980(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0C3AB68A492CB3F60B259E99EE136048; // 0x9C8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B27; // 0xA38(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4CF53C32440BB605C95230936BD30C61; // 0xA80(0xD8)()
	uint8                                        Pad_268A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE6; // 0xB60(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_517B1D0249C8EC092C471DBB5DD36220; // 0xBE0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C36; // 0xC50(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26F17D274A4F783FBE1BA29144FD59C0; // 0xC98(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B26; // 0xD08(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_152F0BA4497936B543D683B268EB17F7; // 0xD50(0xD8)()
	uint8                                        Pad_268B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE5; // 0xE30(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_06673EFA4BA843B43D3D76986132A086; // 0xEB0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C35; // 0xF20(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1FF88FC743D30AC2123949A47B704E48; // 0xF68(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B25; // 0xFD8(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA; // 0x1020(0xD8)()
	uint8                                        Pad_268C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE4; // 0x1100(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97; // 0x1180(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C34; // 0x11F0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37AC3FC042AD93F524BC0EB3B9D366CE; // 0x1238(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B24; // 0x12A8(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4797E15545A1D285BFB1C498264BFE5F; // 0x12F0(0xD8)()
	uint8                                        Pad_268D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE3; // 0x13D0(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_60AE7A614B28484E515FE4AD9926EBAF; // 0x1450(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C33; // 0x14C0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_027C00EF4B400C53991ED7BEE9CF57E2; // 0x1508(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B23; // 0x1578(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE; // 0x15C0(0xD8)()
	uint8                                        Pad_268E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE2; // 0x16A0(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21E547B847DA11586F2069B996B02230; // 0x1720(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C32; // 0x1790(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4; // 0x17D8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B22; // 0x1848(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_0DCD441046567AE3F7CEC1A384822795; // 0x1890(0xD8)()
	uint8                                        Pad_268F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE; // 0x1970(0x80)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_00C62FC3461975826AB7E88483FB7F99; // 0x19F0(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_951E9B3D4F1C41FA19C1348CDF1A46C3; // 0x1A60(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5; // 0x1AA8(0x70)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9DA1AEC64472F45AA7CBECA9AC0600B2; // 0x1B18(0x48)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_722C2AEE4FDCBF942D1588973096C898; // 0x1B60(0xD8)()
	int32                                        ClassNameInt;                                      // 0x1C38(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Fortnite_M_Avg_Player_MenusScreen_AnimBP_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_BlendListByInt_646F5CD042D0A5ED4317CA9FB189AF7D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE_4();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP(int32 EntryPoint, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue2, bool CallFunc_Less_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue2, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue3, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue4, bool CallFunc_Less_FloatFloat_ReturnValue3, bool CallFunc_Less_FloatFloat_ReturnValue4, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue5, bool CallFunc_Less_FloatFloat_ReturnValue5, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue6, bool CallFunc_Less_FloatFloat_ReturnValue6, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue7, bool CallFunc_Less_FloatFloat_ReturnValue7, float CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue8, bool CallFunc_Less_FloatFloat_ReturnValue8, float K2Node_Event_DeltaTimeX);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
