#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10C0 (0x10C0 - 0x0)
// Function GamepadMappingInfo.GamepadMappingInfo_C.HandleConfigChanged
struct UGamepadMappingInfo_C_HandleConfigChanged_Params
{
public:
	int32                                        Mode;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Config;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_SwitchInteger_CmpSuccess;                   // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0xA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable2;                               // 0xB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                        Temp_int_Variable;                                 // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable;                                // 0x10(0x18)()
	class FText                                  Temp_text_Variable2;                               // 0x28(0x18)()
	int32                                        Temp_int_Variable2;                                // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_280B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0x48(0x18)()
	class FText                                  Temp_text_Variable3;                               // 0x60(0x18)()
	class FText                                  Temp_text_Variable4;                               // 0x78(0x18)()
	bool                                         Temp_bool_Variable2;                               // 0x90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_280C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select2_Default;                            // 0x98(0x18)()
	enum class ESlateVisibility                  Temp_byte_Variable3;                               // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable4;                               // 0xB1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable3;                               // 0xB2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable5;                               // 0xB3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable6;                               // 0xB4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable4;                               // 0xB5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable7;                               // 0xB6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable8;                               // 0xB7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable5;                               // 0xB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable9;                               // 0xB9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable10;                              // 0xBA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_280D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable3;                                // 0xBC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable5;                               // 0xC0(0x18)()
	class FText                                  Temp_text_Variable6;                               // 0xD8(0x18)()
	int32                                        Temp_int_Variable4;                                // 0xF0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_280E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select3_Default;                            // 0xF8(0x18)()
	class FText                                  Temp_text_Variable7;                               // 0x110(0x18)()
	class FText                                  Temp_text_Variable8;                               // 0x128(0x18)()
	int32                                        Temp_int_Variable5;                                // 0x140(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_280F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select4_Default;                            // 0x148(0x18)()
	class FText                                  Temp_text_Variable9;                               // 0x160(0x18)()
	class FText                                  Temp_text_Variable10;                              // 0x178(0x18)()
	int32                                        Temp_int_Variable6;                                // 0x190(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2810[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select5_Default;                            // 0x198(0x18)()
	class FText                                  Temp_text_Variable11;                              // 0x1B0(0x18)()
	class FText                                  Temp_text_Variable12;                              // 0x1C8(0x18)()
	int32                                        Temp_int_Variable7;                                // 0x1E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2811[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select6_Default;                            // 0x1E8(0x18)()
	class FText                                  Temp_text_Variable13;                              // 0x200(0x18)()
	class FText                                  Temp_text_Variable14;                              // 0x218(0x18)()
	int32                                        Temp_int_Variable8;                                // 0x230(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2812[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select7_Default;                            // 0x238(0x18)()
	class FText                                  Temp_text_Variable15;                              // 0x250(0x18)()
	class FText                                  Temp_text_Variable16;                              // 0x268(0x18)()
	int32                                        Temp_int_Variable9;                                // 0x280(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2813[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select8_Default;                            // 0x288(0x18)()
	class FText                                  Temp_text_Variable17;                              // 0x2A0(0x18)()
	class FText                                  Temp_text_Variable18;                              // 0x2B8(0x18)()
	int32                                        Temp_int_Variable10;                               // 0x2D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2814[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select9_Default;                            // 0x2D8(0x18)()
	class FText                                  Temp_text_Variable19;                              // 0x2F0(0x18)()
	class FText                                  Temp_text_Variable20;                              // 0x308(0x18)()
	int32                                        Temp_int_Variable11;                               // 0x320(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2815[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select10_Default;                           // 0x328(0x18)()
	class FText                                  Temp_text_Variable21;                              // 0x340(0x18)()
	class FText                                  Temp_text_Variable22;                              // 0x358(0x18)()
	int32                                        Temp_int_Variable12;                               // 0x370(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2816[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select11_Default;                           // 0x378(0x18)()
	class FText                                  Temp_text_Variable23;                              // 0x390(0x18)()
	class FText                                  Temp_text_Variable24;                              // 0x3A8(0x18)()
	int32                                        Temp_int_Variable13;                               // 0x3C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2817[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select12_Default;                           // 0x3C8(0x18)()
	class FText                                  Temp_text_Variable25;                              // 0x3E0(0x18)()
	class FText                                  Temp_text_Variable26;                              // 0x3F8(0x18)()
	int32                                        Temp_int_Variable14;                               // 0x410(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2818[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select13_Default;                           // 0x418(0x18)()
	class FText                                  Temp_text_Variable27;                              // 0x430(0x18)()
	class FText                                  Temp_text_Variable28;                              // 0x448(0x18)()
	int32                                        Temp_int_Variable15;                               // 0x460(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2819[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select14_Default;                           // 0x468(0x18)()
	class FText                                  Temp_text_Variable29;                              // 0x480(0x18)()
	class FText                                  Temp_text_Variable30;                              // 0x498(0x18)()
	int32                                        Temp_int_Variable16;                               // 0x4B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_281A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select15_Default;                           // 0x4B8(0x18)()
	class FText                                  Temp_text_Variable31;                              // 0x4D0(0x18)()
	class FText                                  Temp_text_Variable32;                              // 0x4E8(0x18)()
	int32                                        Temp_int_Variable17;                               // 0x500(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_281B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select16_Default;                           // 0x508(0x18)()
	class FText                                  Temp_text_Variable33;                              // 0x520(0x18)()
	class FText                                  Temp_text_Variable34;                              // 0x538(0x18)()
	int32                                        Temp_int_Variable18;                               // 0x550(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_281C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select17_Default;                           // 0x558(0x18)()
	class FText                                  Temp_text_Variable35;                              // 0x570(0x18)()
	class FText                                  Temp_text_Variable36;                              // 0x588(0x18)()
	int32                                        Temp_int_Variable19;                               // 0x5A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_281D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select18_Default;                           // 0x5A8(0x18)()
	class FText                                  Temp_text_Variable37;                              // 0x5C0(0x18)()
	class FText                                  Temp_text_Variable38;                              // 0x5D8(0x18)()
	int32                                        Temp_int_Variable20;                               // 0x5F0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_281E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select19_Default;                           // 0x5F8(0x18)()
	class FText                                  Temp_text_Variable39;                              // 0x610(0x18)()
	class FText                                  Temp_text_Variable40;                              // 0x628(0x18)()
	int32                                        Temp_int_Variable21;                               // 0x640(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_281F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select20_Default;                           // 0x648(0x18)()
	class FText                                  Temp_text_Variable41;                              // 0x660(0x18)()
	class FText                                  Temp_text_Variable42;                              // 0x678(0x18)()
	int32                                        Temp_int_Variable22;                               // 0x690(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2820[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select21_Default;                           // 0x698(0x18)()
	class FText                                  Temp_text_Variable43;                              // 0x6B0(0x18)()
	class FText                                  Temp_text_Variable44;                              // 0x6C8(0x18)()
	int32                                        Temp_int_Variable23;                               // 0x6E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2821[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select22_Default;                           // 0x6E8(0x18)()
	class FText                                  Temp_text_Variable45;                              // 0x700(0x18)()
	class FText                                  Temp_text_Variable46;                              // 0x718(0x18)()
	int32                                        Temp_int_Variable24;                               // 0x730(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2822[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select23_Default;                           // 0x738(0x18)()
	class FText                                  Temp_text_Variable47;                              // 0x750(0x18)()
	class FText                                  Temp_text_Variable48;                              // 0x768(0x18)()
	int32                                        Temp_int_Variable25;                               // 0x780(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2823[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select24_Default;                           // 0x788(0x18)()
	class FText                                  Temp_text_Variable49;                              // 0x7A0(0x18)()
	class FText                                  Temp_text_Variable50;                              // 0x7B8(0x18)()
	int32                                        Temp_int_Variable26;                               // 0x7D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2824[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select25_Default;                           // 0x7D8(0x18)()
	class FText                                  Temp_text_Variable51;                              // 0x7F0(0x18)()
	class FText                                  Temp_text_Variable52;                              // 0x808(0x18)()
	int32                                        Temp_int_Variable27;                               // 0x820(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2825[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select26_Default;                           // 0x828(0x18)()
	class FText                                  Temp_text_Variable53;                              // 0x840(0x18)()
	class FText                                  Temp_text_Variable54;                              // 0x858(0x18)()
	int32                                        Temp_int_Variable28;                               // 0x870(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2826[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select27_Default;                           // 0x878(0x18)()
	class FText                                  Temp_text_Variable55;                              // 0x890(0x18)()
	class FText                                  Temp_text_Variable56;                              // 0x8A8(0x18)()
	int32                                        Temp_int_Variable29;                               // 0x8C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2827[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select28_Default;                           // 0x8C8(0x18)()
	class FText                                  Temp_text_Variable57;                              // 0x8E0(0x18)()
	class FText                                  Temp_text_Variable58;                              // 0x8F8(0x18)()
	int32                                        Temp_int_Variable30;                               // 0x910(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2828[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select29_Default;                           // 0x918(0x18)()
	class FText                                  Temp_text_Variable59;                              // 0x930(0x18)()
	class FText                                  Temp_text_Variable60;                              // 0x948(0x18)()
	int32                                        Temp_int_Variable31;                               // 0x960(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2829[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select30_Default;                           // 0x968(0x18)()
	class FText                                  Temp_text_Variable61;                              // 0x980(0x18)()
	class FText                                  Temp_text_Variable62;                              // 0x998(0x18)()
	int32                                        Temp_int_Variable32;                               // 0x9B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_282A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select31_Default;                           // 0x9B8(0x18)()
	class FText                                  Temp_text_Variable63;                              // 0x9D0(0x18)()
	class FText                                  Temp_text_Variable64;                              // 0x9E8(0x18)()
	int32                                        Temp_int_Variable33;                               // 0xA00(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_282B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select32_Default;                           // 0xA08(0x18)()
	class FText                                  Temp_text_Variable65;                              // 0xA20(0x18)()
	class FText                                  Temp_text_Variable66;                              // 0xA38(0x18)()
	int32                                        Temp_int_Variable34;                               // 0xA50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_282C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select33_Default;                           // 0xA58(0x18)()
	class FText                                  Temp_text_Variable67;                              // 0xA70(0x18)()
	class FText                                  Temp_text_Variable68;                              // 0xA88(0x18)()
	int32                                        Temp_int_Variable35;                               // 0xAA0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_282D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select34_Default;                           // 0xAA8(0x18)()
	class FText                                  Temp_text_Variable69;                              // 0xAC0(0x18)()
	class FText                                  Temp_text_Variable70;                              // 0xAD8(0x18)()
	int32                                        Temp_int_Variable36;                               // 0xAF0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_282E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select35_Default;                           // 0xAF8(0x18)()
	class FText                                  Temp_text_Variable71;                              // 0xB10(0x18)()
	class FText                                  Temp_text_Variable72;                              // 0xB28(0x18)()
	int32                                        Temp_int_Variable37;                               // 0xB40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_282F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select36_Default;                           // 0xB48(0x18)()
	class FText                                  Temp_text_Variable73;                              // 0xB60(0x18)()
	class FText                                  Temp_text_Variable74;                              // 0xB78(0x18)()
	int32                                        Temp_int_Variable38;                               // 0xB90(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2830[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select37_Default;                           // 0xB98(0x18)()
	class FText                                  Temp_text_Variable75;                              // 0xBB0(0x18)()
	class FText                                  Temp_text_Variable76;                              // 0xBC8(0x18)()
	int32                                        Temp_int_Variable39;                               // 0xBE0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2831[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select38_Default;                           // 0xBE8(0x18)()
	class FText                                  Temp_text_Variable77;                              // 0xC00(0x18)()
	class FText                                  Temp_text_Variable78;                              // 0xC18(0x18)()
	int32                                        Temp_int_Variable40;                               // 0xC30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2832[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select39_Default;                           // 0xC38(0x18)()
	class FText                                  Temp_text_Variable79;                              // 0xC50(0x18)()
	class FText                                  Temp_text_Variable80;                              // 0xC68(0x18)()
	int32                                        Temp_int_Variable41;                               // 0xC80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2833[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select40_Default;                           // 0xC88(0x18)()
	class FText                                  Temp_text_Variable81;                              // 0xCA0(0x18)()
	class FText                                  Temp_text_Variable82;                              // 0xCB8(0x18)()
	int32                                        Temp_int_Variable42;                               // 0xCD0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2834[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select41_Default;                           // 0xCD8(0x18)()
	class FText                                  Temp_text_Variable83;                              // 0xCF0(0x18)()
	class FText                                  Temp_text_Variable84;                              // 0xD08(0x18)()
	int32                                        Temp_int_Variable43;                               // 0xD20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2835[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select42_Default;                           // 0xD28(0x18)()
	class FText                                  Temp_text_Variable85;                              // 0xD40(0x18)()
	class FText                                  Temp_text_Variable86;                              // 0xD58(0x18)()
	int32                                        Temp_int_Variable44;                               // 0xD70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2836[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select43_Default;                           // 0xD78(0x18)()
	class FText                                  Temp_text_Variable87;                              // 0xD90(0x18)()
	class FText                                  Temp_text_Variable88;                              // 0xDA8(0x18)()
	int32                                        Temp_int_Variable45;                               // 0xDC0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2837[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select44_Default;                           // 0xDC8(0x18)()
	class FText                                  Temp_text_Variable89;                              // 0xDE0(0x18)()
	class FText                                  Temp_text_Variable90;                              // 0xDF8(0x18)()
	int32                                        Temp_int_Variable46;                               // 0xE10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2838[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select45_Default;                           // 0xE18(0x18)()
	class FText                                  Temp_text_Variable91;                              // 0xE30(0x18)()
	class FText                                  Temp_text_Variable92;                              // 0xE48(0x18)()
	int32                                        Temp_int_Variable47;                               // 0xE60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2839[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select46_Default;                           // 0xE68(0x18)()
	class FText                                  Temp_text_Variable93;                              // 0xE80(0x18)()
	class FText                                  Temp_text_Variable94;                              // 0xE98(0x18)()
	int32                                        Temp_int_Variable48;                               // 0xEB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_283A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select47_Default;                           // 0xEB8(0x18)()
	class FText                                  Temp_text_Variable95;                              // 0xED0(0x18)()
	class FText                                  Temp_text_Variable96;                              // 0xEE8(0x18)()
	int32                                        Temp_int_Variable49;                               // 0xF00(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_283B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select48_Default;                           // 0xF08(0x18)()
	class FText                                  Temp_text_Variable97;                              // 0xF20(0x18)()
	class FText                                  Temp_text_Variable98;                              // 0xF38(0x18)()
	class FText                                  K2Node_Select49_Default;                           // 0xF50(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0xF68(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue;                      // 0xF80(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue;          // 0xF98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select50_Default;                           // 0xF99(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_283C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue2;             // 0xFA0(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue3;             // 0xFB8(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue4;             // 0xFD0(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue5;             // 0xFE8(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue2;                     // 0x1000(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue3;                     // 0x1018(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue2;         // 0x1030(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue3;         // 0x1031(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select51_Default;                           // 0x1032(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select52_Default;                           // 0x1033(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_283D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_GetText_ReturnValue4;                     // 0x1038(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue5;                     // 0x1050(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue4;         // 0x1068(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue5;         // 0x1069(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select53_Default;                           // 0x106A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select54_Default;                           // 0x106B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_283E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable99;                              // 0x1070(0x18)()
	class FText                                  Temp_text_Variable100;                             // 0x1088(0x18)()
	int32                                        Temp_int_Variable50;                               // 0x10A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_283F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select55_Default;                           // 0x10A8(0x18)()
};

// 0x1580 (0x1580 - 0x0)
// Function GamepadMappingInfo.GamepadMappingInfo_C.HandleConfigChanged_Athena
struct UGamepadMappingInfo_C_HandleConfigChanged_Athena_Params
{
public:
	int32                                        Mode;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Config;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable;                                 // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchInteger_CmpSuccess;                   // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2840[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x10(0x18)()
	class FText                                  Temp_text_Variable2;                               // 0x28(0x18)()
	bool                                         Temp_bool_Variable;                                // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2841[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0x48(0x18)()
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable2;                               // 0x61(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2842[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable2;                                // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable3;                               // 0x68(0x18)()
	class FText                                  Temp_text_Variable4;                               // 0x80(0x18)()
	class FText                                  Temp_text_Variable5;                               // 0x98(0x18)()
	int32                                        Temp_int_Variable3;                                // 0xB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2843[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select2_Default;                            // 0xB8(0x18)()
	class FText                                  Temp_text_Variable6;                               // 0xD0(0x18)()
	class FText                                  Temp_text_Variable7;                               // 0xE8(0x18)()
	class FText                                  Temp_text_Variable8;                               // 0x100(0x18)()
	bool                                         Temp_bool_Variable2;                               // 0x118(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable3;                               // 0x119(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2844[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select3_Default;                            // 0x120(0x18)()
	enum class ESlateVisibility                  Temp_byte_Variable4;                               // 0x138(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable3;                               // 0x139(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable5;                               // 0x13A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable6;                               // 0x13B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable4;                               // 0x13C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable7;                               // 0x13D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable8;                               // 0x13E(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable5;                               // 0x13F(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable9;                               // 0x140(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable10;                              // 0x141(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2845[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable4;                                // 0x144(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable9;                               // 0x148(0x18)()
	class FText                                  Temp_text_Variable10;                              // 0x160(0x18)()
	class FText                                  Temp_text_Variable11;                              // 0x178(0x18)()
	int32                                        Temp_int_Variable5;                                // 0x190(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2846[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select4_Default;                            // 0x198(0x18)()
	class FText                                  Temp_text_Variable12;                              // 0x1B0(0x18)()
	class FText                                  Temp_text_Variable13;                              // 0x1C8(0x18)()
	class FText                                  Temp_text_Variable14;                              // 0x1E0(0x18)()
	int32                                        Temp_int_Variable6;                                // 0x1F8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2847[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select5_Default;                            // 0x200(0x18)()
	class FText                                  Temp_text_Variable15;                              // 0x218(0x18)()
	class FText                                  Temp_text_Variable16;                              // 0x230(0x18)()
	class FText                                  Temp_text_Variable17;                              // 0x248(0x18)()
	int32                                        Temp_int_Variable7;                                // 0x260(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2848[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select6_Default;                            // 0x268(0x18)()
	class FText                                  Temp_text_Variable18;                              // 0x280(0x18)()
	class FText                                  Temp_text_Variable19;                              // 0x298(0x18)()
	class FText                                  Temp_text_Variable20;                              // 0x2B0(0x18)()
	int32                                        Temp_int_Variable8;                                // 0x2C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2849[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select7_Default;                            // 0x2D0(0x18)()
	class FText                                  Temp_text_Variable21;                              // 0x2E8(0x18)()
	class FText                                  Temp_text_Variable22;                              // 0x300(0x18)()
	class FText                                  Temp_text_Variable23;                              // 0x318(0x18)()
	int32                                        Temp_int_Variable9;                                // 0x330(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_284A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select8_Default;                            // 0x338(0x18)()
	class FText                                  Temp_text_Variable24;                              // 0x350(0x18)()
	class FText                                  Temp_text_Variable25;                              // 0x368(0x18)()
	class FText                                  Temp_text_Variable26;                              // 0x380(0x18)()
	int32                                        Temp_int_Variable10;                               // 0x398(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_284B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select9_Default;                            // 0x3A0(0x18)()
	class FText                                  Temp_text_Variable27;                              // 0x3B8(0x18)()
	class FText                                  Temp_text_Variable28;                              // 0x3D0(0x18)()
	class FText                                  Temp_text_Variable29;                              // 0x3E8(0x18)()
	int32                                        Temp_int_Variable11;                               // 0x400(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_284C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select10_Default;                           // 0x408(0x18)()
	class FText                                  Temp_text_Variable30;                              // 0x420(0x18)()
	class FText                                  Temp_text_Variable31;                              // 0x438(0x18)()
	class FText                                  Temp_text_Variable32;                              // 0x450(0x18)()
	int32                                        Temp_int_Variable12;                               // 0x468(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_284D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select11_Default;                           // 0x470(0x18)()
	class FText                                  Temp_text_Variable33;                              // 0x488(0x18)()
	class FText                                  Temp_text_Variable34;                              // 0x4A0(0x18)()
	class FText                                  Temp_text_Variable35;                              // 0x4B8(0x18)()
	int32                                        Temp_int_Variable13;                               // 0x4D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_284E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select12_Default;                           // 0x4D8(0x18)()
	class FText                                  Temp_text_Variable36;                              // 0x4F0(0x18)()
	class FText                                  Temp_text_Variable37;                              // 0x508(0x18)()
	class FText                                  Temp_text_Variable38;                              // 0x520(0x18)()
	int32                                        Temp_int_Variable14;                               // 0x538(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_284F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select13_Default;                           // 0x540(0x18)()
	class FText                                  Temp_text_Variable39;                              // 0x558(0x18)()
	class FText                                  Temp_text_Variable40;                              // 0x570(0x18)()
	class FText                                  Temp_text_Variable41;                              // 0x588(0x18)()
	int32                                        Temp_int_Variable15;                               // 0x5A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2850[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select14_Default;                           // 0x5A8(0x18)()
	class FText                                  Temp_text_Variable42;                              // 0x5C0(0x18)()
	class FText                                  Temp_text_Variable43;                              // 0x5D8(0x18)()
	class FText                                  Temp_text_Variable44;                              // 0x5F0(0x18)()
	int32                                        Temp_int_Variable16;                               // 0x608(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2851[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select15_Default;                           // 0x610(0x18)()
	class FText                                  Temp_text_Variable45;                              // 0x628(0x18)()
	class FText                                  Temp_text_Variable46;                              // 0x640(0x18)()
	class FText                                  Temp_text_Variable47;                              // 0x658(0x18)()
	int32                                        Temp_int_Variable17;                               // 0x670(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2852[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select16_Default;                           // 0x678(0x18)()
	class FText                                  Temp_text_Variable48;                              // 0x690(0x18)()
	class FText                                  Temp_text_Variable49;                              // 0x6A8(0x18)()
	class FText                                  Temp_text_Variable50;                              // 0x6C0(0x18)()
	int32                                        Temp_int_Variable18;                               // 0x6D8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2853[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select17_Default;                           // 0x6E0(0x18)()
	class FText                                  Temp_text_Variable51;                              // 0x6F8(0x18)()
	class FText                                  Temp_text_Variable52;                              // 0x710(0x18)()
	class FText                                  Temp_text_Variable53;                              // 0x728(0x18)()
	int32                                        Temp_int_Variable19;                               // 0x740(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2854[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select18_Default;                           // 0x748(0x18)()
	class FText                                  Temp_text_Variable54;                              // 0x760(0x18)()
	class FText                                  Temp_text_Variable55;                              // 0x778(0x18)()
	class FText                                  Temp_text_Variable56;                              // 0x790(0x18)()
	int32                                        Temp_int_Variable20;                               // 0x7A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2855[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select19_Default;                           // 0x7B0(0x18)()
	class FText                                  Temp_text_Variable57;                              // 0x7C8(0x18)()
	class FText                                  Temp_text_Variable58;                              // 0x7E0(0x18)()
	class FText                                  Temp_text_Variable59;                              // 0x7F8(0x18)()
	int32                                        Temp_int_Variable21;                               // 0x810(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2856[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select20_Default;                           // 0x818(0x18)()
	class FText                                  Temp_text_Variable60;                              // 0x830(0x18)()
	class FText                                  Temp_text_Variable61;                              // 0x848(0x18)()
	class FText                                  Temp_text_Variable62;                              // 0x860(0x18)()
	int32                                        Temp_int_Variable22;                               // 0x878(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2857[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select21_Default;                           // 0x880(0x18)()
	class FText                                  Temp_text_Variable63;                              // 0x898(0x18)()
	class FText                                  Temp_text_Variable64;                              // 0x8B0(0x18)()
	class FText                                  Temp_text_Variable65;                              // 0x8C8(0x18)()
	int32                                        Temp_int_Variable23;                               // 0x8E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2858[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select22_Default;                           // 0x8E8(0x18)()
	class FText                                  Temp_text_Variable66;                              // 0x900(0x18)()
	class FText                                  Temp_text_Variable67;                              // 0x918(0x18)()
	class FText                                  Temp_text_Variable68;                              // 0x930(0x18)()
	int32                                        Temp_int_Variable24;                               // 0x948(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2859[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select23_Default;                           // 0x950(0x18)()
	class FText                                  Temp_text_Variable69;                              // 0x968(0x18)()
	class FText                                  Temp_text_Variable70;                              // 0x980(0x18)()
	class FText                                  Temp_text_Variable71;                              // 0x998(0x18)()
	int32                                        Temp_int_Variable25;                               // 0x9B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_285A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select24_Default;                           // 0x9B8(0x18)()
	class FText                                  Temp_text_Variable72;                              // 0x9D0(0x18)()
	class FText                                  Temp_text_Variable73;                              // 0x9E8(0x18)()
	class FText                                  Temp_text_Variable74;                              // 0xA00(0x18)()
	int32                                        Temp_int_Variable26;                               // 0xA18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_285B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select25_Default;                           // 0xA20(0x18)()
	class FText                                  Temp_text_Variable75;                              // 0xA38(0x18)()
	class FText                                  Temp_text_Variable76;                              // 0xA50(0x18)()
	class FText                                  Temp_text_Variable77;                              // 0xA68(0x18)()
	int32                                        Temp_int_Variable27;                               // 0xA80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_285C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select26_Default;                           // 0xA88(0x18)()
	class FText                                  Temp_text_Variable78;                              // 0xAA0(0x18)()
	class FText                                  Temp_text_Variable79;                              // 0xAB8(0x18)()
	class FText                                  Temp_text_Variable80;                              // 0xAD0(0x18)()
	int32                                        Temp_int_Variable28;                               // 0xAE8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_285D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select27_Default;                           // 0xAF0(0x18)()
	class FText                                  Temp_text_Variable81;                              // 0xB08(0x18)()
	class FText                                  Temp_text_Variable82;                              // 0xB20(0x18)()
	class FText                                  Temp_text_Variable83;                              // 0xB38(0x18)()
	int32                                        Temp_int_Variable29;                               // 0xB50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_285E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select28_Default;                           // 0xB58(0x18)()
	class FText                                  Temp_text_Variable84;                              // 0xB70(0x18)()
	class FText                                  Temp_text_Variable85;                              // 0xB88(0x18)()
	int32                                        Temp_int_Variable30;                               // 0xBA0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_285F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select29_Default;                           // 0xBA8(0x18)()
	class FText                                  Temp_text_Variable86;                              // 0xBC0(0x18)()
	class FText                                  Temp_text_Variable87;                              // 0xBD8(0x18)()
	class FText                                  Temp_text_Variable88;                              // 0xBF0(0x18)()
	int32                                        Temp_int_Variable31;                               // 0xC08(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2860[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select30_Default;                           // 0xC10(0x18)()
	class FText                                  Temp_text_Variable89;                              // 0xC28(0x18)()
	class FText                                  Temp_text_Variable90;                              // 0xC40(0x18)()
	class FText                                  Temp_text_Variable91;                              // 0xC58(0x18)()
	int32                                        Temp_int_Variable32;                               // 0xC70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2861[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select31_Default;                           // 0xC78(0x18)()
	class FText                                  Temp_text_Variable92;                              // 0xC90(0x18)()
	class FText                                  Temp_text_Variable93;                              // 0xCA8(0x18)()
	class FText                                  Temp_text_Variable94;                              // 0xCC0(0x18)()
	int32                                        Temp_int_Variable33;                               // 0xCD8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2862[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select32_Default;                           // 0xCE0(0x18)()
	class FText                                  Temp_text_Variable95;                              // 0xCF8(0x18)()
	class FText                                  Temp_text_Variable96;                              // 0xD10(0x18)()
	class FText                                  Temp_text_Variable97;                              // 0xD28(0x18)()
	int32                                        Temp_int_Variable34;                               // 0xD40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2863[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select33_Default;                           // 0xD48(0x18)()
	class FText                                  Temp_text_Variable98;                              // 0xD60(0x18)()
	class FText                                  Temp_text_Variable99;                              // 0xD78(0x18)()
	class FText                                  Temp_text_Variable100;                             // 0xD90(0x18)()
	int32                                        Temp_int_Variable35;                               // 0xDA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2864[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select34_Default;                           // 0xDB0(0x18)()
	class FText                                  Temp_text_Variable101;                             // 0xDC8(0x18)()
	class FText                                  Temp_text_Variable102;                             // 0xDE0(0x18)()
	class FText                                  Temp_text_Variable103;                             // 0xDF8(0x18)()
	int32                                        Temp_int_Variable36;                               // 0xE10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2865[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select35_Default;                           // 0xE18(0x18)()
	class FText                                  Temp_text_Variable104;                             // 0xE30(0x18)()
	class FText                                  Temp_text_Variable105;                             // 0xE48(0x18)()
	class FText                                  Temp_text_Variable106;                             // 0xE60(0x18)()
	int32                                        Temp_int_Variable37;                               // 0xE78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2866[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select36_Default;                           // 0xE80(0x18)()
	class FText                                  Temp_text_Variable107;                             // 0xE98(0x18)()
	class FText                                  Temp_text_Variable108;                             // 0xEB0(0x18)()
	class FText                                  Temp_text_Variable109;                             // 0xEC8(0x18)()
	int32                                        Temp_int_Variable38;                               // 0xEE0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2867[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select37_Default;                           // 0xEE8(0x18)()
	class FText                                  Temp_text_Variable110;                             // 0xF00(0x18)()
	class FText                                  Temp_text_Variable111;                             // 0xF18(0x18)()
	class FText                                  Temp_text_Variable112;                             // 0xF30(0x18)()
	int32                                        Temp_int_Variable39;                               // 0xF48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2868[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select38_Default;                           // 0xF50(0x18)()
	class FText                                  Temp_text_Variable113;                             // 0xF68(0x18)()
	class FText                                  Temp_text_Variable114;                             // 0xF80(0x18)()
	class FText                                  Temp_text_Variable115;                             // 0xF98(0x18)()
	int32                                        Temp_int_Variable40;                               // 0xFB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2869[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select39_Default;                           // 0xFB8(0x18)()
	class FText                                  Temp_text_Variable116;                             // 0xFD0(0x18)()
	class FText                                  Temp_text_Variable117;                             // 0xFE8(0x18)()
	class FText                                  Temp_text_Variable118;                             // 0x1000(0x18)()
	int32                                        Temp_int_Variable41;                               // 0x1018(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_286A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select40_Default;                           // 0x1020(0x18)()
	class FText                                  Temp_text_Variable119;                             // 0x1038(0x18)()
	class FText                                  Temp_text_Variable120;                             // 0x1050(0x18)()
	class FText                                  Temp_text_Variable121;                             // 0x1068(0x18)()
	int32                                        Temp_int_Variable42;                               // 0x1080(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_286B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select41_Default;                           // 0x1088(0x18)()
	class FText                                  Temp_text_Variable122;                             // 0x10A0(0x18)()
	class FText                                  Temp_text_Variable123;                             // 0x10B8(0x18)()
	class FText                                  Temp_text_Variable124;                             // 0x10D0(0x18)()
	int32                                        Temp_int_Variable43;                               // 0x10E8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_286C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select42_Default;                           // 0x10F0(0x18)()
	class FText                                  Temp_text_Variable125;                             // 0x1108(0x18)()
	class FText                                  Temp_text_Variable126;                             // 0x1120(0x18)()
	class FText                                  Temp_text_Variable127;                             // 0x1138(0x18)()
	int32                                        Temp_int_Variable44;                               // 0x1150(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_286D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select43_Default;                           // 0x1158(0x18)()
	class FText                                  Temp_text_Variable128;                             // 0x1170(0x18)()
	class FText                                  Temp_text_Variable129;                             // 0x1188(0x18)()
	class FText                                  Temp_text_Variable130;                             // 0x11A0(0x18)()
	int32                                        Temp_int_Variable45;                               // 0x11B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_286E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select44_Default;                           // 0x11C0(0x18)()
	class FText                                  Temp_text_Variable131;                             // 0x11D8(0x18)()
	class FText                                  Temp_text_Variable132;                             // 0x11F0(0x18)()
	class FText                                  Temp_text_Variable133;                             // 0x1208(0x18)()
	int32                                        Temp_int_Variable46;                               // 0x1220(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_286F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select45_Default;                           // 0x1228(0x18)()
	class FText                                  Temp_text_Variable134;                             // 0x1240(0x18)()
	class FText                                  Temp_text_Variable135;                             // 0x1258(0x18)()
	class FText                                  Temp_text_Variable136;                             // 0x1270(0x18)()
	int32                                        Temp_int_Variable47;                               // 0x1288(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2870[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select46_Default;                           // 0x1290(0x18)()
	class FText                                  Temp_text_Variable137;                             // 0x12A8(0x18)()
	class FText                                  Temp_text_Variable138;                             // 0x12C0(0x18)()
	class FText                                  Temp_text_Variable139;                             // 0x12D8(0x18)()
	int32                                        Temp_int_Variable48;                               // 0x12F0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2871[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select47_Default;                           // 0x12F8(0x18)()
	class FText                                  Temp_text_Variable140;                             // 0x1310(0x18)()
	class FText                                  Temp_text_Variable141;                             // 0x1328(0x18)()
	class FText                                  Temp_text_Variable142;                             // 0x1340(0x18)()
	int32                                        Temp_int_Variable49;                               // 0x1358(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2872[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select48_Default;                           // 0x1360(0x18)()
	class FText                                  Temp_text_Variable143;                             // 0x1378(0x18)()
	class FText                                  Temp_text_Variable144;                             // 0x1390(0x18)()
	class FText                                  Temp_text_Variable145;                             // 0x13A8(0x18)()
	int32                                        Temp_int_Variable50;                               // 0x13C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2873[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select49_Default;                           // 0x13C8(0x18)()
	class FText                                  Temp_text_Variable146;                             // 0x13E0(0x18)()
	class FText                                  Temp_text_Variable147;                             // 0x13F8(0x18)()
	class FText                                  Temp_text_Variable148;                             // 0x1410(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue;                      // 0x1428(0x18)()
	class FText                                  K2Node_Select50_Default;                           // 0x1440(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x1458(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue;          // 0x1470(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2874[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue2;             // 0x1478(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue2;                     // 0x1490(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue2;         // 0x14A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select51_Default;                           // 0x14A9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2875[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue3;             // 0x14B0(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue4;             // 0x14C8(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue5;             // 0x14E0(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue6;             // 0x14F8(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue3;                     // 0x1510(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue4;                     // 0x1528(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue3;         // 0x1540(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue4;         // 0x1541(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select52_Default;                           // 0x1542(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select53_Default;                           // 0x1543(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2876[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_GetText_ReturnValue5;                     // 0x1548(0x18)()
	class FText                                  CallFunc_GetText_ReturnValue6;                     // 0x1560(0x18)()
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue5;         // 0x1578(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue6;         // 0x1579(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select54_Default;                           // 0x157A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select55_Default;                           // 0x157B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable11;                              // 0x157C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable12;                              // 0x157D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable6;                               // 0x157E(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select56_Default;                           // 0x157F(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x12 (0x12 - 0x0)
// Function GamepadMappingInfo.GamepadMappingInfo_C.OnConfigChanged
struct UGamepadMappingInfo_C_OnConfigChanged_Params
{
public:
	int32                                        Mode;                                              // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Config;                                            // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESubGame                          CallFunc_GetSubGame_ReturnValue;                   // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x11(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0xD0 (0xD0 - 0x0)
// Function GamepadMappingInfo.GamepadMappingInfo_C.Update Displayed Mapping
struct UGamepadMappingInfo_C_Update_Displayed_Mapping_Params
{
public:
	int32                                        Platform;                                          // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Mode;                                              // 0x4(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Configuration;                                     // 0x8(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2877[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            T_Mode_Combat;                                     // 0x10(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            T_Mode_Build;                                      // 0x18(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            T_PS4_Lines;                                       // 0x20(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            T_XboxOne_Lines;                                   // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            T_PS4;                                             // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            T_XboxOne;                                         // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable2;                               // 0x41(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2878[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable;                                 // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable3;                               // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable4;                               // 0x49(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2879[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable2;                                // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_287A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable3;                                // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable;                                // 0x58(0x18)()
	class FText                                  Temp_text_Variable2;                               // 0x70(0x18)()
	int32                                        Temp_int_Variable4;                                // 0x88(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_287B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select2_Default;                            // 0x90(0x18)()
	int32                                        Temp_int_Variable5;                                // 0xA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable6;                                // 0xAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            K2Node_Select3_Default;                            // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  K2Node_Select4_Default;                            // 0xB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_287C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            K2Node_Select5_Default;                            // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            K2Node_Select6_Default;                            // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
