#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x128 (0x360 - 0x238)
// WidgetBlueprintGeneratedClass GamepadMappingInfo.GamepadMappingInfo_C
class UGamepadMappingInfo_C : public UCommonUserWidget
{
public:
	class UImage*                                Image_Gamepad;                                     // 0x238(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Gamepad_Buttons;                             // 0x240(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Mode;                                        // 0x248(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Bottom;                   // 0x250(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Left_1;                   // 0x258(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Left_2;                   // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Left_3;                   // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Right_1;                  // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Right_2;                  // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Top_1;                    // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Face_Button_Top_2;                    // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_LB;                                   // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_LB_RB;                                // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_LT;                                   // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_RB;                                   // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_RS;                                   // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_RS_Click_1;                           // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_RS_Click_2;                           // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_RT;                                   // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Select_1;                             // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Select_2;                             // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Gamepad_Start;                                // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Mode;                                         // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_PS4_Dpad_Down;                                // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_PS4_Dpad_Left;                                // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_PS4_Dpad_Right;                               // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_PS4_Dpad_Up;                                  // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_PS4_LS;                                       // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_PS4_LS_Click;                                 // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Xbox_Dpad_Down;                               // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Xbox_Dpad_Left;                               // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Xbox_Dpad_Right;                              // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Xbox_Dpad_Up;                                 // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Xbox_LS;                                      // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      Text_Xbox_LS_Click;                                // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBox_PS4_LS_And_Dpad;                       // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBox_Xbox_LS_And_Dpad;                      // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GamepadMappingInfo_C");
		return Clss;
	}

	void HandleConfigChanged(int32 Mode, int32 Config, bool Temp_bool_Variable, bool K2Node_SwitchInteger_CmpSuccess, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable2, int32 Temp_int_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable2, int32 Temp_int_Variable2, class FText K2Node_Select_Default, class FText Temp_text_Variable3, class FText Temp_text_Variable4, bool Temp_bool_Variable2, class FText K2Node_Select2_Default, enum class ESlateVisibility Temp_byte_Variable3, enum class ESlateVisibility Temp_byte_Variable4, bool Temp_bool_Variable3, enum class ESlateVisibility Temp_byte_Variable5, enum class ESlateVisibility Temp_byte_Variable6, bool Temp_bool_Variable4, enum class ESlateVisibility Temp_byte_Variable7, enum class ESlateVisibility Temp_byte_Variable8, bool Temp_bool_Variable5, enum class ESlateVisibility Temp_byte_Variable9, enum class ESlateVisibility Temp_byte_Variable10, int32 Temp_int_Variable3, class FText Temp_text_Variable5, class FText Temp_text_Variable6, int32 Temp_int_Variable4, class FText K2Node_Select3_Default, class FText Temp_text_Variable7, class FText Temp_text_Variable8, int32 Temp_int_Variable5, class FText K2Node_Select4_Default, class FText Temp_text_Variable9, class FText Temp_text_Variable10, int32 Temp_int_Variable6, class FText K2Node_Select5_Default, class FText Temp_text_Variable11, class FText Temp_text_Variable12, int32 Temp_int_Variable7, class FText K2Node_Select6_Default, class FText Temp_text_Variable13, class FText Temp_text_Variable14, int32 Temp_int_Variable8, class FText K2Node_Select7_Default, class FText Temp_text_Variable15, class FText Temp_text_Variable16, int32 Temp_int_Variable9, class FText K2Node_Select8_Default, class FText Temp_text_Variable17, class FText Temp_text_Variable18, int32 Temp_int_Variable10, class FText K2Node_Select9_Default, class FText Temp_text_Variable19, class FText Temp_text_Variable20, int32 Temp_int_Variable11, class FText K2Node_Select10_Default, class FText Temp_text_Variable21, class FText Temp_text_Variable22, int32 Temp_int_Variable12, class FText K2Node_Select11_Default, class FText Temp_text_Variable23, class FText Temp_text_Variable24, int32 Temp_int_Variable13, class FText K2Node_Select12_Default, class FText Temp_text_Variable25, class FText Temp_text_Variable26, int32 Temp_int_Variable14, class FText K2Node_Select13_Default, class FText Temp_text_Variable27, class FText Temp_text_Variable28, int32 Temp_int_Variable15, class FText K2Node_Select14_Default, class FText Temp_text_Variable29, class FText Temp_text_Variable30, int32 Temp_int_Variable16, class FText K2Node_Select15_Default, class FText Temp_text_Variable31, class FText Temp_text_Variable32, int32 Temp_int_Variable17, class FText K2Node_Select16_Default, class FText Temp_text_Variable33, class FText Temp_text_Variable34, int32 Temp_int_Variable18, class FText K2Node_Select17_Default, class FText Temp_text_Variable35, class FText Temp_text_Variable36, int32 Temp_int_Variable19, class FText K2Node_Select18_Default, class FText Temp_text_Variable37, class FText Temp_text_Variable38, int32 Temp_int_Variable20, class FText K2Node_Select19_Default, class FText Temp_text_Variable39, class FText Temp_text_Variable40, int32 Temp_int_Variable21, class FText K2Node_Select20_Default, class FText Temp_text_Variable41, class FText Temp_text_Variable42, int32 Temp_int_Variable22, class FText K2Node_Select21_Default, class FText Temp_text_Variable43, class FText Temp_text_Variable44, int32 Temp_int_Variable23, class FText K2Node_Select22_Default, class FText Temp_text_Variable45, class FText Temp_text_Variable46, int32 Temp_int_Variable24, class FText K2Node_Select23_Default, class FText Temp_text_Variable47, class FText Temp_text_Variable48, int32 Temp_int_Variable25, class FText K2Node_Select24_Default, class FText Temp_text_Variable49, class FText Temp_text_Variable50, int32 Temp_int_Variable26, class FText K2Node_Select25_Default, class FText Temp_text_Variable51, class FText Temp_text_Variable52, int32 Temp_int_Variable27, class FText K2Node_Select26_Default, class FText Temp_text_Variable53, class FText Temp_text_Variable54, int32 Temp_int_Variable28, class FText K2Node_Select27_Default, class FText Temp_text_Variable55, class FText Temp_text_Variable56, int32 Temp_int_Variable29, class FText K2Node_Select28_Default, class FText Temp_text_Variable57, class FText Temp_text_Variable58, int32 Temp_int_Variable30, class FText K2Node_Select29_Default, class FText Temp_text_Variable59, class FText Temp_text_Variable60, int32 Temp_int_Variable31, class FText K2Node_Select30_Default, class FText Temp_text_Variable61, class FText Temp_text_Variable62, int32 Temp_int_Variable32, class FText K2Node_Select31_Default, class FText Temp_text_Variable63, class FText Temp_text_Variable64, int32 Temp_int_Variable33, class FText K2Node_Select32_Default, class FText Temp_text_Variable65, class FText Temp_text_Variable66, int32 Temp_int_Variable34, class FText K2Node_Select33_Default, class FText Temp_text_Variable67, class FText Temp_text_Variable68, int32 Temp_int_Variable35, class FText K2Node_Select34_Default, class FText Temp_text_Variable69, class FText Temp_text_Variable70, int32 Temp_int_Variable36, class FText K2Node_Select35_Default, class FText Temp_text_Variable71, class FText Temp_text_Variable72, int32 Temp_int_Variable37, class FText K2Node_Select36_Default, class FText Temp_text_Variable73, class FText Temp_text_Variable74, int32 Temp_int_Variable38, class FText K2Node_Select37_Default, class FText Temp_text_Variable75, class FText Temp_text_Variable76, int32 Temp_int_Variable39, class FText K2Node_Select38_Default, class FText Temp_text_Variable77, class FText Temp_text_Variable78, int32 Temp_int_Variable40, class FText K2Node_Select39_Default, class FText Temp_text_Variable79, class FText Temp_text_Variable80, int32 Temp_int_Variable41, class FText K2Node_Select40_Default, class FText Temp_text_Variable81, class FText Temp_text_Variable82, int32 Temp_int_Variable42, class FText K2Node_Select41_Default, class FText Temp_text_Variable83, class FText Temp_text_Variable84, int32 Temp_int_Variable43, class FText K2Node_Select42_Default, class FText Temp_text_Variable85, class FText Temp_text_Variable86, int32 Temp_int_Variable44, class FText K2Node_Select43_Default, class FText Temp_text_Variable87, class FText Temp_text_Variable88, int32 Temp_int_Variable45, class FText K2Node_Select44_Default, class FText Temp_text_Variable89, class FText Temp_text_Variable90, int32 Temp_int_Variable46, class FText K2Node_Select45_Default, class FText Temp_text_Variable91, class FText Temp_text_Variable92, int32 Temp_int_Variable47, class FText K2Node_Select46_Default, class FText Temp_text_Variable93, class FText Temp_text_Variable94, int32 Temp_int_Variable48, class FText K2Node_Select47_Default, class FText Temp_text_Variable95, class FText Temp_text_Variable96, int32 Temp_int_Variable49, class FText K2Node_Select48_Default, class FText Temp_text_Variable97, class FText Temp_text_Variable98, class FText K2Node_Select49_Default, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_GetText_ReturnValue, bool CallFunc_EqualEqual_TextText_ReturnValue, enum class ESlateVisibility K2Node_Select50_Default, class FText CallFunc_MakeLiteralText_ReturnValue2, class FText CallFunc_MakeLiteralText_ReturnValue3, class FText CallFunc_MakeLiteralText_ReturnValue4, class FText CallFunc_MakeLiteralText_ReturnValue5, class FText CallFunc_GetText_ReturnValue2, class FText CallFunc_GetText_ReturnValue3, bool CallFunc_EqualEqual_TextText_ReturnValue2, bool CallFunc_EqualEqual_TextText_ReturnValue3, enum class ESlateVisibility K2Node_Select51_Default, enum class ESlateVisibility K2Node_Select52_Default, class FText CallFunc_GetText_ReturnValue4, class FText CallFunc_GetText_ReturnValue5, bool CallFunc_EqualEqual_TextText_ReturnValue4, bool CallFunc_EqualEqual_TextText_ReturnValue5, enum class ESlateVisibility K2Node_Select53_Default, enum class ESlateVisibility K2Node_Select54_Default, class FText Temp_text_Variable99, class FText Temp_text_Variable100, int32 Temp_int_Variable50, class FText K2Node_Select55_Default);
	void HandleConfigChanged_Athena(int32 Mode, int32 Config, int32 Temp_int_Variable, bool K2Node_SwitchInteger_CmpSuccess, class FText Temp_text_Variable, class FText Temp_text_Variable2, bool Temp_bool_Variable, class FText K2Node_Select_Default, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable2, int32 Temp_int_Variable2, class FText Temp_text_Variable3, class FText Temp_text_Variable4, class FText Temp_text_Variable5, int32 Temp_int_Variable3, class FText K2Node_Select2_Default, class FText Temp_text_Variable6, class FText Temp_text_Variable7, class FText Temp_text_Variable8, bool Temp_bool_Variable2, enum class ESlateVisibility Temp_byte_Variable3, class FText K2Node_Select3_Default, enum class ESlateVisibility Temp_byte_Variable4, bool Temp_bool_Variable3, enum class ESlateVisibility Temp_byte_Variable5, enum class ESlateVisibility Temp_byte_Variable6, bool Temp_bool_Variable4, enum class ESlateVisibility Temp_byte_Variable7, enum class ESlateVisibility Temp_byte_Variable8, bool Temp_bool_Variable5, enum class ESlateVisibility Temp_byte_Variable9, enum class ESlateVisibility Temp_byte_Variable10, int32 Temp_int_Variable4, class FText Temp_text_Variable9, class FText Temp_text_Variable10, class FText Temp_text_Variable11, int32 Temp_int_Variable5, class FText K2Node_Select4_Default, class FText Temp_text_Variable12, class FText Temp_text_Variable13, class FText Temp_text_Variable14, int32 Temp_int_Variable6, class FText K2Node_Select5_Default, class FText Temp_text_Variable15, class FText Temp_text_Variable16, class FText Temp_text_Variable17, int32 Temp_int_Variable7, class FText K2Node_Select6_Default, class FText Temp_text_Variable18, class FText Temp_text_Variable19, class FText Temp_text_Variable20, int32 Temp_int_Variable8, class FText K2Node_Select7_Default, class FText Temp_text_Variable21, class FText Temp_text_Variable22, class FText Temp_text_Variable23, int32 Temp_int_Variable9, class FText K2Node_Select8_Default, class FText Temp_text_Variable24, class FText Temp_text_Variable25, class FText Temp_text_Variable26, int32 Temp_int_Variable10, class FText K2Node_Select9_Default, class FText Temp_text_Variable27, class FText Temp_text_Variable28, class FText Temp_text_Variable29, int32 Temp_int_Variable11, class FText K2Node_Select10_Default, class FText Temp_text_Variable30, class FText Temp_text_Variable31, class FText Temp_text_Variable32, int32 Temp_int_Variable12, class FText K2Node_Select11_Default, class FText Temp_text_Variable33, class FText Temp_text_Variable34, class FText Temp_text_Variable35, int32 Temp_int_Variable13, class FText K2Node_Select12_Default, class FText Temp_text_Variable36, class FText Temp_text_Variable37, class FText Temp_text_Variable38, int32 Temp_int_Variable14, class FText K2Node_Select13_Default, class FText Temp_text_Variable39, class FText Temp_text_Variable40, class FText Temp_text_Variable41, int32 Temp_int_Variable15, class FText K2Node_Select14_Default, class FText Temp_text_Variable42, class FText Temp_text_Variable43, class FText Temp_text_Variable44, int32 Temp_int_Variable16, class FText K2Node_Select15_Default, class FText Temp_text_Variable45, class FText Temp_text_Variable46, class FText Temp_text_Variable47, int32 Temp_int_Variable17, class FText K2Node_Select16_Default, class FText Temp_text_Variable48, class FText Temp_text_Variable49, class FText Temp_text_Variable50, int32 Temp_int_Variable18, class FText K2Node_Select17_Default, class FText Temp_text_Variable51, class FText Temp_text_Variable52, class FText Temp_text_Variable53, int32 Temp_int_Variable19, class FText K2Node_Select18_Default, class FText Temp_text_Variable54, class FText Temp_text_Variable55, class FText Temp_text_Variable56, int32 Temp_int_Variable20, class FText K2Node_Select19_Default, class FText Temp_text_Variable57, class FText Temp_text_Variable58, class FText Temp_text_Variable59, int32 Temp_int_Variable21, class FText K2Node_Select20_Default, class FText Temp_text_Variable60, class FText Temp_text_Variable61, class FText Temp_text_Variable62, int32 Temp_int_Variable22, class FText K2Node_Select21_Default, class FText Temp_text_Variable63, class FText Temp_text_Variable64, class FText Temp_text_Variable65, int32 Temp_int_Variable23, class FText K2Node_Select22_Default, class FText Temp_text_Variable66, class FText Temp_text_Variable67, class FText Temp_text_Variable68, int32 Temp_int_Variable24, class FText K2Node_Select23_Default, class FText Temp_text_Variable69, class FText Temp_text_Variable70, class FText Temp_text_Variable71, int32 Temp_int_Variable25, class FText K2Node_Select24_Default, class FText Temp_text_Variable72, class FText Temp_text_Variable73, class FText Temp_text_Variable74, int32 Temp_int_Variable26, class FText K2Node_Select25_Default, class FText Temp_text_Variable75, class FText Temp_text_Variable76, class FText Temp_text_Variable77, int32 Temp_int_Variable27, class FText K2Node_Select26_Default, class FText Temp_text_Variable78, class FText Temp_text_Variable79, class FText Temp_text_Variable80, int32 Temp_int_Variable28, class FText K2Node_Select27_Default, class FText Temp_text_Variable81, class FText Temp_text_Variable82, class FText Temp_text_Variable83, int32 Temp_int_Variable29, class FText K2Node_Select28_Default, class FText Temp_text_Variable84, class FText Temp_text_Variable85, int32 Temp_int_Variable30, class FText K2Node_Select29_Default, class FText Temp_text_Variable86, class FText Temp_text_Variable87, class FText Temp_text_Variable88, int32 Temp_int_Variable31, class FText K2Node_Select30_Default, class FText Temp_text_Variable89, class FText Temp_text_Variable90, class FText Temp_text_Variable91, int32 Temp_int_Variable32, class FText K2Node_Select31_Default, class FText Temp_text_Variable92, class FText Temp_text_Variable93, class FText Temp_text_Variable94, int32 Temp_int_Variable33, class FText K2Node_Select32_Default, class FText Temp_text_Variable95, class FText Temp_text_Variable96, class FText Temp_text_Variable97, int32 Temp_int_Variable34, class FText K2Node_Select33_Default, class FText Temp_text_Variable98, class FText Temp_text_Variable99, class FText Temp_text_Variable100, int32 Temp_int_Variable35, class FText K2Node_Select34_Default, class FText Temp_text_Variable101, class FText Temp_text_Variable102, class FText Temp_text_Variable103, int32 Temp_int_Variable36, class FText K2Node_Select35_Default, class FText Temp_text_Variable104, class FText Temp_text_Variable105, class FText Temp_text_Variable106, int32 Temp_int_Variable37, class FText K2Node_Select36_Default, class FText Temp_text_Variable107, class FText Temp_text_Variable108, class FText Temp_text_Variable109, int32 Temp_int_Variable38, class FText K2Node_Select37_Default, class FText Temp_text_Variable110, class FText Temp_text_Variable111, class FText Temp_text_Variable112, int32 Temp_int_Variable39, class FText K2Node_Select38_Default, class FText Temp_text_Variable113, class FText Temp_text_Variable114, class FText Temp_text_Variable115, int32 Temp_int_Variable40, class FText K2Node_Select39_Default, class FText Temp_text_Variable116, class FText Temp_text_Variable117, class FText Temp_text_Variable118, int32 Temp_int_Variable41, class FText K2Node_Select40_Default, class FText Temp_text_Variable119, class FText Temp_text_Variable120, class FText Temp_text_Variable121, int32 Temp_int_Variable42, class FText K2Node_Select41_Default, class FText Temp_text_Variable122, class FText Temp_text_Variable123, class FText Temp_text_Variable124, int32 Temp_int_Variable43, class FText K2Node_Select42_Default, class FText Temp_text_Variable125, class FText Temp_text_Variable126, class FText Temp_text_Variable127, int32 Temp_int_Variable44, class FText K2Node_Select43_Default, class FText Temp_text_Variable128, class FText Temp_text_Variable129, class FText Temp_text_Variable130, int32 Temp_int_Variable45, class FText K2Node_Select44_Default, class FText Temp_text_Variable131, class FText Temp_text_Variable132, class FText Temp_text_Variable133, int32 Temp_int_Variable46, class FText K2Node_Select45_Default, class FText Temp_text_Variable134, class FText Temp_text_Variable135, class FText Temp_text_Variable136, int32 Temp_int_Variable47, class FText K2Node_Select46_Default, class FText Temp_text_Variable137, class FText Temp_text_Variable138, class FText Temp_text_Variable139, int32 Temp_int_Variable48, class FText K2Node_Select47_Default, class FText Temp_text_Variable140, class FText Temp_text_Variable141, class FText Temp_text_Variable142, int32 Temp_int_Variable49, class FText K2Node_Select48_Default, class FText Temp_text_Variable143, class FText Temp_text_Variable144, class FText Temp_text_Variable145, int32 Temp_int_Variable50, class FText K2Node_Select49_Default, class FText Temp_text_Variable146, class FText Temp_text_Variable147, class FText Temp_text_Variable148, class FText CallFunc_GetText_ReturnValue, class FText K2Node_Select50_Default, class FText CallFunc_MakeLiteralText_ReturnValue, bool CallFunc_EqualEqual_TextText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue2, class FText CallFunc_GetText_ReturnValue2, bool CallFunc_EqualEqual_TextText_ReturnValue2, enum class ESlateVisibility K2Node_Select51_Default, class FText CallFunc_MakeLiteralText_ReturnValue3, class FText CallFunc_MakeLiteralText_ReturnValue4, class FText CallFunc_MakeLiteralText_ReturnValue5, class FText CallFunc_MakeLiteralText_ReturnValue6, class FText CallFunc_GetText_ReturnValue3, class FText CallFunc_GetText_ReturnValue4, bool CallFunc_EqualEqual_TextText_ReturnValue3, bool CallFunc_EqualEqual_TextText_ReturnValue4, enum class ESlateVisibility K2Node_Select52_Default, enum class ESlateVisibility K2Node_Select53_Default, class FText CallFunc_GetText_ReturnValue5, class FText CallFunc_GetText_ReturnValue6, bool CallFunc_EqualEqual_TextText_ReturnValue5, bool CallFunc_EqualEqual_TextText_ReturnValue6, enum class ESlateVisibility K2Node_Select54_Default, enum class ESlateVisibility K2Node_Select55_Default, enum class ESlateVisibility Temp_byte_Variable11, enum class ESlateVisibility Temp_byte_Variable12, bool Temp_bool_Variable6, enum class ESlateVisibility K2Node_Select56_Default);
	void OnConfigChanged(int32 Mode, int32 Config, class UFortGlobalUIContext* CallFunc_GetContext_ReturnValue, enum class ESubGame CallFunc_GetSubGame_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void Update_Displayed_Mapping(int32 Platform, int32 Mode, int32 Configuration, class UTexture2D* T_Mode_Combat, class UTexture2D* T_Mode_Build, class UTexture2D* T_PS4_Lines, class UTexture2D* T_XboxOne_Lines, class UTexture2D* T_PS4, class UTexture2D* T_XboxOne, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable2, int32 Temp_int_Variable, enum class ESlateVisibility Temp_byte_Variable3, enum class ESlateVisibility Temp_byte_Variable4, int32 Temp_int_Variable2, enum class ESlateVisibility K2Node_Select_Default, int32 Temp_int_Variable3, class FText Temp_text_Variable, class FText Temp_text_Variable2, int32 Temp_int_Variable4, class FText K2Node_Select2_Default, int32 Temp_int_Variable5, int32 Temp_int_Variable6, class UTexture2D* K2Node_Select3_Default, enum class ESlateVisibility K2Node_Select4_Default, class UTexture2D* K2Node_Select5_Default, class UTexture2D* K2Node_Select6_Default);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
