#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0xC0 - 0x0)
// UserDefinedStruct SkillTreepAGEColors.SkillTreePageColors
struct FSkillTreePageColors
{
public:
	struct FLinearColor                          T1BG0_10_39FEA5C7443546B90BA85BBBC67C96D2;         // 0x0(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T1BG1_9_91F62BB74BD541D20CC6EE8BEB5B0CB7;          // 0x10(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T1Grid_11_6B9B0EBA4C99CAB1254B3EA7B751F220;        // 0x20(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T2BG0_24_D91F4CC2428FE301E9AFA5A43E9EAA2A;         // 0x30(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T2BG1_25_FD5C9F034E713574DDD437A9305F10B0;         // 0x40(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T2Grid_30_EA0C673D4AC076F4C72827BFFF9FDCA1;        // 0x50(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T3BG0_26_654D1F82476D069B1AC07E918AEDC2F9;         // 0x60(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T3BG1_27_55A78A2A4AE1A70DFFAF038D9C75D0D7;         // 0x70(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T3Grid_31_2560DD1A4AA0EA071F4553B630D5C68C;        // 0x80(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T4BG0_28_4307BC624FD8965A5838D4BE7D38E4AB;         // 0x90(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T4BG1_29_EFAEB9A448F3D7FCF8E3F8832E3D1DB7;         // 0xA0(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          T4Grid_32_2972154648B9DB30252D0DBAA218D0A2;        // 0xB0(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
