#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0x368 - 0x2A8)
// WidgetBlueprintGeneratedClass TabGameOptionsMain.TabGameOptionsMain_C
class UTabGameOptionsMain_C : public UTabGameOptions_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2A8(0x8)(Transient, DuplicateTransient)
	class URotatorSelector_C*                    AutoEquipBetterItems;                              // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    ConsoleUnlockedFPS;                                // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  ControllerLookSensitivityPItch;                    // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  ControllerLookSensitivityYaw;                      // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    EquipFirstBuildingPieceWhenSwappingQuickbars;      // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    First_PersonCamera;                                // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    ForceFeedback;                                     // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  GamepadScopedMultiplier;                           // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  GamepadTargetingMultiplier;                        // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    InvertMouse;                                       // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    Language;                                          // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  MouseScopedMultiplier;                             // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  MouseSensitivity;                                  // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  MouseTargetingMultiplier;                          // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    Region;                                            // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOptionsMenuSlider_C*                  SafeZone;                                          // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    ShowBackpack;                                      // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    ShowHeadAccessories;                               // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    SprintCancelsReload;                               // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    TapInteract;                                       // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    ToggleSprint;                                      // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URotatorSelector_C*                    ToggleTargeting;                                   // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      TooltipDisplayReference;                           // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("TabGameOptionsMain_C");
		return Clss;
	}

	void IntializeGamepadSensitivitySliders(bool Local_IsPS4, bool Temp_bool_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable2, bool Temp_bool_Variable2, class FText Temp_text_Variable3, class FText Temp_text_Variable4, bool Temp_bool_Variable3, class FText Temp_text_Variable5, class FText Temp_text_Variable6, bool Temp_bool_Variable4, class FText Temp_text_Variable7, class FText Temp_text_Variable8, class FText K2Node_Select_Default, class FText K2Node_Select2_Default, class FText K2Node_Select3_Default, class FText K2Node_Select4_Default, bool CallFunc_IsPS4Platform_ReturnValue, const struct FVector2D& CallFunc_GetGamepadLookSensitivityValue_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y);
	void Initialize_Data(const TArray<class FText>& OffOnOptions, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue2, TArray<class FText>& CallFunc_GetRegionDisplayNames_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue3, class FText CallFunc_MakeLiteralText_ReturnValue4, class FText CallFunc_MakeLiteralText_ReturnValue5, class FText CallFunc_MakeLiteralText_ReturnValue6, class FText CallFunc_MakeLiteralText_ReturnValue7, class FText CallFunc_MakeLiteralText_ReturnValue8, class FText CallFunc_MakeLiteralText_ReturnValue9, TArray<class FText>& K2Node_MakeArray_Array, bool CallFunc_IsPS4Platform_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue10, class FText CallFunc_MakeLiteralText_ReturnValue11, class FText CallFunc_MakeLiteralText_ReturnValue12, class FText CallFunc_MakeLiteralText_ReturnValue13, TArray<class FText>& CallFunc_GetPossibleLanguages_ReturnValue, class FText Temp_text_Variable, class FText CallFunc_MakeLiteralText_ReturnValue14, class FText CallFunc_MakeLiteralText_ReturnValue15, class FText CallFunc_MakeLiteralText_ReturnValue16, class FText CallFunc_MakeLiteralText_ReturnValue17, class FText CallFunc_MakeLiteralText_ReturnValue18, class FText CallFunc_MakeLiteralText_ReturnValue19, class FText CallFunc_MakeLiteralText_ReturnValue20, class FText CallFunc_MakeLiteralText_ReturnValue21, class FText CallFunc_MakeLiteralText_ReturnValue22, class FText Temp_text_Variable2, class FText CallFunc_MakeLiteralText_ReturnValue23, bool Temp_bool_Variable, class FText K2Node_Select_Default, class FText CallFunc_MakeLiteralText_ReturnValue24, class FText CallFunc_MakeLiteralText_ReturnValue25, class FText CallFunc_MakeLiteralText_ReturnValue26, class FText CallFunc_MakeLiteralText_ReturnValue27);
	void Update_Data(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable2, bool Temp_bool_Variable2, enum class ESlateVisibility Temp_byte_Variable3, enum class ESlateVisibility Temp_byte_Variable4, class UFortHomebaseUIContext* CallFunc_GetContext_ReturnValue, class UFortHomebaseUIContext* CallFunc_GetContext_ReturnValue2, bool CallFunc_GetShowHeroBackpackForLocalPlayer_ReturnValue, bool CallFunc_GetShowHeroHeadAccessoriesForLocalPlayer_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue2, bool Temp_bool_Variable3, enum class ESlateVisibility Temp_byte_Variable5, enum class ESlateVisibility Temp_byte_Variable6, bool Temp_bool_Variable4, enum class ESlateVisibility Temp_byte_Variable7, enum class ESlateVisibility Temp_byte_Variable8, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue2, bool CallFunc_IsPS4Platform_ReturnValue, enum class ESlateVisibility Temp_byte_Variable9, enum class ESlateVisibility Temp_byte_Variable10, bool CallFunc_GetConsoleUnlockedFPSState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue3, float CallFunc_GetGamepadScopedMultiplierValue_ReturnValue, float CallFunc_GetGamepadTargetingMultiplierValue_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue3, class FText CallFunc_MakeLiteralText_ReturnValue4, class FText CallFunc_MakeLiteralText_ReturnValue5, class FText CallFunc_MakeLiteralText_ReturnValue6, bool CallFunc_IsXboxPlatform_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, bool CallFunc_GetTargetingToggleState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue4, float CallFunc_GetScopedMultiplierValue_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue7, class FText CallFunc_MakeLiteralText_ReturnValue8, float CallFunc_GetTargetingMultiplierValue_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue9, class FText CallFunc_MakeLiteralText_ReturnValue10, bool CallFunc_IsAthena_ReturnValue, int32 CallFunc_GetCurrentRegion_ReturnValue, bool Temp_bool_Variable5, bool CallFunc_IsAthena_ReturnValue2, bool Temp_bool_Variable6, enum class ESlateVisibility K2Node_Select2_Default, class FText K2Node_Select3_Default, bool CallFunc_GetTapInteractState_ReturnValue, bool CallFunc_GetFocusOnFirstBuildingPieceWhenQuickbarSwappedState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue5, int32 CallFunc_Conv_BoolToInt_ReturnValue6, bool CallFunc_IsPS4Platform_ReturnValue2, bool CallFunc_IsXboxPlatform_ReturnValue2, bool CallFunc_BooleanOR_ReturnValue, enum class ESlateVisibility K2Node_Select4_Default, enum class ESlateVisibility K2Node_Select5_Default, enum class ESlateVisibility K2Node_Select6_Default, bool Temp_bool_Variable7, int32 CallFunc_GetCurrentLanguage_ReturnValue, class FText K2Node_Select7_Default, float CallFunc_GetSafeZoneValue_ReturnValue, bool CallFunc_GetSprintCancelsReloadState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue7, class FText CallFunc_MakeLiteralText_ReturnValue11, class FText CallFunc_MakeLiteralText_ReturnValue12, class FText CallFunc_MakeLiteralText_ReturnValue13, bool CallFunc_GetForceFeedbackState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue8, bool CallFunc_GetLookInversionState_ReturnValue, bool CallFunc_GetFirstPersonCameraState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue9, int32 CallFunc_Conv_BoolToInt_ReturnValue10, bool CallFunc_GetAutoEquipState_ReturnValue, bool CallFunc_GetSprintToggleState_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue11, int32 CallFunc_Conv_BoolToInt_ReturnValue12, float CallFunc_GetMouseSensitivityValue_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue14);
	void Construct();
	void BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature(float Slider_Value);
	void UpdateOptionsTab();
	void CenterOnTab();
	void BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature(float Slider_Value);
	void UpdatePossibleLanguages();
	void BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__First_PersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature(float Slider_Value);
	void BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature(int32 Selected_Index);
	void ExecuteUbergraph_TabGameOptionsMain(int32 EntryPoint, float K2Node_ComponentBoundEvent_Slider_Value8, float K2Node_ComponentBoundEvent_Slider_Value7, float K2Node_ComponentBoundEvent_Slider_Value6, float K2Node_ComponentBoundEvent_Slider_Value5, bool CallFunc_IsXboxPlatform_ReturnValue, bool CallFunc_IsPS4Platform_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue2, TArray<class FText>& CallFunc_GetPossibleLanguages_ReturnValue, int32 CallFunc_GetCurrentLanguage_ReturnValue, class UObject* CallFunc_GetItemAt_ReturnValue, class UWidget* CallFunc_GetListWidget_ReturnValue, int32 K2Node_ComponentBoundEvent_Selected_Index14, class UOptionsMenuHudRotator_C* K2Node_DynamicCast_AsOptions_Menu_Hud_Rotator, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Conv_IntToBool_ReturnValue, class UFortHomebaseUIContext* CallFunc_GetContext_ReturnValue, int32 K2Node_ComponentBoundEvent_Selected_Index13, class UFortHomebaseUIContext* CallFunc_GetContext_ReturnValue2, bool CallFunc_Conv_IntToBool_ReturnValue2, int32 K2Node_ComponentBoundEvent_Selected_Index12, int32 K2Node_ComponentBoundEvent_Selected_Index11, bool CallFunc_Conv_IntToBool_ReturnValue3, int32 K2Node_ComponentBoundEvent_Selected_Index10, bool CallFunc_Conv_IntToBool_ReturnValue4, int32 K2Node_ComponentBoundEvent_Selected_Index9, bool CallFunc_Conv_IntToBool_ReturnValue5, int32 K2Node_ComponentBoundEvent_Selected_Index8, bool CallFunc_Conv_IntToBool_ReturnValue6, int32 K2Node_ComponentBoundEvent_Selected_Index7, bool CallFunc_Conv_IntToBool_ReturnValue7, int32 K2Node_ComponentBoundEvent_Selected_Index6, bool CallFunc_Conv_IntToBool_ReturnValue8, int32 K2Node_ComponentBoundEvent_Selected_Index5, bool CallFunc_Conv_IntToBool_ReturnValue9, int32 K2Node_ComponentBoundEvent_Selected_Index4, bool CallFunc_Conv_IntToBool_ReturnValue10, int32 K2Node_ComponentBoundEvent_Selected_Index3, float K2Node_ComponentBoundEvent_Slider_Value4, float K2Node_ComponentBoundEvent_Slider_Value3, int32 K2Node_ComponentBoundEvent_Selected_Index2, float K2Node_ComponentBoundEvent_Slider_Value2, bool CallFunc_Conv_IntToBool_ReturnValue11, float K2Node_ComponentBoundEvent_Slider_Value, int32 K2Node_ComponentBoundEvent_Selected_Index, bool CallFunc_Conv_IntToBool_ReturnValue12);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
